;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:15 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../ClientNotifyMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$1215, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1215, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$1215, DW_AT_decl_column(0x0e)
$C$DW$T$1216	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$1216, DW_AT_type(*$C$DW$T$1215)
	.dwattr $C$DW$T$1216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1216, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1216, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$1216, DW_AT_decl_column(0x03)

$C$DW$T$1217	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1217, DW_AT_byte_size(0x01)
$C$DW$1259	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1259, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x05)
$C$DW$1260	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1260, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x05)
$C$DW$1261	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1217

	.dwattr $C$DW$T$1217, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1217, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$1217, DW_AT_decl_column(0x0e)
$C$DW$T$1218	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$1218, DW_AT_type(*$C$DW$T$1217)
	.dwattr $C$DW$T$1218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1218, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1218, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1218, DW_AT_decl_column(0x03)

$C$DW$T$1219	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1219, DW_AT_byte_size(0x02)
$C$DW$1262	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x05)
$C$DW$1263	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1263, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x05)
$C$DW$1264	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1219

	.dwattr $C$DW$T$1219, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1219, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1219, DW_AT_decl_column(0x0e)
$C$DW$T$1220	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1220, DW_AT_type(*$C$DW$T$1219)
	.dwattr $C$DW$T$1220, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1220, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1220, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1220, DW_AT_decl_column(0x03)

$C$DW$T$1221	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1221, DW_AT_byte_size(0x01)
$C$DW$1265	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x05)
$C$DW$1266	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1266, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x05)
$C$DW$1267	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1267, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1221

	.dwattr $C$DW$T$1221, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1221, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1221, DW_AT_decl_column(0x0e)
$C$DW$T$1222	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1222, DW_AT_type(*$C$DW$T$1221)
	.dwattr $C$DW$T$1222, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1222, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1222, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1222, DW_AT_decl_column(0x03)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1268, DW_AT_name("length")
	.dwattr $C$DW$1268, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x16)
$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1269, DW_AT_name("elem")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$1223	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1223, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$1223, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1223, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1223, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1223, DW_AT_decl_column(0x43)
$C$DW$T$1224	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1224, DW_AT_type(*$C$DW$T$1223)
	.dwattr $C$DW$T$1224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1224, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1224, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1224, DW_AT_decl_column(0x30)
$C$DW$T$1225	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1225, DW_AT_type(*$C$DW$T$1224)
	.dwattr $C$DW$T$1225, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1225, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1225, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1225, DW_AT_decl_column(0x2c)

$C$DW$T$305	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$305, DW_AT_byte_size(0x08)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1270, DW_AT_name("length")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x16)
$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1271, DW_AT_name("elem")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$305

	.dwattr $C$DW$T$305, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x10)
$C$DW$T$1226	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1226, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$T$1226, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1226, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1226, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1226, DW_AT_decl_column(0x43)
$C$DW$T$1227	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1227, DW_AT_type(*$C$DW$T$1226)
	.dwattr $C$DW$T$1227, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1227, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1227, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1227, DW_AT_decl_column(0x2f)
$C$DW$T$1228	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1228, DW_AT_type(*$C$DW$T$1227)
	.dwattr $C$DW$T$1228, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1228, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1228, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1228, DW_AT_decl_column(0x2b)

$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x08)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1272, DW_AT_name("length")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x16)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1273, DW_AT_name("elem")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$308

	.dwattr $C$DW$T$308, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$1229	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1229, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$1229, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1229, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1229, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1229, DW_AT_decl_column(0x42)
$C$DW$T$1230	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1230, DW_AT_type(*$C$DW$T$1229)
	.dwattr $C$DW$T$1230, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1230, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1230, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1230, DW_AT_decl_column(0x2b)
$C$DW$T$1231	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1231, DW_AT_type(*$C$DW$T$1230)
	.dwattr $C$DW$T$1231, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1231, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1231, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1231, DW_AT_decl_column(0x27)

$C$DW$T$312	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$312, DW_AT_byte_size(0x08)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1274, DW_AT_name("length")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x275)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x16)
$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1275, DW_AT_name("elem")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x275)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x44)
	.dwendtag $C$DW$T$312

	.dwattr $C$DW$T$312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$312, DW_AT_decl_line(0x275)
	.dwattr $C$DW$T$312, DW_AT_decl_column(0x10)
$C$DW$T$1232	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1232, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$T$1232, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1232, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1232, DW_AT_decl_line(0x275)
	.dwattr $C$DW$T$1232, DW_AT_decl_column(0x4c)
$C$DW$T$1233	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1233, DW_AT_type(*$C$DW$T$1232)
	.dwattr $C$DW$T$1233, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1233, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1233, DW_AT_decl_line(0x276)
	.dwattr $C$DW$T$1233, DW_AT_decl_column(0x35)
$C$DW$T$1234	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
	.dwattr $C$DW$T$1234, DW_AT_type(*$C$DW$T$1233)
	.dwattr $C$DW$T$1234, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1234, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/family/arm/m3/Hwi.h")
	.dwattr $C$DW$T$1234, DW_AT_decl_line(0x277)
	.dwattr $C$DW$T$1234, DW_AT_decl_column(0x31)

$C$DW$T$315	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$315, DW_AT_byte_size(0x08)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1276, DW_AT_name("length")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x16)
$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1277, DW_AT_name("elem")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$315

	.dwattr $C$DW$T$315, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x10)
$C$DW$T$1235	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1235, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$T$1235, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1235, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1235, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1235, DW_AT_decl_column(0x43)
$C$DW$T$1236	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1236, DW_AT_type(*$C$DW$T$1235)
	.dwattr $C$DW$T$1236, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1236, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1236, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1236, DW_AT_decl_column(0x2c)
$C$DW$T$1237	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1237, DW_AT_type(*$C$DW$T$1236)
	.dwattr $C$DW$T$1237, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1237, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1237, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1237, DW_AT_decl_column(0x28)

$C$DW$T$319	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$319, DW_AT_byte_size(0x04)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$1278, DW_AT_name("f")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x0f)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1279, DW_AT_name("a")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$319

	.dwattr $C$DW$T$319, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$319, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$319, DW_AT_decl_column(0x0f)
$C$DW$T$1238	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1238, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$T$1238, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1238, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1238, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1238, DW_AT_decl_column(0x03)

$C$DW$T$330	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$330, DW_AT_name("ClientNotifyMgr_Attrs_Tag")
	.dwattr $C$DW$T$330, DW_AT_byte_size(0x24)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1280, DW_AT_name("status")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x17)
$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1281, DW_AT_name("version")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x17)
$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1282, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1282, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1282, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x17)
$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1283, DW_AT_name("eventNo")
	.dwattr $C$DW$1283, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x17)
$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1284, DW_AT_name("maxClients")
	.dwattr $C$DW$1284, DW_AT_TI_symbol_name("maxClients")
	.dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x17)
$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1285, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1285, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x17)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1286, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1286, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x17)
$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1287, DW_AT_name("numActClients")
	.dwattr $C$DW$1287, DW_AT_TI_symbol_name("numActClients")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x17)
$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1288, DW_AT_name("entryId")
	.dwattr $C$DW$1288, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$330

	.dwattr $C$DW$T$330, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x10)
$C$DW$T$371	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Attrs")
	.dwattr $C$DW$T$371, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$T$371, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$371, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$371, DW_AT_decl_line(0xef)
	.dwattr $C$DW$T$371, DW_AT_decl_column(0x03)
$C$DW$T$372	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$371)
$C$DW$T$373	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$372)
	.dwattr $C$DW$T$373, DW_AT_address_class(0x20)

$C$DW$T$1240	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1240, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1240, DW_AT_byte_size(0x01)
$C$DW$1289	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1289, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1240

	.dwattr $C$DW$T$1240, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1240, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1240, DW_AT_decl_column(0x0e)
$C$DW$T$1241	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1241, DW_AT_type(*$C$DW$T$1240)
	.dwattr $C$DW$T$1241, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1241, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1241, DW_AT_decl_column(0x03)

$C$DW$T$335	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$335, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$335, DW_AT_byte_size(0x10)
$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1290, DW_AT_name("gate")
	.dwattr $C$DW$1290, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x1b)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1291, DW_AT_name("numProcessors")
	.dwattr $C$DW$1291, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x0f)
$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1292, DW_AT_name("procIds")
	.dwattr $C$DW$1292, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x0f)
$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1293, DW_AT_name("drvHandles")
	.dwattr $C$DW$1293, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$335

	.dwattr $C$DW$T$335, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x10)
$C$DW$T$350	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x03)
$C$DW$T$1242	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1242, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$T$1242, DW_AT_address_class(0x20)

$C$DW$T$359	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$359, DW_AT_name("ClientNotifyMgr_ModuleObject_Tag")
	.dwattr $C$DW$T$359, DW_AT_byte_size(0x2ea64)
$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1294, DW_AT_name("refCount")
	.dwattr $C$DW$1294, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1294, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x20)
$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1295, DW_AT_name("gate")
	.dwattr $C$DW$1295, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1295, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x21)
$C$DW$1296	.dwtag  DW_TAG_member
	.dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1296, DW_AT_name("numProcessors")
	.dwattr $C$DW$1296, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1296, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1296, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x21)
$C$DW$1297	.dwtag  DW_TAG_member
	.dwattr $C$DW$1297, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1297, DW_AT_name("nameServer")
	.dwattr $C$DW$1297, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$1297, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1297, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1297, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x21)
$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1298, DW_AT_name("nameServerType")
	.dwattr $C$DW$1298, DW_AT_TI_symbol_name("nameServerType")
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1298, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1298, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x21)
$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1299, DW_AT_name("usrGate")
	.dwattr $C$DW$1299, DW_AT_TI_symbol_name("usrGate")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1299, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x21)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1300, DW_AT_name("instRefCount")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("instRefCount")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1300, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x21)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1301, DW_AT_name("isEventRegistered")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("isEventRegistered")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2818]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1301, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x21)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$1302, DW_AT_name("objList")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0xf018]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1302, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x21)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$1303, DW_AT_name("eventListenerList")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("eventListenerList")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0xf01c]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1303, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x21)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1304, DW_AT_name("listLock")
	.dwattr $C$DW$1304, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1181c]
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1304, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x21)
$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1305, DW_AT_name("cfg")
	.dwattr $C$DW$1305, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0x11820]
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1305, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x21)
$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1306, DW_AT_name("defaultCfg")
	.dwattr $C$DW$1306, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$1306, DW_AT_data_member_location[DW_OP_plus_uconst 0x11830]
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1306, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1306, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x21)
$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1307, DW_AT_name("callBackCtxPtrs")
	.dwattr $C$DW$1307, DW_AT_TI_symbol_name("callBackCtxPtrs")
	.dwattr $C$DW$1307, DW_AT_data_member_location[DW_OP_plus_uconst 0x11840]
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1307, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1307, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x09)
$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$1308, DW_AT_name("isInstNoValid")
	.dwattr $C$DW$1308, DW_AT_TI_symbol_name("isInstNoValid")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a840]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1308, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x0b)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$1309, DW_AT_name("swiPostInfo")
	.dwattr $C$DW$1309, DW_AT_TI_symbol_name("swiPostInfo")
	.dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2aa40]
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1309, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x2a)
$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1310, DW_AT_name("notifyPaloadEntry")
	.dwattr $C$DW$1310, DW_AT_TI_symbol_name("notifyPaloadEntry")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2aa50]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1310, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x2a)
$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1311, DW_AT_name("taskPostInfo")
	.dwattr $C$DW$1311, DW_AT_TI_symbol_name("taskPostInfo")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ca50]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1311, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x2b)
$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1312, DW_AT_name("cliTsknotifyPaloadEntry")
	.dwattr $C$DW$1312, DW_AT_TI_symbol_name("cliTsknotifyPaloadEntry")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2ca64]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1312, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x2a)
	.dwendtag $C$DW$T$359

	.dwattr $C$DW$T$359, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$359, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$359, DW_AT_decl_column(0x10)
$C$DW$T$1243	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_ModuleObject")
	.dwattr $C$DW$T$1243, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$T$1243, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1243, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$1243, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$1243, DW_AT_decl_column(0x03)
$C$DW$T$1244	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1244, DW_AT_type(*$C$DW$T$1243)
	.dwattr $C$DW$T$1244, DW_AT_address_class(0x20)

$C$DW$T$367	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$367, DW_AT_name("ClientNotifyMgr_NotifyParamInfo_Tag")
	.dwattr $C$DW$T$367, DW_AT_byte_size(0x9c)
$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1313, DW_AT_name("clientHandle")
	.dwattr $C$DW$1313, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1313, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x15)
$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1314, DW_AT_name("waterMarkCond1")
	.dwattr $C$DW$1314, DW_AT_TI_symbol_name("waterMarkCond1")
	.dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1314, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1314, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1314, DW_AT_decl_column(0x15)
$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1315, DW_AT_name("waterMarkCond2")
	.dwattr $C$DW$1315, DW_AT_TI_symbol_name("waterMarkCond2")
	.dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1315, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1315, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1315, DW_AT_decl_column(0x15)
$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1316, DW_AT_name("bitFlag_notifySubEntries")
	.dwattr $C$DW$1316, DW_AT_TI_symbol_name("bitFlag_notifySubEntries")
	.dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1316, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1316, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1316, DW_AT_decl_column(0x15)
$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1317, DW_AT_name("procId")
	.dwattr $C$DW$1317, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1317, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1317, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1317, DW_AT_decl_column(0x15)
$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1318, DW_AT_name("notifyType")
	.dwattr $C$DW$1318, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1318, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1318, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1318, DW_AT_decl_column(0x15)
$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1319, DW_AT_name("isValid")
	.dwattr $C$DW$1319, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1319, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1319, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1319, DW_AT_decl_column(0x15)
$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$1320, DW_AT_name("waitOnMultiNotifyFlags")
	.dwattr $C$DW$1320, DW_AT_TI_symbol_name("waitOnMultiNotifyFlags")
	.dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1320, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1320, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1320, DW_AT_decl_column(0x15)
$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$366)
	.dwattr $C$DW$1321, DW_AT_name("notifyFlag")
	.dwattr $C$DW$1321, DW_AT_TI_symbol_name("notifyFlag")
	.dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1321, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1321, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1321, DW_AT_decl_column(0x15)
$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$366)
	.dwattr $C$DW$1322, DW_AT_name("eventCount")
	.dwattr $C$DW$1322, DW_AT_TI_symbol_name("eventCount")
	.dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1322, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1322, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1322, DW_AT_decl_column(0x15)
$C$DW$1323	.dwtag  DW_TAG_member
	.dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$365)
	.dwattr $C$DW$1323, DW_AT_name("forceNotify")
	.dwattr $C$DW$1323, DW_AT_TI_symbol_name("forceNotify")
	.dwattr $C$DW$1323, DW_AT_data_member_location[DW_OP_plus_uconst 0x9b]
	.dwattr $C$DW$1323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1323, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1323, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$1323, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$367

	.dwattr $C$DW$T$367, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$367, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$367, DW_AT_decl_column(0x10)
$C$DW$T$374	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyParamInfo")
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$374, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$374, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$T$374, DW_AT_decl_column(0x04)
$C$DW$T$375	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
$C$DW$T$376	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$376, DW_AT_address_class(0x20)
$C$DW$T$377	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$T$377, DW_AT_address_class(0x20)

$C$DW$T$1246	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1246, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1246, DW_AT_byte_size(0x01)
$C$DW$1324	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1324, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1324, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1324, DW_AT_decl_column(0x05)
$C$DW$1325	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1325, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1325, DW_AT_decl_column(0x05)
$C$DW$1326	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1326, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1326, DW_AT_decl_column(0x05)
$C$DW$1327	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1327, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1327, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1327, DW_AT_decl_column(0x05)
$C$DW$1328	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1328, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1328, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1328, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1246

	.dwattr $C$DW$T$1246, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1246, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1246, DW_AT_decl_column(0x0e)
$C$DW$T$1247	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1247, DW_AT_type(*$C$DW$T$1246)
	.dwattr $C$DW$T$1247, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1247, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1247, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1247, DW_AT_decl_column(0x03)

$C$DW$T$379	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$379, DW_AT_name("ClientNotifyMgr_Obj_Tag")
	.dwattr $C$DW$T$379, DW_AT_byte_size(0x60)
$C$DW$1329	.dwtag  DW_TAG_member
	.dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$1329, DW_AT_name("listElem")
	.dwattr $C$DW$1329, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1329, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1329, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1329, DW_AT_decl_column(0x30)
$C$DW$1330	.dwtag  DW_TAG_member
	.dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1330, DW_AT_name("type")
	.dwattr $C$DW$1330, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1330, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1330, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1330, DW_AT_decl_column(0x30)
$C$DW$1331	.dwtag  DW_TAG_member
	.dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1331, DW_AT_name("gate")
	.dwattr $C$DW$1331, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1331, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1331, DW_AT_decl_line(0xce)
	.dwattr $C$DW$1331, DW_AT_decl_column(0x30)
$C$DW$1332	.dwtag  DW_TAG_member
	.dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1332, DW_AT_name("regionId")
	.dwattr $C$DW$1332, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1332, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1332, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$1332, DW_AT_decl_column(0x30)
$C$DW$1333	.dwtag  DW_TAG_member
	.dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1333, DW_AT_name("attrs")
	.dwattr $C$DW$1333, DW_AT_TI_symbol_name("attrs")
	.dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1333, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1333, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$1333, DW_AT_decl_column(0x30)
$C$DW$1334	.dwtag  DW_TAG_member
	.dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$1334, DW_AT_name("notifyInfoObj")
	.dwattr $C$DW$1334, DW_AT_TI_symbol_name("notifyInfoObj")
	.dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1334, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1334, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$1334, DW_AT_decl_column(0x30)
$C$DW$1335	.dwtag  DW_TAG_member
	.dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1335, DW_AT_name("cacheEnabled")
	.dwattr $C$DW$1335, DW_AT_TI_symbol_name("cacheEnabled")
	.dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1335, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1335, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1335, DW_AT_decl_column(0x30)
$C$DW$1336	.dwtag  DW_TAG_member
	.dwattr $C$DW$1336, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1336, DW_AT_name("minAlign")
	.dwattr $C$DW$1336, DW_AT_TI_symbol_name("minAlign")
	.dwattr $C$DW$1336, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1336, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1336, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1336, DW_AT_decl_column(0x30)
$C$DW$1337	.dwtag  DW_TAG_member
	.dwattr $C$DW$1337, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1337, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1337, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1337, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1337, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1337, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1337, DW_AT_decl_column(0x30)
$C$DW$1338	.dwtag  DW_TAG_member
	.dwattr $C$DW$1338, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1338, DW_AT_name("top")
	.dwattr $C$DW$1338, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1338, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1338, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1338, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1338, DW_AT_decl_column(0x30)
$C$DW$1339	.dwtag  DW_TAG_member
	.dwattr $C$DW$1339, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$1339, DW_AT_name("params")
	.dwattr $C$DW$1339, DW_AT_TI_symbol_name("params")
	.dwattr $C$DW$1339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1339, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1339, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1339, DW_AT_decl_column(0x30)
$C$DW$1340	.dwtag  DW_TAG_member
	.dwattr $C$DW$1340, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1340, DW_AT_name("Id")
	.dwattr $C$DW$1340, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$1340, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1340, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1340, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1340, DW_AT_decl_column(0x30)
$C$DW$1341	.dwtag  DW_TAG_member
	.dwattr $C$DW$1341, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1341, DW_AT_name("nsKey")
	.dwattr $C$DW$1341, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1341, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1341, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1341, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1341, DW_AT_decl_column(0x30)
	.dwendtag $C$DW$T$379

	.dwattr $C$DW$T$379, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x10)
$C$DW$T$1248	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Obj")
	.dwattr $C$DW$T$1248, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$T$1248, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1248, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$1248, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$T$1248, DW_AT_decl_column(0x03)
$C$DW$T$1249	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1249, DW_AT_type(*$C$DW$T$1248)
	.dwattr $C$DW$T$1249, DW_AT_address_class(0x20)

$C$DW$T$380	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$380, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$380, DW_AT_byte_size(0x04)
$C$DW$1342	.dwtag  DW_TAG_member
	.dwattr $C$DW$1342, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1342, DW_AT_name("obj")
	.dwattr $C$DW$1342, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1342, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$1342, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1342, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$380

	.dwattr $C$DW$T$380, DW_AT_decl_file("../../ClientNotifyMgr.c")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x08)
$C$DW$T$1250	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1250, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$T$1250, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1250, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1250, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1250, DW_AT_decl_column(0x27)
$C$DW$T$1251	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1251, DW_AT_type(*$C$DW$T$1250)
	.dwattr $C$DW$T$1251, DW_AT_address_class(0x20)
$C$DW$T$1252	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$1252, DW_AT_type(*$C$DW$T$1251)
	.dwattr $C$DW$T$1252, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1252, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1252, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$1252, DW_AT_decl_column(0x22)
$C$DW$T$1255	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1255, DW_AT_type(*$C$DW$T$1252)
	.dwattr $C$DW$T$1255, DW_AT_address_class(0x20)

$C$DW$T$385	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$385, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$385, DW_AT_byte_size(0x2c)
$C$DW$1343	.dwtag  DW_TAG_member
	.dwattr $C$DW$1343, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$1343, DW_AT_name("name")
	.dwattr $C$DW$1343, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1343, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1343, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1343, DW_AT_decl_column(0x14)
$C$DW$1344	.dwtag  DW_TAG_member
	.dwattr $C$DW$1344, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1344, DW_AT_name("eventNo")
	.dwattr $C$DW$1344, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1344, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1344, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1344, DW_AT_decl_column(0x14)
$C$DW$1345	.dwtag  DW_TAG_member
	.dwattr $C$DW$1345, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1345, DW_AT_name("openFlag")
	.dwattr $C$DW$1345, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1345, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1345, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1345, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1345, DW_AT_decl_column(0x14)
$C$DW$1346	.dwtag  DW_TAG_member
	.dwattr $C$DW$1346, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1346, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1346, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1346, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1346, DW_AT_decl_column(0x14)
$C$DW$1347	.dwtag  DW_TAG_member
	.dwattr $C$DW$1347, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1347, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1347, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1347, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1347, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1347, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1347, DW_AT_decl_column(0x14)
$C$DW$1348	.dwtag  DW_TAG_member
	.dwattr $C$DW$1348, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1348, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1348, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1348, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1348, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1348, DW_AT_decl_column(0x14)
$C$DW$1349	.dwtag  DW_TAG_member
	.dwattr $C$DW$1349, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1349, DW_AT_name("gate")
	.dwattr $C$DW$1349, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1349, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1349, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1349, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1349, DW_AT_decl_column(0x14)
$C$DW$1350	.dwtag  DW_TAG_member
	.dwattr $C$DW$1350, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1350, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1350, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1350, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1350, DW_AT_decl_column(0x14)
$C$DW$1351	.dwtag  DW_TAG_member
	.dwattr $C$DW$1351, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1351, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1351, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1351, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1351, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1351, DW_AT_decl_column(0x14)
$C$DW$1352	.dwtag  DW_TAG_member
	.dwattr $C$DW$1352, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1352, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1352, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1352, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1352, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1352, DW_AT_decl_column(0x14)
$C$DW$1353	.dwtag  DW_TAG_member
	.dwattr $C$DW$1353, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1353, DW_AT_name("regionId")
	.dwattr $C$DW$1353, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1353, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1353, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1353, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$385

	.dwattr $C$DW$T$385, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$385, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$385, DW_AT_decl_column(0x10)
$C$DW$T$378	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$378, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$T$378, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$378, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x03)
$C$DW$T$1258	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1258, DW_AT_type(*$C$DW$T$378)
$C$DW$T$1259	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1259, DW_AT_type(*$C$DW$T$1258)
	.dwattr $C$DW$T$1259, DW_AT_address_class(0x20)
$C$DW$T$1253	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1253, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$1253, DW_AT_address_class(0x20)

$C$DW$T$386	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$386, DW_AT_name("ClientNotifyMgr_TaskPostInfo_tag")
	.dwattr $C$DW$T$386, DW_AT_byte_size(0x14)
$C$DW$1354	.dwtag  DW_TAG_member
	.dwattr $C$DW$1354, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1354, DW_AT_name("tskHandle")
	.dwattr $C$DW$1354, DW_AT_TI_symbol_name("tskHandle")
	.dwattr $C$DW$1354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1354, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1354, DW_AT_decl_column(0x25)
$C$DW$1355	.dwtag  DW_TAG_member
	.dwattr $C$DW$1355, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1355, DW_AT_name("semHandle")
	.dwattr $C$DW$1355, DW_AT_TI_symbol_name("semHandle")
	.dwattr $C$DW$1355, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1355, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1355, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1355, DW_AT_decl_column(0x25)
$C$DW$1356	.dwtag  DW_TAG_member
	.dwattr $C$DW$1356, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1356, DW_AT_name("notifyCnt")
	.dwattr $C$DW$1356, DW_AT_TI_symbol_name("notifyCnt")
	.dwattr $C$DW$1356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1356, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1356, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$1356, DW_AT_decl_column(0x25)
$C$DW$1357	.dwtag  DW_TAG_member
	.dwattr $C$DW$1357, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1357, DW_AT_name("readIndex")
	.dwattr $C$DW$1357, DW_AT_TI_symbol_name("readIndex")
	.dwattr $C$DW$1357, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1357, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1357, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1357, DW_AT_decl_column(0x25)
$C$DW$1358	.dwtag  DW_TAG_member
	.dwattr $C$DW$1358, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1358, DW_AT_name("writeIndex")
	.dwattr $C$DW$1358, DW_AT_TI_symbol_name("writeIndex")
	.dwattr $C$DW$1358, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1358, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1358, DW_AT_decl_line(0x121)
	.dwattr $C$DW$1358, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$386

	.dwattr $C$DW$T$386, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$386, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$T$386, DW_AT_decl_column(0x10)
$C$DW$T$358	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_TaskPostInfo")
	.dwattr $C$DW$T$358, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$T$358, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$358, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$358, DW_AT_decl_line(0x122)
	.dwattr $C$DW$T$358, DW_AT_decl_column(0x02)

$C$DW$T$388	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$388, DW_AT_name("ClientNotifyMgr_callbackCtx_tag")
	.dwattr $C$DW$T$388, DW_AT_byte_size(0x18)
$C$DW$1359	.dwtag  DW_TAG_member
	.dwattr $C$DW$1359, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1359, DW_AT_name("gate")
	.dwattr $C$DW$1359, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1359, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1359, DW_AT_decl_line(0x104)
	.dwattr $C$DW$1359, DW_AT_decl_column(0x26)
$C$DW$1360	.dwtag  DW_TAG_member
	.dwattr $C$DW$1360, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1360, DW_AT_name("attrs")
	.dwattr $C$DW$1360, DW_AT_TI_symbol_name("attrs")
	.dwattr $C$DW$1360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1360, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1360, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1360, DW_AT_decl_column(0x26)
$C$DW$1361	.dwtag  DW_TAG_member
	.dwattr $C$DW$1361, DW_AT_type(*$C$DW$T$387)
	.dwattr $C$DW$1361, DW_AT_name("notifyInfoObjBaseAddr")
	.dwattr $C$DW$1361, DW_AT_TI_symbol_name("notifyInfoObjBaseAddr")
	.dwattr $C$DW$1361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1361, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1361, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1361, DW_AT_decl_column(0x23)
$C$DW$1362	.dwtag  DW_TAG_member
	.dwattr $C$DW$1362, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1362, DW_AT_name("minAlign")
	.dwattr $C$DW$1362, DW_AT_TI_symbol_name("minAlign")
	.dwattr $C$DW$1362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1362, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1362, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1362, DW_AT_decl_column(0x23)
$C$DW$1363	.dwtag  DW_TAG_member
	.dwattr $C$DW$1363, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1363, DW_AT_name("cacheEnabled")
	.dwattr $C$DW$1363, DW_AT_TI_symbol_name("cacheEnabled")
	.dwattr $C$DW$1363, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1363, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1363, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1363, DW_AT_decl_column(0x24)
$C$DW$1364	.dwtag  DW_TAG_member
	.dwattr $C$DW$1364, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1364, DW_AT_name("instId")
	.dwattr $C$DW$1364, DW_AT_TI_symbol_name("instId")
	.dwattr $C$DW$1364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1364, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1364, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1364, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$388

	.dwattr $C$DW$T$388, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$388, DW_AT_decl_line(0x103)
	.dwattr $C$DW$T$388, DW_AT_decl_column(0x10)
$C$DW$T$1260	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_callbackCtx")
	.dwattr $C$DW$T$1260, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$T$1260, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1260, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$1260, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$1260, DW_AT_decl_column(0x02)
$C$DW$T$1261	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1261, DW_AT_type(*$C$DW$T$1260)
	.dwattr $C$DW$T$1261, DW_AT_address_class(0x20)

$C$DW$T$392	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$392, DW_AT_name("ClientNotifyMgr_eventListenerInfo_tag")
	.dwattr $C$DW$T$392, DW_AT_byte_size(0x14)
$C$DW$1365	.dwtag  DW_TAG_member
	.dwattr $C$DW$1365, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$1365, DW_AT_name("listElem")
	.dwattr $C$DW$1365, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1365, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1365, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1365, DW_AT_decl_column(0x1d)
$C$DW$1366	.dwtag  DW_TAG_member
	.dwattr $C$DW$1366, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1366, DW_AT_name("cbckFxn")
	.dwattr $C$DW$1366, DW_AT_TI_symbol_name("cbckFxn")
	.dwattr $C$DW$1366, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1366, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1366, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1366, DW_AT_decl_column(0x1d)
$C$DW$1367	.dwtag  DW_TAG_member
	.dwattr $C$DW$1367, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1367, DW_AT_name("notifyId")
	.dwattr $C$DW$1367, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1367, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1367, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$1367, DW_AT_decl_column(0x1d)
$C$DW$1368	.dwtag  DW_TAG_member
	.dwattr $C$DW$1368, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1368, DW_AT_name("cbContext")
	.dwattr $C$DW$1368, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1368, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1368, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1368, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1368, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$392

	.dwattr $C$DW$T$392, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x10)
$C$DW$T$1262	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_eventListenerInfo")
	.dwattr $C$DW$T$1262, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$1262, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$1262, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$1262, DW_AT_decl_column(0x02)
$C$DW$T$1263	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1263, DW_AT_type(*$C$DW$T$1262)
	.dwattr $C$DW$T$1263, DW_AT_address_class(0x20)

$C$DW$T$393	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$393, DW_AT_name("ClientNotifyMgr_notifyPayloadInfo_tag")
	.dwattr $C$DW$T$393, DW_AT_byte_size(0x08)
$C$DW$1369	.dwtag  DW_TAG_member
	.dwattr $C$DW$1369, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1369, DW_AT_name("cliCallbackCtx")
	.dwattr $C$DW$1369, DW_AT_TI_symbol_name("cliCallbackCtx")
	.dwattr $C$DW$1369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1369, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1369, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1369, DW_AT_decl_column(0x25)
$C$DW$1370	.dwtag  DW_TAG_member
	.dwattr $C$DW$1370, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1370, DW_AT_name("notifyPayload")
	.dwattr $C$DW$1370, DW_AT_TI_symbol_name("notifyPayload")
	.dwattr $C$DW$1370, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1370, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1370, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1370, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$393

	.dwattr $C$DW$T$393, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$393, DW_AT_decl_line(0x124)
	.dwattr $C$DW$T$393, DW_AT_decl_column(0x10)
$C$DW$T$356	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_notifyPayloadInfo")
	.dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$393)
	.dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$356, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$356, DW_AT_decl_line(0x127)
	.dwattr $C$DW$T$356, DW_AT_decl_column(0x02)

$C$DW$T$357	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$357, DW_AT_byte_size(0x2000)
$C$DW$1371	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1371, DW_AT_upper_bound(0x3ff)
	.dwendtag $C$DW$T$357


$C$DW$T$394	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$394, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$394, DW_AT_byte_size(0x1c)
$C$DW$1372	.dwtag  DW_TAG_member
	.dwattr $C$DW$1372, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1372, DW_AT_name("clientHandle")
	.dwattr $C$DW$1372, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1372, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1372, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1372, DW_AT_decl_column(0x12)
$C$DW$1373	.dwtag  DW_TAG_member
	.dwattr $C$DW$1373, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1373, DW_AT_name("procId")
	.dwattr $C$DW$1373, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1373, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1373, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1373, DW_AT_decl_column(0x12)
$C$DW$1374	.dwtag  DW_TAG_member
	.dwattr $C$DW$1374, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1374, DW_AT_name("notifyType")
	.dwattr $C$DW$1374, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1374, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1374, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1374, DW_AT_decl_column(0x12)
$C$DW$1375	.dwtag  DW_TAG_member
	.dwattr $C$DW$1375, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1375, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1375, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1375, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1375, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1375, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1375, DW_AT_decl_column(0x1d)
$C$DW$1376	.dwtag  DW_TAG_member
	.dwattr $C$DW$1376, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1376, DW_AT_name("cbContext")
	.dwattr $C$DW$1376, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1376, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1376, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1376, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1376, DW_AT_decl_column(0x12)
$C$DW$1377	.dwtag  DW_TAG_member
	.dwattr $C$DW$1377, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1377, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1377, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1377, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1377, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1377, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1377, DW_AT_decl_column(0x12)
$C$DW$1378	.dwtag  DW_TAG_member
	.dwattr $C$DW$1378, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1378, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1378, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1378, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1378, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1378, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1378, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$394

	.dwattr $C$DW$T$394, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$394, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$394, DW_AT_decl_column(0x10)
$C$DW$T$1265	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1265, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$T$1265, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1265, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1265, DW_AT_decl_column(0x03)
$C$DW$T$1266	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1266, DW_AT_type(*$C$DW$T$1265)
	.dwattr $C$DW$T$1266, DW_AT_address_class(0x20)

$C$DW$T$395	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$395, DW_AT_name("ClientNotifyMgr_swiPostInfo_tag")
	.dwattr $C$DW$T$395, DW_AT_byte_size(0x10)
$C$DW$1379	.dwtag  DW_TAG_member
	.dwattr $C$DW$1379, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1379, DW_AT_name("swiHandle")
	.dwattr $C$DW$1379, DW_AT_TI_symbol_name("swiHandle")
	.dwattr $C$DW$1379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1379, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1379, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1379, DW_AT_decl_column(0x25)
$C$DW$1380	.dwtag  DW_TAG_member
	.dwattr $C$DW$1380, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1380, DW_AT_name("notifyCnt")
	.dwattr $C$DW$1380, DW_AT_TI_symbol_name("notifyCnt")
	.dwattr $C$DW$1380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1380, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1380, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1380, DW_AT_decl_column(0x25)
$C$DW$1381	.dwtag  DW_TAG_member
	.dwattr $C$DW$1381, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1381, DW_AT_name("readIndex")
	.dwattr $C$DW$1381, DW_AT_TI_symbol_name("readIndex")
	.dwattr $C$DW$1381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1381, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1381, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1381, DW_AT_decl_column(0x25)
$C$DW$1382	.dwtag  DW_TAG_member
	.dwattr $C$DW$1382, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1382, DW_AT_name("writeIndex")
	.dwattr $C$DW$1382, DW_AT_TI_symbol_name("writeIndex")
	.dwattr $C$DW$1382, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1382, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$1382, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1382, DW_AT_decl_column(0x25)
	.dwendtag $C$DW$T$395

	.dwattr $C$DW$T$395, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$395, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$395, DW_AT_decl_column(0x10)
$C$DW$T$355	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_swiPostInfo")
	.dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$395)
	.dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$355, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_ClientNotifyMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x119)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x02)

$C$DW$T$396	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$396, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$396, DW_AT_byte_size(0x01)
$C$DW$1383	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1383, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1383, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1383, DW_AT_decl_column(0x05)
$C$DW$1384	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1384, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1384, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1384, DW_AT_decl_column(0x05)
$C$DW$1385	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1385, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1385, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1385, DW_AT_decl_column(0x05)
$C$DW$1386	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1386, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1386, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1386, DW_AT_decl_column(0x05)
$C$DW$1387	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1387, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1387, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1387, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$396

	.dwattr $C$DW$T$396, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$396, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$396, DW_AT_decl_column(0x0e)
$C$DW$T$397	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$397, DW_AT_type(*$C$DW$T$396)
	.dwattr $C$DW$T$397, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$397, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$397, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$397, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$369	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$369, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$369, DW_AT_address_class(0x20)
$C$DW$T$370	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$370, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$T$370, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$370, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$370, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$370, DW_AT_decl_column(0x1f)

$C$DW$T$400	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$400, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$400, DW_AT_byte_size(0x10)
$C$DW$1388	.dwtag  DW_TAG_member
	.dwattr $C$DW$1388, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$1388, DW_AT_name("name")
	.dwattr $C$DW$1388, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1388, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1388, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1388, DW_AT_decl_column(0x0c)
$C$DW$1389	.dwtag  DW_TAG_member
	.dwattr $C$DW$1389, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1389, DW_AT_name("regionId")
	.dwattr $C$DW$1389, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1389, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1389, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1389, DW_AT_decl_column(0x0c)
$C$DW$1390	.dwtag  DW_TAG_member
	.dwattr $C$DW$1390, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1390, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1390, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1390, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1390, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1390, DW_AT_decl_column(0x09)
$C$DW$1391	.dwtag  DW_TAG_member
	.dwattr $C$DW$1391, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$1391, DW_AT_name("localProtect")
	.dwattr $C$DW$1391, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1391, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1391, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1391, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1391, DW_AT_decl_column(0x19)
$C$DW$1392	.dwtag  DW_TAG_member
	.dwattr $C$DW$1392, DW_AT_type(*$C$DW$T$399)
	.dwattr $C$DW$1392, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1392, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1392, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1392, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1392, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1392, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$400

	.dwattr $C$DW$T$400, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$400, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$400, DW_AT_decl_column(0x10)
$C$DW$T$1270	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$1270, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$T$1270, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1270, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$1270, DW_AT_decl_line(0x123)
	.dwattr $C$DW$T$1270, DW_AT_decl_column(0x03)

$C$DW$T$398	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$398, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$398, DW_AT_byte_size(0x01)
$C$DW$1393	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1393, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1393, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1393, DW_AT_decl_column(0x05)
$C$DW$1394	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1394, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1394, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1394, DW_AT_decl_column(0x05)
$C$DW$1395	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1395, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1395, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1395, DW_AT_decl_column(0x05)
$C$DW$1396	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1396, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1396, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1396, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$398

	.dwattr $C$DW$T$398, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$398, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$398, DW_AT_decl_column(0x0e)
$C$DW$T$399	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$398)
	.dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$399, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$399, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$399, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$336	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$336, DW_AT_address_class(0x20)
$C$DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x23)
$C$DW$T$1276	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1276, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$1276, DW_AT_address_class(0x20)

$C$DW$T$403	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$403, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$403, DW_AT_byte_size(0x14)
$C$DW$1397	.dwtag  DW_TAG_member
	.dwattr $C$DW$1397, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1397, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1397, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1397, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1397, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1397, DW_AT_decl_column(0x0a)
$C$DW$1398	.dwtag  DW_TAG_member
	.dwattr $C$DW$1398, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1398, DW_AT_name("tableHeap")
	.dwattr $C$DW$1398, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1398, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1398, DW_AT_decl_line(0xda)
