;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:24 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("FrameQBufMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$1093, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1093, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$1093, DW_AT_decl_column(0x0e)
$C$DW$T$1094	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$1093)
	.dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1094, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1094, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)

$C$DW$T$1095	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1095, DW_AT_byte_size(0x01)
$C$DW$1174	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1174, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x05)
$C$DW$1175	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1175, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x05)
$C$DW$1176	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1176, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1095

	.dwattr $C$DW$T$1095, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1095, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$1095, DW_AT_decl_column(0x0e)
$C$DW$T$1096	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$1095)
	.dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1096, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1096, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)

$C$DW$T$1097	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1097, DW_AT_byte_size(0x02)
$C$DW$1177	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1177, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x05)
$C$DW$1178	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1178, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x05)
$C$DW$1179	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1179, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1097

	.dwattr $C$DW$T$1097, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1097, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1097, DW_AT_decl_column(0x0e)
$C$DW$T$1098	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1098, DW_AT_type(*$C$DW$T$1097)
	.dwattr $C$DW$T$1098, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1098, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1098, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1098, DW_AT_decl_column(0x03)

$C$DW$T$1099	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1099, DW_AT_byte_size(0x01)
$C$DW$1180	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1180, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x05)
$C$DW$1181	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1181, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x05)
$C$DW$1182	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1182, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1099

	.dwattr $C$DW$T$1099, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1099, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1099, DW_AT_decl_column(0x0e)
$C$DW$T$1100	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1100, DW_AT_type(*$C$DW$T$1099)
	.dwattr $C$DW$T$1100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1100, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1100, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1100, DW_AT_decl_column(0x03)

$C$DW$T$298	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$298, DW_AT_byte_size(0x04)
$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$1183, DW_AT_name("fxns")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$298

	.dwattr $C$DW$T$298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x10)
$C$DW$T$1101	.dwtag  DW_TAG_typedef, DW_AT_name("IFrameQBufMgr_Object")
	.dwattr $C$DW$T$1101, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$1101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1101, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$1101, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1101, DW_AT_decl_column(0x02)
$C$DW$T$1102	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1102, DW_AT_type(*$C$DW$T$1101)
	.dwattr $C$DW$T$1102, DW_AT_address_class(0x20)
$C$DW$T$1103	.dwtag  DW_TAG_typedef, DW_AT_name("IFrameQBufMgr_Handle")
	.dwattr $C$DW$T$1103, DW_AT_type(*$C$DW$T$1102)
	.dwattr $C$DW$T$1103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1103, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$1103, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$1103, DW_AT_decl_column(0x20)
$C$DW$T$1104	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1104, DW_AT_type(*$C$DW$T$1103)
	.dwattr $C$DW$T$1104, DW_AT_address_class(0x20)

$C$DW$T$303	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x08)
$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1184, DW_AT_name("length")
	.dwattr $C$DW$1184, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x16)
$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1185, DW_AT_name("elem")
	.dwattr $C$DW$1185, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x10)
$C$DW$T$1105	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1105, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$T$1105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1105, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1105, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1105, DW_AT_decl_column(0x43)
$C$DW$T$1106	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1106, DW_AT_type(*$C$DW$T$1105)
	.dwattr $C$DW$T$1106, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1106, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1106, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1106, DW_AT_decl_column(0x30)
$C$DW$T$1107	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1107, DW_AT_type(*$C$DW$T$1106)
	.dwattr $C$DW$T$1107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1107, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1107, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1107, DW_AT_decl_column(0x2c)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1186, DW_AT_name("length")
	.dwattr $C$DW$1186, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x16)
$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$1187, DW_AT_name("elem")
	.dwattr $C$DW$1187, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$1108	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1108, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$1108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1108, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1108, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1108, DW_AT_decl_column(0x43)
$C$DW$T$1109	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1109, DW_AT_type(*$C$DW$T$1108)
	.dwattr $C$DW$T$1109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1109, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1109, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1109, DW_AT_decl_column(0x2f)
$C$DW$T$1110	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1110, DW_AT_type(*$C$DW$T$1109)
	.dwattr $C$DW$T$1110, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1110, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1110, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1110, DW_AT_decl_column(0x2b)

$C$DW$T$307	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$307, DW_AT_byte_size(0x08)
$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1188, DW_AT_name("length")
	.dwattr $C$DW$1188, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x16)
$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$1189, DW_AT_name("elem")
	.dwattr $C$DW$1189, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$307

	.dwattr $C$DW$T$307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$307, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$307, DW_AT_decl_column(0x10)
$C$DW$T$1111	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1111, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$T$1111, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1111, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1111, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1111, DW_AT_decl_column(0x42)
$C$DW$T$1112	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1112, DW_AT_type(*$C$DW$T$1111)
	.dwattr $C$DW$T$1112, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1112, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1112, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1112, DW_AT_decl_column(0x2b)
$C$DW$T$1113	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1113, DW_AT_type(*$C$DW$T$1112)
	.dwattr $C$DW$T$1113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1113, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1113, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1113, DW_AT_decl_column(0x27)

$C$DW$T$310	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$310, DW_AT_byte_size(0x08)
$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1190, DW_AT_name("length")
	.dwattr $C$DW$1190, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x16)
$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$1191, DW_AT_name("elem")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$310

	.dwattr $C$DW$T$310, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$310, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$310, DW_AT_decl_column(0x10)
$C$DW$T$1114	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1114, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$1114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1114, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1114, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1114, DW_AT_decl_column(0x43)
$C$DW$T$1115	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1115, DW_AT_type(*$C$DW$T$1114)
	.dwattr $C$DW$T$1115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1115, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1115, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1115, DW_AT_decl_column(0x2c)
$C$DW$T$1116	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1116, DW_AT_type(*$C$DW$T$1115)
	.dwattr $C$DW$T$1116, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1116, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1116, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1116, DW_AT_decl_column(0x28)

$C$DW$T$312	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$312, DW_AT_byte_size(0x14)
$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$1192, DW_AT_name("shMemParams")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$312

	.dwattr $C$DW$T$312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$312, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$312, DW_AT_decl_column(0x08)

$C$DW$T$316	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$316, DW_AT_byte_size(0x04)
$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1193, DW_AT_name("f")
	.dwattr $C$DW$1193, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x0f)
$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1194, DW_AT_name("a")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$316

	.dwattr $C$DW$T$316, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$316, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$316, DW_AT_decl_column(0x0f)
$C$DW$T$1117	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1117, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$1117, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1117, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1117, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1117, DW_AT_decl_column(0x03)

$C$DW$T$1118	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1118, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1118, DW_AT_byte_size(0x01)
$C$DW$1195	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1195, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1118

	.dwattr $C$DW$T$1118, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1118, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1118, DW_AT_decl_column(0x0e)
$C$DW$T$1119	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1119, DW_AT_type(*$C$DW$T$1118)
	.dwattr $C$DW$T$1119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1119, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1119, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1119, DW_AT_decl_column(0x03)

$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x10)
$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1196, DW_AT_name("gate")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x1b)
$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1197, DW_AT_name("numProcessors")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x0f)
$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1198, DW_AT_name("procIds")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x0f)
$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1199, DW_AT_name("drvHandles")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$325

	.dwattr $C$DW$T$325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
$C$DW$T$1120	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1120, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1120, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1120, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1120, DW_AT_decl_column(0x03)

$C$DW$T$1121	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1121, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1121, DW_AT_byte_size(0x01)
$C$DW$1200	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1200, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x05)
$C$DW$1201	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1201, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x05)
$C$DW$1202	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1202, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x05)
$C$DW$1203	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1203, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x05)
$C$DW$1204	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1204, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1121

	.dwattr $C$DW$T$1121, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1121, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1121, DW_AT_decl_column(0x0e)
$C$DW$T$1122	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1122, DW_AT_type(*$C$DW$T$1121)
	.dwattr $C$DW$T$1122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1122, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1122, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1122, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1123	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1123, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1123, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1123, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1123, DW_AT_decl_column(0x27)
$C$DW$T$1124	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1124, DW_AT_type(*$C$DW$T$1123)
	.dwattr $C$DW$T$1124, DW_AT_address_class(0x20)
$C$DW$T$1125	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$1125, DW_AT_type(*$C$DW$T$1124)
	.dwattr $C$DW$T$1125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1125, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1125, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$1125, DW_AT_decl_column(0x22)

$C$DW$T$338	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$338, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x2c)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1205, DW_AT_name("name")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x14)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1206, DW_AT_name("eventNo")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x14)
$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1207, DW_AT_name("openFlag")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x14)
$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1208, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x14)
$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1209, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x14)
$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1210, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x14)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$1211, DW_AT_name("gate")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x14)
$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1212, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x14)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1213, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x14)
$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1214, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x14)
$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1215, DW_AT_name("regionId")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x10)
$C$DW$T$1126	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1126, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$1126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1126, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1126, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1126, DW_AT_decl_column(0x03)

$C$DW$T$342	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$342, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$342, DW_AT_byte_size(0x1c)
$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1216, DW_AT_name("clientHandle")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x12)
$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$1217, DW_AT_name("procId")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x12)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1218, DW_AT_name("notifyType")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x12)
$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1219, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x1d)
$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1220, DW_AT_name("cbContext")
	.dwattr $C$DW$1220, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x12)
$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1221, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1221, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x12)
$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1222, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1222, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$342

	.dwattr $C$DW$T$342, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x10)
$C$DW$T$1127	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1127, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$1127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1127, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1127, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1127, DW_AT_decl_column(0x03)

$C$DW$T$481	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$481, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$481, DW_AT_byte_size(0x01)
$C$DW$1223	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1223, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x05)
$C$DW$1224	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1224, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x05)
$C$DW$1225	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1225, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$481

	.dwattr $C$DW$T$481, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$481, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$481, DW_AT_decl_column(0x0e)
$C$DW$T$482	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$482, DW_AT_type(*$C$DW$T$481)
	.dwattr $C$DW$T$482, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$482, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$482, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$482, DW_AT_decl_column(0x02)

$C$DW$T$348	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$348, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$348, DW_AT_byte_size(0x48)
$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1226, DW_AT_name("status")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x1a)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1227, DW_AT_name("version")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x1a)
$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1228, DW_AT_name("localProtect")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x1a)
$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1229, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x1a)
$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1230, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x1a)
$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1231, DW_AT_name("name")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x1a)
$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1232, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x17)
$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1233, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x18)
$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1234, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x17)
$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1235, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1235, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x1a)
$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$1236, DW_AT_name("entryId")
	.dwattr $C$DW$1236, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$348

	.dwattr $C$DW$T$348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x10)
$C$DW$T$1128	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$1128, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$T$1128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1128, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1128, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$1128, DW_AT_decl_column(0x03)
$C$DW$T$1129	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$1129, DW_AT_type(*$C$DW$T$1128)
	.dwattr $C$DW$T$1129, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1129, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1129, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$1129, DW_AT_decl_column(0x27)

$C$DW$T$483	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$483, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$483, DW_AT_byte_size(0x01)
$C$DW$1237	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1237, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x05)
$C$DW$1238	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x05)
$C$DW$1239	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1239, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$483

	.dwattr $C$DW$T$483, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$483, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$483, DW_AT_decl_column(0x0e)
$C$DW$T$484	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$484, DW_AT_type(*$C$DW$T$483)
	.dwattr $C$DW$T$484, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$484, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$484, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$484, DW_AT_decl_column(0x02)

$C$DW$T$349	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$349, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$349, DW_AT_byte_size(0x0c)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1240, DW_AT_name("name")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x11)
$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1241, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x11)
$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1242, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1242, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$349

	.dwattr $C$DW$T$349, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$349, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$349, DW_AT_decl_column(0x10)
$C$DW$T$397	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$397, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$397, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$397, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$397, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$397, DW_AT_decl_column(0x03)

$C$DW$T$350	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$350, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$350, DW_AT_byte_size(0x0c)
$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1243, DW_AT_name("eventNo")
	.dwattr $C$DW$1243, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x0c)
$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1244, DW_AT_name("maxInstances")
	.dwattr $C$DW$1244, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x0c)
$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1245, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1245, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$350

	.dwattr $C$DW$T$350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x10)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x03)
$C$DW$T$1130	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1130, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$1130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1130, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1130, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1130, DW_AT_decl_column(0x27)
$C$DW$T$1131	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1131, DW_AT_type(*$C$DW$T$1130)
	.dwattr $C$DW$T$1131, DW_AT_address_class(0x20)
$C$DW$T$1132	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$1132, DW_AT_address_class(0x20)

$C$DW$T$1133	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1133, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1133, DW_AT_byte_size(0x04)
$C$DW$1246	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1246, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x09)
$C$DW$1247	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1247, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0x135)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x09)
$C$DW$1248	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1248, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x139)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x09)
$C$DW$1249	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1249, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x09)
$C$DW$1250	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1250, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x09)
$C$DW$1251	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1251, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x09)
$C$DW$1252	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1252, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x09)
$C$DW$1253	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1253, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1133

	.dwattr $C$DW$T$1133, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1133, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1133, DW_AT_decl_column(0x0e)
$C$DW$T$1134	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1134, DW_AT_type(*$C$DW$T$1133)
	.dwattr $C$DW$T$1134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1134, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1134, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$1134, DW_AT_decl_column(0x03)

$C$DW$T$353	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$353, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$353, DW_AT_byte_size(0x10)
$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1254, DW_AT_name("size")
	.dwattr $C$DW$1254, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x0c)
$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1255, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1255, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x1c)
$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1256, DW_AT_name("name")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x0c)
$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1257, DW_AT_name("openFlag")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$353

	.dwattr $C$DW$T$353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x10)
$C$DW$T$399	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$399, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$399, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$399, DW_AT_decl_column(0x03)

$C$DW$T$354	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x14)
$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1258, DW_AT_name("size")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x0c)
$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1259, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x0c)
$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1260, DW_AT_name("height")
	.dwattr $C$DW$1260, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x0c)
$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1261, DW_AT_name("width")
	.dwattr $C$DW$1261, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x0c)
$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1262, DW_AT_name("align")
	.dwattr $C$DW$1262, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x10)
$C$DW$T$408	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$408, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$408, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$408, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$408, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$408, DW_AT_decl_column(0x02)
$C$DW$T$409	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$T$409, DW_AT_address_class(0x20)

$C$DW$T$410	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$410, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$410, DW_AT_byte_size(0x100)
$C$DW$1263	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1263, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$410


$C$DW$T$1135	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1135, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1135, DW_AT_byte_size(0x01)
$C$DW$1264	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x05)
$C$DW$1265	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x05)
$C$DW$1266	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1266, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1135

	.dwattr $C$DW$T$1135, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1135, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$1135, DW_AT_decl_column(0x0e)
$C$DW$T$1136	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$1135)
	.dwattr $C$DW$T$1136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1136, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1136, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$1136, DW_AT_decl_column(0x03)

$C$DW$T$1137	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1137, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1137, DW_AT_byte_size(0x01)
$C$DW$1267	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1267, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x05)
$C$DW$1268	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1268, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x185)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1137

	.dwattr $C$DW$T$1137, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1137, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$1137, DW_AT_decl_column(0x0e)
$C$DW$T$1138	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$1137)
	.dwattr $C$DW$T$1138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1138, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1138, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$1138, DW_AT_decl_column(0x03)

$C$DW$T$369	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$369, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$369, DW_AT_byte_size(0x2b4)
$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1269, DW_AT_name("numFrms")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x15)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1270, DW_AT_name("freeFrms")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x15)
$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1271, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x15)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1272, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x15)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1273, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x15)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1274, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x15)
$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1275, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x15)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1276, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x15)
$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1277, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x15)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1278, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x15)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1279, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x15)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1280, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x15)
$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1281, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x15)
$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1282, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1282, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1282, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x15)
$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1283, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1283, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x15)
$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1284, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1284, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x15)
$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$1285, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1285, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x15)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$1286, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1286, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x15)
$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1287, DW_AT_name("dynFrame")
	.dwattr $C$DW$1287, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x15)
$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1288, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1288, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x15)
$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1289, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1289, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x15)
$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1290, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1290, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x15)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1291, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1291, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x15)
$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1292, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1292, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x15)
$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$1293, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1293, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x15)
$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$1294, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1294, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x15)
$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$1295, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1295, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$369

	.dwattr $C$DW$T$369, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$369, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$369, DW_AT_decl_column(0x10)
$C$DW$T$1139	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$1139, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$T$1139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1139, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1139, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$1139, DW_AT_decl_column(0x03)
$C$DW$T$1140	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$1140, DW_AT_type(*$C$DW$T$1139)
	.dwattr $C$DW$T$1140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1140, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1140, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$1140, DW_AT_decl_column(0x27)

$C$DW$T$351	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$351, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$351, DW_AT_byte_size(0x01)
$C$DW$1296	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1296, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x05)
$C$DW$1297	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1297, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$351

	.dwattr $C$DW$T$351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x0e)
$C$DW$T$352	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$T$352, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x03)

$C$DW$T$378	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$378, DW_AT_name("FrameQBufMgr_ModuleObject_Tag")
	.dwattr $C$DW$T$378, DW_AT_byte_size(0x24c)
$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1298, DW_AT_name("refCount")
	.dwattr $C$DW$1298, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1298, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1298, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x19)
$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$1299, DW_AT_name("nameServer")
	.dwattr $C$DW$1299, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x21)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1300, DW_AT_name("nameServerType")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("nameServerType")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x21)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1301, DW_AT_name("gate")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x21)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1302, DW_AT_name("gateType")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("gateType")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1302, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x21)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1303, DW_AT_name("objList")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1303, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x21)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1304, DW_AT_name("listLock")
	.dwattr $C$DW$1304, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1304, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x21)
$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$1305, DW_AT_name("cfg")
	.dwattr $C$DW$1305, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1305, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x21)
$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$1306, DW_AT_name("defaultCfg")
	.dwattr $C$DW$1306, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$1306, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1306, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1306, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x21)
$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$1307, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$1307, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$1307, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1307, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1307, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x1d)
$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$1308, DW_AT_name("isInstNoValid")
	.dwattr $C$DW$1308, DW_AT_TI_symbol_name("isInstNoValid")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$1308, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$378

	.dwattr $C$DW$T$378, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x10)
$C$DW$T$1141	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ModuleObject")
	.dwattr $C$DW$T$1141, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$1141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1141, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$1141, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1141, DW_AT_decl_column(0x03)
$C$DW$T$1142	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1142, DW_AT_type(*$C$DW$T$1141)
	.dwattr $C$DW$T$1142, DW_AT_address_class(0x20)

$C$DW$T$379	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$379, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$379, DW_AT_byte_size(0x20)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1309, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1309, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x0f)
$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1310, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1310, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x0f)
$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1311, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1311, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x0f)
$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1312, DW_AT_name("instParams")
	.dwattr $C$DW$1312, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$379

	.dwattr $C$DW$T$379, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x10)
$C$DW$T$1143	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1143, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$T$1143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1143, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1143, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1143, DW_AT_decl_column(0x02)
$C$DW$T$1144	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1144, DW_AT_type(*$C$DW$T$1143)
	.dwattr $C$DW$T$1144, DW_AT_address_class(0x20)

$C$DW$T$387	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$387, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$387, DW_AT_byte_size(0x14)
$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$1313, DW_AT_name("notifyType")
	.dwattr $C$DW$1313, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1313, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x1d)
$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1314, DW_AT_name("watermark")
	.dwattr $C$DW$1314, DW_AT_TI_symbol_name("watermark")
