;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:28 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("FrameQ.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$847, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$847, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$847, DW_AT_decl_column(0x0e)
$C$DW$T$848	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$848, DW_AT_type(*$C$DW$T$847)
	.dwattr $C$DW$T$848, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$848, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$848, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$848, DW_AT_decl_column(0x03)

$C$DW$T$849	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$849, DW_AT_byte_size(0x01)
$C$DW$897	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$897, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0x89)
	.dwattr $C$DW$897, DW_AT_decl_column(0x05)
$C$DW$898	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$898, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$898, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$898, DW_AT_decl_column(0x05)
$C$DW$899	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$899, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$899, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$899, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$849

	.dwattr $C$DW$T$849, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$849, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$849, DW_AT_decl_column(0x0e)
$C$DW$T$850	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$850, DW_AT_type(*$C$DW$T$849)
	.dwattr $C$DW$T$850, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$850, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$850, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$850, DW_AT_decl_column(0x03)

$C$DW$T$851	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$851, DW_AT_byte_size(0x02)
$C$DW$900	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$900, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x95)
	.dwattr $C$DW$900, DW_AT_decl_column(0x05)
$C$DW$901	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$901, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x97)
	.dwattr $C$DW$901, DW_AT_decl_column(0x05)
$C$DW$902	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$902, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0x99)
	.dwattr $C$DW$902, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$851

	.dwattr $C$DW$T$851, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$851, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$851, DW_AT_decl_column(0x0e)
$C$DW$T$852	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$852, DW_AT_type(*$C$DW$T$851)
	.dwattr $C$DW$T$852, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$852, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$852, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$852, DW_AT_decl_column(0x03)

$C$DW$T$853	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$853, DW_AT_byte_size(0x01)
$C$DW$903	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$903, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$903, DW_AT_decl_column(0x05)
$C$DW$904	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$904, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$904, DW_AT_decl_column(0x05)
$C$DW$905	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$905, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$905, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$853

	.dwattr $C$DW$T$853, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$853, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$853, DW_AT_decl_column(0x0e)
$C$DW$T$854	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$854, DW_AT_type(*$C$DW$T$853)
	.dwattr $C$DW$T$854, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$854, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$854, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$854, DW_AT_decl_column(0x03)

$C$DW$T$234	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$234, DW_AT_byte_size(0x08)
$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$906, DW_AT_name("length")
	.dwattr $C$DW$906, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0xad)
	.dwattr $C$DW$906, DW_AT_decl_column(0x16)
$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$907, DW_AT_name("elem")
	.dwattr $C$DW$907, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0xad)
	.dwattr $C$DW$907, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$234

	.dwattr $C$DW$T$234, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$234, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$234, DW_AT_decl_column(0x10)
$C$DW$T$855	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$855, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$T$855, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$855, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$855, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$855, DW_AT_decl_column(0x43)
$C$DW$T$856	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$856, DW_AT_type(*$C$DW$T$855)
	.dwattr $C$DW$T$856, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$856, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$856, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$856, DW_AT_decl_column(0x30)
$C$DW$T$857	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$857, DW_AT_type(*$C$DW$T$856)
	.dwattr $C$DW$T$857, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$857, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$857, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$857, DW_AT_decl_column(0x2c)

$C$DW$T$235	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$235, DW_AT_byte_size(0x08)
$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$908, DW_AT_name("length")
	.dwattr $C$DW$908, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$908, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$908, DW_AT_decl_column(0x16)
$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$909, DW_AT_name("elem")
	.dwattr $C$DW$909, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$909, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$909, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$235

	.dwattr $C$DW$T$235, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$235, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$235, DW_AT_decl_column(0x10)
$C$DW$T$858	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$858, DW_AT_type(*$C$DW$T$235)
	.dwattr $C$DW$T$858, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$858, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$858, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$858, DW_AT_decl_column(0x43)
$C$DW$T$859	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$859, DW_AT_type(*$C$DW$T$858)
	.dwattr $C$DW$T$859, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$859, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$859, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$859, DW_AT_decl_column(0x2f)
$C$DW$T$860	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$860, DW_AT_type(*$C$DW$T$859)
	.dwattr $C$DW$T$860, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$860, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$860, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$860, DW_AT_decl_column(0x2b)

$C$DW$T$238	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$238, DW_AT_byte_size(0x08)
$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$910, DW_AT_name("length")
	.dwattr $C$DW$910, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$910, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$910, DW_AT_decl_column(0x16)
$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$237)
	.dwattr $C$DW$911, DW_AT_name("elem")
	.dwattr $C$DW$911, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$911, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$911, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$238

	.dwattr $C$DW$T$238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$238, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$238, DW_AT_decl_column(0x10)
$C$DW$T$861	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$861, DW_AT_type(*$C$DW$T$238)
	.dwattr $C$DW$T$861, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$861, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$861, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$861, DW_AT_decl_column(0x42)
$C$DW$T$862	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$861)
	.dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$862, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$862, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$862, DW_AT_decl_column(0x2b)
$C$DW$T$863	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$863, DW_AT_type(*$C$DW$T$862)
	.dwattr $C$DW$T$863, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$863, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$863, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$863, DW_AT_decl_column(0x27)

$C$DW$T$241	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$241, DW_AT_byte_size(0x08)
$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$912, DW_AT_name("length")
	.dwattr $C$DW$912, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$912, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0x197)
	.dwattr $C$DW$912, DW_AT_decl_column(0x16)
$C$DW$913	.dwtag  DW_TAG_member
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$240)
	.dwattr $C$DW$913, DW_AT_name("elem")
	.dwattr $C$DW$913, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$913, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0x197)
	.dwattr $C$DW$913, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$241

	.dwattr $C$DW$T$241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$241, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$241, DW_AT_decl_column(0x10)
$C$DW$T$864	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$864, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$T$864, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$864, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$864, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$864, DW_AT_decl_column(0x43)
$C$DW$T$865	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$865, DW_AT_type(*$C$DW$T$864)
	.dwattr $C$DW$T$865, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$865, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$865, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$865, DW_AT_decl_column(0x2c)
$C$DW$T$866	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$865)
	.dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$866, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$866, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$866, DW_AT_decl_column(0x28)

$C$DW$T$243	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$243, DW_AT_byte_size(0x34)
$C$DW$914	.dwtag  DW_TAG_member
	.dwattr $C$DW$914, DW_AT_type(*$C$DW$T$242)
	.dwattr $C$DW$914, DW_AT_name("shMemParams")
	.dwattr $C$DW$914, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$914, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$914, DW_AT_decl_line(0x102)
	.dwattr $C$DW$914, DW_AT_decl_column(0x26)
	.dwendtag $C$DW$T$243

	.dwattr $C$DW$T$243, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$243, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$243, DW_AT_decl_column(0x08)

$C$DW$T$247	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$247, DW_AT_byte_size(0x04)
$C$DW$915	.dwtag  DW_TAG_member
	.dwattr $C$DW$915, DW_AT_type(*$C$DW$T$244)
	.dwattr $C$DW$915, DW_AT_name("f")
	.dwattr $C$DW$915, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$915, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$915, DW_AT_decl_line(0xac)
	.dwattr $C$DW$915, DW_AT_decl_column(0x0f)
$C$DW$916	.dwtag  DW_TAG_member
	.dwattr $C$DW$916, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$916, DW_AT_name("a")
	.dwattr $C$DW$916, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$916, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$916, DW_AT_decl_line(0xad)
	.dwattr $C$DW$916, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$247

	.dwattr $C$DW$T$247, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x0f)
$C$DW$T$867	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$867, DW_AT_type(*$C$DW$T$247)
	.dwattr $C$DW$T$867, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$867, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$867, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$867, DW_AT_decl_column(0x03)

$C$DW$T$868	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$868, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$868, DW_AT_byte_size(0x01)
$C$DW$917	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$917, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$917, DW_AT_decl_line(0x163)
	.dwattr $C$DW$917, DW_AT_decl_column(0x05)
$C$DW$918	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$918, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$918, DW_AT_decl_line(0x167)
	.dwattr $C$DW$918, DW_AT_decl_column(0x05)
$C$DW$919	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$919, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$919, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$919, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$868

	.dwattr $C$DW$T$868, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$868, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$868, DW_AT_decl_column(0x0e)
$C$DW$T$869	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$869, DW_AT_type(*$C$DW$T$868)
	.dwattr $C$DW$T$869, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$869, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$869, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$869, DW_AT_decl_column(0x02)

$C$DW$T$870	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$870, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$870, DW_AT_byte_size(0x01)
$C$DW$920	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$920, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$920, DW_AT_decl_line(0x157)
	.dwattr $C$DW$920, DW_AT_decl_column(0x05)
$C$DW$921	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$921, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$921, DW_AT_decl_line(0x159)
	.dwattr $C$DW$921, DW_AT_decl_column(0x05)
$C$DW$922	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$922, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$922, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$922, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$870

	.dwattr $C$DW$T$870, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$870, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$870, DW_AT_decl_column(0x0e)
$C$DW$T$871	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$871, DW_AT_type(*$C$DW$T$870)
	.dwattr $C$DW$T$871, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$871, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$871, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$871, DW_AT_decl_column(0x02)

$C$DW$T$258	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$258, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$258, DW_AT_byte_size(0x0c)
$C$DW$923	.dwtag  DW_TAG_member
	.dwattr $C$DW$923, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$923, DW_AT_name("name")
	.dwattr $C$DW$923, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$923, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$923, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$923, DW_AT_decl_column(0x11)
$C$DW$924	.dwtag  DW_TAG_member
	.dwattr $C$DW$924, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$924, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$924, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$924, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$924, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$924, DW_AT_decl_column(0x11)
$C$DW$925	.dwtag  DW_TAG_member
	.dwattr $C$DW$925, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$925, DW_AT_name("sharedAddr")
	.dwattr $C$DW$925, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$925, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$925, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$925, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$258

	.dwattr $C$DW$T$258, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$258, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$258, DW_AT_decl_column(0x10)
$C$DW$T$872	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$872, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$872, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$872, DW_AT_decl_column(0x03)

$C$DW$T$261	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$261, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$261, DW_AT_byte_size(0x0c)
$C$DW$926	.dwtag  DW_TAG_member
	.dwattr $C$DW$926, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$926, DW_AT_name("eventNo")
	.dwattr $C$DW$926, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$926, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$926, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$926, DW_AT_decl_column(0x0c)
$C$DW$927	.dwtag  DW_TAG_member
	.dwattr $C$DW$927, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$927, DW_AT_name("maxInstances")
	.dwattr $C$DW$927, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$927, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$927, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$927, DW_AT_decl_column(0x0c)
$C$DW$928	.dwtag  DW_TAG_member
	.dwattr $C$DW$928, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$928, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$928, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$928, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$928, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$928, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$261

	.dwattr $C$DW$T$261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$261, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$261, DW_AT_decl_column(0x10)
$C$DW$T$873	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$873, DW_AT_type(*$C$DW$T$261)
	.dwattr $C$DW$T$873, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$873, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$873, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$873, DW_AT_decl_column(0x03)

$C$DW$T$874	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$874, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$874, DW_AT_byte_size(0x04)
$C$DW$929	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$929, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$929, DW_AT_decl_line(0x131)
	.dwattr $C$DW$929, DW_AT_decl_column(0x09)
$C$DW$930	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$930, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$930, DW_AT_decl_line(0x135)
	.dwattr $C$DW$930, DW_AT_decl_column(0x09)
$C$DW$931	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$931, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$931, DW_AT_decl_line(0x139)
	.dwattr $C$DW$931, DW_AT_decl_column(0x09)
$C$DW$932	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$932, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$932, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$932, DW_AT_decl_column(0x09)
$C$DW$933	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$933, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$933, DW_AT_decl_line(0x141)
	.dwattr $C$DW$933, DW_AT_decl_column(0x09)
$C$DW$934	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$934, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$934, DW_AT_decl_line(0x145)
	.dwattr $C$DW$934, DW_AT_decl_column(0x09)
$C$DW$935	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$935, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$935, DW_AT_decl_line(0x149)
	.dwattr $C$DW$935, DW_AT_decl_column(0x09)
$C$DW$936	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$936, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$936, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$936, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$874

	.dwattr $C$DW$T$874, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$874, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$874, DW_AT_decl_column(0x0e)
$C$DW$T$875	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$874)
	.dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$875, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$875, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$875, DW_AT_decl_column(0x03)

$C$DW$T$264	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$264, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$264, DW_AT_byte_size(0x10)
$C$DW$937	.dwtag  DW_TAG_member
	.dwattr $C$DW$937, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$937, DW_AT_name("size")
	.dwattr $C$DW$937, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$937, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$937, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$937, DW_AT_decl_column(0x0c)
$C$DW$938	.dwtag  DW_TAG_member
	.dwattr $C$DW$938, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$938, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$938, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$938, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$938, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$938, DW_AT_decl_column(0x1c)
$C$DW$939	.dwtag  DW_TAG_member
	.dwattr $C$DW$939, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$939, DW_AT_name("name")
	.dwattr $C$DW$939, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$939, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$939, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$939, DW_AT_decl_column(0x0c)
$C$DW$940	.dwtag  DW_TAG_member
	.dwattr $C$DW$940, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$940, DW_AT_name("openFlag")
	.dwattr $C$DW$940, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$940, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$940, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$940, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$264

	.dwattr $C$DW$T$264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$264, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$264, DW_AT_decl_column(0x10)
$C$DW$T$274	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$264)
	.dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$274, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$274, DW_AT_decl_column(0x03)

$C$DW$T$265	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$265, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$265, DW_AT_byte_size(0x14)
$C$DW$941	.dwtag  DW_TAG_member
	.dwattr $C$DW$941, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$941, DW_AT_name("size")
	.dwattr $C$DW$941, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$941, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$941, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$941, DW_AT_decl_column(0x0c)
$C$DW$942	.dwtag  DW_TAG_member
	.dwattr $C$DW$942, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$942, DW_AT_name("pixelFormat")
	.dwattr $C$DW$942, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$942, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$942, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$942, DW_AT_decl_column(0x0c)
$C$DW$943	.dwtag  DW_TAG_member
	.dwattr $C$DW$943, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$943, DW_AT_name("height")
	.dwattr $C$DW$943, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$943, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$943, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$943, DW_AT_decl_column(0x0c)
$C$DW$944	.dwtag  DW_TAG_member
	.dwattr $C$DW$944, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$944, DW_AT_name("width")
	.dwattr $C$DW$944, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$944, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$944, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$944, DW_AT_decl_column(0x0c)
$C$DW$945	.dwtag  DW_TAG_member
	.dwattr $C$DW$945, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$945, DW_AT_name("align")
	.dwattr $C$DW$945, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$945, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$945, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$945, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$265

	.dwattr $C$DW$T$265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x10)
$C$DW$T$876	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$T$876, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$876, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$876, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$876, DW_AT_decl_column(0x02)

$C$DW$T$877	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$877, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$877, DW_AT_byte_size(0x01)
$C$DW$946	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$946, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$946, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$946, DW_AT_decl_column(0x05)
$C$DW$947	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$947, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$947, DW_AT_decl_line(0x191)
	.dwattr $C$DW$947, DW_AT_decl_column(0x05)
$C$DW$948	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$948, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$948, DW_AT_decl_line(0x194)
	.dwattr $C$DW$948, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$877

	.dwattr $C$DW$T$877, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$877, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$877, DW_AT_decl_column(0x0e)
$C$DW$T$878	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$877)
	.dwattr $C$DW$T$878, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$878, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$878, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$878, DW_AT_decl_column(0x03)

$C$DW$T$879	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$879, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$879, DW_AT_byte_size(0x01)
$C$DW$949	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$949, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$949, DW_AT_decl_line(0x181)
	.dwattr $C$DW$949, DW_AT_decl_column(0x05)
$C$DW$950	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$950, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$950, DW_AT_decl_line(0x185)
	.dwattr $C$DW$950, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$879

	.dwattr $C$DW$T$879, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$879, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$879, DW_AT_decl_column(0x0e)
$C$DW$T$880	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$880, DW_AT_type(*$C$DW$T$879)
	.dwattr $C$DW$T$880, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$880, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$880, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$880, DW_AT_decl_column(0x03)

$C$DW$T$262	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$262, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
$C$DW$951	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$951, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$951, DW_AT_decl_line(0x175)
	.dwattr $C$DW$951, DW_AT_decl_column(0x05)
$C$DW$952	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$952, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$952, DW_AT_decl_line(0x179)
	.dwattr $C$DW$952, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$262

	.dwattr $C$DW$T$262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x0e)
$C$DW$T$263	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$263, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$263, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$263, DW_AT_decl_column(0x03)

$C$DW$T$273	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$273, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$273, DW_AT_byte_size(0x14)
$C$DW$953	.dwtag  DW_TAG_member
	.dwattr $C$DW$953, DW_AT_type(*$C$DW$T$267)
	.dwattr $C$DW$953, DW_AT_name("notifyType")
	.dwattr $C$DW$953, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$953, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$953, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$953, DW_AT_decl_column(0x1d)
$C$DW$954	.dwtag  DW_TAG_member
	.dwattr $C$DW$954, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$954, DW_AT_name("watermark")
	.dwattr $C$DW$954, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$954, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$954, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$954, DW_AT_decl_column(0x1d)
$C$DW$955	.dwtag  DW_TAG_member
	.dwattr $C$DW$955, DW_AT_type(*$C$DW$T$272)
	.dwattr $C$DW$955, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$955, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$955, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$955, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$955, DW_AT_decl_column(0x1d)
$C$DW$956	.dwtag  DW_TAG_member
	.dwattr $C$DW$956, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$956, DW_AT_name("cbContext")
	.dwattr $C$DW$956, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$956, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$956, DW_AT_decl_line(0x200)
	.dwattr $C$DW$956, DW_AT_decl_column(0x1d)
$C$DW$957	.dwtag  DW_TAG_member
	.dwattr $C$DW$957, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$957, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$957, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$957, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$957, DW_AT_decl_line(0x202)
	.dwattr $C$DW$957, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$273

	.dwattr $C$DW$T$273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$273, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$273, DW_AT_decl_column(0x10)
$C$DW$T$881	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$881, DW_AT_type(*$C$DW$T$273)
	.dwattr $C$DW$T$881, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$881, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$881, DW_AT_decl_line(0x205)
	.dwattr $C$DW$T$881, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$268	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$268, DW_AT_address_class(0x20)
$C$DW$T$269	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
	.dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$269, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$269, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$269, DW_AT_decl_column(0x25)

$C$DW$T$275	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$275, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$275, DW_AT_byte_size(0x18)
$C$DW$958	.dwtag  DW_TAG_member
	.dwattr $C$DW$958, DW_AT_type(*$C$DW$T$274)
	.dwattr $C$DW$958, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$958, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$958, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$958, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$958, DW_AT_decl_column(0x21)
$C$DW$959	.dwtag  DW_TAG_member
	.dwattr $C$DW$959, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$959, DW_AT_name("impParams")
	.dwattr $C$DW$959, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$959, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$959, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$959, DW_AT_decl_column(0x09)
$C$DW$960	.dwtag  DW_TAG_member
	.dwattr $C$DW$960, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$960, DW_AT_name("impParamsSize")
	.dwattr $C$DW$960, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$960, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$960, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$960, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$275

	.dwattr $C$DW$T$275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$275, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$T$275, DW_AT_decl_column(0x10)
$C$DW$T$882	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$882, DW_AT_type(*$C$DW$T$275)
	.dwattr $C$DW$T$882, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$882, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$882, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$T$882, DW_AT_decl_column(0x03)

$C$DW$T$278	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$278, DW_AT_name("FrameQ_Attrs_Tag")
	.dwattr $C$DW$T$278, DW_AT_byte_size(0x28)
$C$DW$961	.dwtag  DW_TAG_member
	.dwattr $C$DW$961, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$961, DW_AT_name("status")
	.dwattr $C$DW$961, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$961, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$961, DW_AT_decl_line(0xad)
	.dwattr $C$DW$961, DW_AT_decl_column(0x1a)
$C$DW$962	.dwtag  DW_TAG_member
	.dwattr $C$DW$962, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$962, DW_AT_name("version")
	.dwattr $C$DW$962, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$962, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$962, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$962, DW_AT_decl_column(0x1a)
$C$DW$963	.dwtag  DW_TAG_member
	.dwattr $C$DW$963, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$963, DW_AT_name("localProtect")
	.dwattr $C$DW$963, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$963, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$963, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$963, DW_AT_decl_column(0x1a)
$C$DW$964	.dwtag  DW_TAG_member
	.dwattr $C$DW$964, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$964, DW_AT_name("remoteProtect")
	.dwattr $C$DW$964, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$964, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$964, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$964, DW_AT_decl_column(0x1a)
$C$DW$965	.dwtag  DW_TAG_member
	.dwattr $C$DW$965, DW_AT_type(*$C$DW$T$277)
	.dwattr $C$DW$965, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$965, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$965, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$965, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$965, DW_AT_decl_column(0x1a)
$C$DW$966	.dwtag  DW_TAG_member
	.dwattr $C$DW$966, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$966, DW_AT_name("numReaders")
	.dwattr $C$DW$966, DW_AT_TI_symbol_name("numReaders")
	.dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$966, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$966, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$966, DW_AT_decl_column(0x1a)
$C$DW$967	.dwtag  DW_TAG_member
	.dwattr $C$DW$967, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$967, DW_AT_name("numActiveReaders")
	.dwattr $C$DW$967, DW_AT_TI_symbol_name("numActiveReaders")
	.dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$967, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$967, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$967, DW_AT_decl_column(0x1a)
$C$DW$968	.dwtag  DW_TAG_member
	.dwattr $C$DW$968, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$968, DW_AT_name("numQueues")
	.dwattr $C$DW$968, DW_AT_TI_symbol_name("numQueues")
	.dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$968, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$968, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$968, DW_AT_decl_column(0x1a)
$C$DW$969	.dwtag  DW_TAG_member
	.dwattr $C$DW$969, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$969, DW_AT_name("primaryQueueId")
	.dwattr $C$DW$969, DW_AT_TI_symbol_name("primaryQueueId")
	.dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$969, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$969, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$969, DW_AT_decl_column(0x1a)
$C$DW$970	.dwtag  DW_TAG_member
	.dwattr $C$DW$970, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$970, DW_AT_name("frmQBufMgrId")
	.dwattr $C$DW$970, DW_AT_TI_symbol_name("frmQBufMgrId")
	.dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$970, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$970, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$970, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$278

	.dwattr $C$DW$T$278, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$278, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$278, DW_AT_decl_column(0x10)
$C$DW$T$883	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Attrs")
	.dwattr $C$DW$T$883, DW_AT_type(*$C$DW$T$278)
	.dwattr $C$DW$T$883, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$883, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$883, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$T$883, DW_AT_decl_column(0x02)
$C$DW$T$884	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_Attrs")
	.dwattr $C$DW$T$884, DW_AT_type(*$C$DW$T$883)
	.dwattr $C$DW$T$884, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$884, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$884, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$884, DW_AT_decl_column(0x21)

$C$DW$T$279	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$279, DW_AT_name("FrameQ_CommonOpenParams_Tag")
	.dwattr $C$DW$T$279, DW_AT_byte_size(0x10)
$C$DW$971	.dwtag  DW_TAG_member
	.dwattr $C$DW$971, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$971, DW_AT_name("name")
	.dwattr $C$DW$971, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$971, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$971, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$971, DW_AT_decl_column(0x12)
$C$DW$972	.dwtag  DW_TAG_member
	.dwattr $C$DW$972, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$972, DW_AT_name("sharedAddr")
	.dwattr $C$DW$972, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$972, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$972, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$972, DW_AT_decl_column(0x11)
$C$DW$973	.dwtag  DW_TAG_member
	.dwattr $C$DW$973, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$973, DW_AT_name("openMode")
	.dwattr $C$DW$973, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$973, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$973, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$973, DW_AT_decl_column(0x11)
$C$DW$974	.dwtag  DW_TAG_member
	.dwattr $C$DW$974, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$974, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$974, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$974, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$974, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$974, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$279

	.dwattr $C$DW$T$279, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$279, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$279, DW_AT_decl_column(0x10)
$C$DW$T$325	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CommonOpenParams")
	.dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$279)
	.dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x03)

$C$DW$T$284	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$284, DW_AT_name("FrameQ_Config_Tag")
	.dwattr $C$DW$T$284, DW_AT_byte_size(0x0c)
$C$DW$975	.dwtag  DW_TAG_member
	.dwattr $C$DW$975, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$975, DW_AT_name("eventNo")
	.dwattr $C$DW$975, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$975, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$975, DW_AT_decl_line(0x197)
	.dwattr $C$DW$975, DW_AT_decl_column(0x0c)
$C$DW$976	.dwtag  DW_TAG_member
	.dwattr $C$DW$976, DW_AT_type(*$C$DW$T$283)
	.dwattr $C$DW$976, DW_AT_name("maxInstances")
	.dwattr $C$DW$976, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$976, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$976, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$976, DW_AT_decl_column(0x0c)
$C$DW$977	.dwtag  DW_TAG_member
	.dwattr $C$DW$977, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$977, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$977, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$977, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$977, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$977, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$284

	.dwattr $C$DW$T$284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$284, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$284, DW_AT_decl_column(0x10)
$C$DW$T$298	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Config")
	.dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$284)
	.dwattr $C$DW$T$298, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x03)
$C$DW$T$885	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_Config")
	.dwattr $C$DW$T$885, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$885, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$885, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ_ShMem.h")
	.dwattr $C$DW$T$885, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$885, DW_AT_decl_column(0x21)
$C$DW$T$886	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$886, DW_AT_type(*$C$DW$T$885)
	.dwattr $C$DW$T$886, DW_AT_address_class(0x20)
$C$DW$T$887	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$887, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$887, DW_AT_address_class(0x20)

$C$DW$T$888	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$888, DW_AT_name("FrameQ_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$888, DW_AT_byte_size(0x04)
$C$DW$978	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$978, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$978, DW_AT_decl_line(0x166)
	.dwattr $C$DW$978, DW_AT_decl_column(0x09)
$C$DW$979	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$979, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$979, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$979, DW_AT_decl_column(0x09)
$C$DW$980	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$980, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$980, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$980, DW_AT_decl_column(0x09)
$C$DW$981	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$981, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$981, DW_AT_decl_line(0x172)
	.dwattr $C$DW$981, DW_AT_decl_column(0x09)
$C$DW$982	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$982, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$982, DW_AT_decl_line(0x176)
	.dwattr $C$DW$982, DW_AT_decl_column(0x09)
$C$DW$983	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$983, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$983, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$983, DW_AT_decl_column(0x09)
$C$DW$984	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$984, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$984, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$984, DW_AT_decl_column(0x09)
$C$DW$985	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$985, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$985, DW_AT_decl_line(0x182)
	.dwattr $C$DW$985, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$888

	.dwattr $C$DW$T$888, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$888, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$888, DW_AT_decl_column(0x0e)
$C$DW$T$889	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CpuAccessFlags")
	.dwattr $C$DW$T$889, DW_AT_type(*$C$DW$T$888)
	.dwattr $C$DW$T$889, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$889, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$889, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$889, DW_AT_decl_column(0x03)

$C$DW$T$287	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$287, DW_AT_name("FrameQ_CreateParams_Tag")
	.dwattr $C$DW$T$287, DW_AT_byte_size(0x10)
$C$DW$986	.dwtag  DW_TAG_member
	.dwattr $C$DW$986, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$986, DW_AT_name("size")
	.dwattr $C$DW$986, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$986, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$986, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$986, DW_AT_decl_column(0x1d)
$C$DW$987	.dwtag  DW_TAG_member
	.dwattr $C$DW$987, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$987, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$987, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$987, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$987, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$987, DW_AT_decl_column(0x1d)
$C$DW$988	.dwtag  DW_TAG_member
	.dwattr $C$DW$988, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$988, DW_AT_name("name")
	.dwattr $C$DW$988, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$988, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$988, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$988, DW_AT_decl_column(0x1d)
$C$DW$989	.dwtag  DW_TAG_member
	.dwattr $C$DW$989, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$989, DW_AT_name("openFlag")
	.dwattr $C$DW$989, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$989, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$989, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$989, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$287

	.dwattr $C$DW$T$287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$287, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$287, DW_AT_decl_column(0x10)
$C$DW$T$327	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CreateParams")
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$327, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x03)
$C$DW$T$891	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$891, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$891, DW_AT_address_class(0x20)

$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_name("FrameQ_FrameQueue_Tag")
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x48)
$C$DW$990	.dwtag  DW_TAG_member
	.dwattr $C$DW$990, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$990, DW_AT_name("readerIndex")
	.dwattr $C$DW$990, DW_AT_TI_symbol_name("readerIndex")
	.dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$990, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$990, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$990, DW_AT_decl_column(0x1e)
$C$DW$991	.dwtag  DW_TAG_member
	.dwattr $C$DW$991, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$991, DW_AT_name("numFrames")
	.dwattr $C$DW$991, DW_AT_TI_symbol_name("numFrames")
	.dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$991, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$991, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$991, DW_AT_decl_column(0x1e)
$C$DW$992	.dwtag  DW_TAG_member
	.dwattr $C$DW$992, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$992, DW_AT_name("isAllocated")
	.dwattr $C$DW$992, DW_AT_TI_symbol_name("isAllocated")
	.dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$992, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$992, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$992, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$290

	.dwattr $C$DW$T$290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)
$C$DW$T$892	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_FrameQueue")
	.dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$892, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$892, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$T$892, DW_AT_decl_column(0x03)
$C$DW$T$893	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_FrameQueue")
	.dwattr $C$DW$T$893, DW_AT_type(*$C$DW$T$892)
	.dwattr $C$DW$T$893, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$893, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$893, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$893, DW_AT_decl_column(0x21)

$C$DW$T$285	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$285, DW_AT_name("FrameQ_Interface_Tag")
	.dwattr $C$DW$T$285, DW_AT_byte_size(0x01)
$C$DW$993	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$993, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$993, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$993, DW_AT_decl_column(0x05)
$C$DW$994	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$994, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$994, DW_AT_decl_line(0x190)
	.dwattr $C$DW$994, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$285

	.dwattr $C$DW$T$285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$285, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$285, DW_AT_decl_column(0x0e)
$C$DW$T$286	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Interface")
	.dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$286, DW_AT_decl_line(0x191)
	.dwattr $C$DW$T$286, DW_AT_decl_column(0x03)

$C$DW$T$300	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$300, DW_AT_name("FrameQ_ModuleObject_Tag")
	.dwattr $C$DW$T$300, DW_AT_byte_size(0x44)
$C$DW$995	.dwtag  DW_TAG_member
	.dwattr $C$DW$995, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$995, DW_AT_name("refCount")
	.dwattr $C$DW$995, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$995, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$995, DW_AT_decl_line(0x64)
	.dwattr $C$DW$995, DW_AT_decl_column(0x19)
$C$DW$996	.dwtag  DW_TAG_member
	.dwattr $C$DW$996, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$996, DW_AT_name("nameServer")
	.dwattr $C$DW$996, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$996, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$996, DW_AT_decl_line(0x66)
	.dwattr $C$DW$996, DW_AT_decl_column(0x1b)
$C$DW$997	.dwtag  DW_TAG_member
	.dwattr $C$DW$997, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$997, DW_AT_name("gate")
	.dwattr $C$DW$997, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$997, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$997, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$997, DW_AT_decl_column(0x1b)
$C$DW$998	.dwtag  DW_TAG_member
	.dwattr $C$DW$998, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$998, DW_AT_name("objList")
	.dwattr $C$DW$998, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$998, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$998, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$998, DW_AT_decl_column(0x1b)
$C$DW$999	.dwtag  DW_TAG_member
	.dwattr $C$DW$999, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$999, DW_AT_name("listLock")
	.dwattr $C$DW$999, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$999, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$999, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$999, DW_AT_decl_column(0x1b)
$C$DW$1000	.dwtag  DW_TAG_member
	.dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1000, DW_AT_name("cfg")
	.dwattr $C$DW$1000, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1000, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1000, DW_AT_decl_line(0x70)
	.dwattr $C$DW$1000, DW_AT_decl_column(0x1b)
$C$DW$1001	.dwtag  DW_TAG_member
	.dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$1001, DW_AT_name("defaultCfg")
	.dwattr $C$DW$1001, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1001, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1001, DW_AT_decl_line(0x72)
	.dwattr $C$DW$1001, DW_AT_decl_column(0x1b)
$C$DW$1002	.dwtag  DW_TAG_member
	.dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1002, DW_AT_name("defInstParams")
	.dwattr $C$DW$1002, DW_AT_TI_symbol_name("defInstParams")
	.dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1002, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1002, DW_AT_decl_line(0x74)
	.dwattr $C$DW$1002, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$300

	.dwattr $C$DW$T$300, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$300, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$300, DW_AT_decl_column(0x10)
$C$DW$T$895	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ModuleObject")
	.dwattr $C$DW$T$895, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$895, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$895, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$895, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$895, DW_AT_decl_column(0x03)
$C$DW$T$896	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$896, DW_AT_type(*$C$DW$T$895)
	.dwattr $C$DW$T$896, DW_AT_address_class(0x20)

$C$DW$T$301	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$301, DW_AT_name("FrameQ_NameServerEntry_tag")
	.dwattr $C$DW$T$301, DW_AT_byte_size(0x38)
$C$DW$1003	.dwtag  DW_TAG_member
	.dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1003, DW_AT_name("interfaceType")
	.dwattr $C$DW$1003, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1003, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$1003, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1003, DW_AT_decl_column(0x0b)
$C$DW$1004	.dwtag  DW_TAG_member
	.dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$243)
	.dwattr $C$DW$1004, DW_AT_name("instParams")
	.dwattr $C$DW$1004, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1004, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$1004, DW_AT_decl_line(0x103)
	.dwattr $C$DW$1004, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$301

	.dwattr $C$DW$T$301, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$301, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$T$301, DW_AT_decl_column(0x10)
$C$DW$T$897	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NameServerEntry")
	.dwattr $C$DW$T$897, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$T$897, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$897, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$897, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$897, DW_AT_decl_column(0x02)
$C$DW$T$898	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$898, DW_AT_type(*$C$DW$T$897)
	.dwattr $C$DW$T$898, DW_AT_address_class(0x20)

$C$DW$T$314	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$314, DW_AT_name("FrameQ_NotifyParams_Tag")
	.dwattr $C$DW$T$314, DW_AT_byte_size(0x14)
$C$DW$1005	.dwtag  DW_TAG_member
	.dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1005, DW_AT_name("notifyType")
	.dwattr $C$DW$1005, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1005, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1005, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$1005, DW_AT_decl_column(0x1c)
$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1006, DW_AT_name("watermark")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1006, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1006, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1006, DW_AT_decl_column(0x1d)
$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1007, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1007, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1007, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$1007, DW_AT_decl_column(0x1d)
$C$DW$1008	.dwtag  DW_TAG_member
	.dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$1008, DW_AT_name("cbContext")
	.dwattr $C$DW$1008, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1008, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1008, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1008, DW_AT_decl_column(0x1d)
$C$DW$1009	.dwtag  DW_TAG_member
	.dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$1009, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1009, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1009, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1009, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1009, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$314

	.dwattr $C$DW$T$314, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x10)
$C$DW$T$384	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyParams")
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$384, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$384, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$T$384, DW_AT_decl_column(0x03)
$C$DW$T$899	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_NotifyParams")
	.dwattr $C$DW$T$899, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$899, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$899, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$899, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$899, DW_AT_decl_column(0x21)
$C$DW$T$385	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$385, DW_AT_address_class(0x20)

$C$DW$T$302	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$302, DW_AT_name("FrameQ_NotifyType_Tag")
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x01)
$C$DW$1010	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1010, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1010, DW_AT_decl_line(0x140)
	.dwattr $C$DW$1010, DW_AT_decl_column(0x05)
$C$DW$1011	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1011, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1011, DW_AT_decl_line(0x142)
	.dwattr $C$DW$1011, DW_AT_decl_column(0x05)
$C$DW$1012	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1012, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1012, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1012, DW_AT_decl_column(0x05)
$C$DW$1013	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1013, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1013, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1013, DW_AT_decl_column(0x05)
$C$DW$1014	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1014, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1014, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1014, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$302

	.dwattr $C$DW$T$302, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x0e)
$C$DW$T$303	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyType")
	.dwattr $C$DW$T$303, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$303, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$303, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0x153)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x03)

$C$DW$T$319	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$319, DW_AT_name("FrameQ_Obj_Tag")
	.dwattr $C$DW$T$319, DW_AT_byte_size(0x68)
$C$DW$1015	.dwtag  DW_TAG_member
	.dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1015, DW_AT_name("listElem")
	.dwattr $C$DW$1015, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1015, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1015, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1015, DW_AT_decl_column(0x1a)
$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$1016, DW_AT_name("name")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1016, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1016, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1016, DW_AT_decl_column(0x15)
$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1017, DW_AT_name("gate")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1017, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1017, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1017, DW_AT_decl_column(0x17)
$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$1018, DW_AT_name("handle")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("handle")
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1018, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1018, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1018, DW_AT_decl_column(0x1d)
$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1019, DW_AT_name("instId")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("instId")
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1019, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1019, DW_AT_decl_line(0x83)
	.dwattr $C$DW$1019, DW_AT_decl_column(0x1d)
$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1020, DW_AT_name("notifyId")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1020, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1020, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1020, DW_AT_decl_column(0x1d)
$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1021, DW_AT_name("objType")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("objType")
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1021, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1021, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1021, DW_AT_decl_column(0x0c)
$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1022, DW_AT_name("objMode")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("objMode")
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1022, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1022, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1022, DW_AT_decl_column(0x0c)
$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1023, DW_AT_name("interfaceType")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1023, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1023, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$1023, DW_AT_decl_column(0x1d)
$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$1024, DW_AT_name("ctrlStructCacheFlag")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("ctrlStructCacheFlag")
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1024, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1024, DW_AT_decl_line(0x91)
	.dwattr $C$DW$1024, DW_AT_decl_column(0x1d)
$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$1025, DW_AT_name("frmHdrBufCacheFlag")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("frmHdrBufCacheFlag")
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1025, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1025, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1025, DW_AT_decl_column(0x1d)
$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1026, DW_AT_name("frmBufCacheFlag")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("frmBufCacheFlag")
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1026, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1026, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1026, DW_AT_decl_column(0x1d)
$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1027, DW_AT_name("bufCpuAccessFlag")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("bufCpuAccessFlag")
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1027, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1027, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$1027, DW_AT_decl_column(0x1d)
$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$1028, DW_AT_name("notifyRegId")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("notifyRegId")
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1028, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1028, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1028, DW_AT_decl_column(0x0c)
$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1029, DW_AT_name("params")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("params")
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1029, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1029, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1029, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$319

	.dwattr $C$DW$T$319, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$319, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$319, DW_AT_decl_column(0x10)
$C$DW$T$322	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Obj")
	.dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$322, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$322, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$322, DW_AT_decl_column(0x03)
$C$DW$T$323	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$T$323, DW_AT_address_class(0x20)

$C$DW$T$324	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$324, DW_AT_name("FrameQ_Object")
	.dwattr $C$DW$T$324, DW_AT_byte_size(0x08)
$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$1030, DW_AT_name("fxns")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1030, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1030, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1030, DW_AT_decl_column(0x12)
$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1031, DW_AT_name("obj")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1031, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$1031, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1031, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$324

	.dwattr $C$DW$T$324, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$324, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$T$324, DW_AT_decl_column(0x10)
$C$DW$T$900	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Object")
	.dwattr $C$DW$T$900, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$T$900, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$900, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$900, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$900, DW_AT_decl_column(0x03)
$C$DW$T$901	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$901, DW_AT_type(*$C$DW$T$900)
	.dwattr $C$DW$T$901, DW_AT_address_class(0x20)
$C$DW$T$304	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$T$304, DW_AT_address_class(0x20)
$C$DW$T$305	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Handle")
	.dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$305, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0x135)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x20)
$C$DW$T$904	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$904, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$T$904, DW_AT_address_class(0x20)

$C$DW$T$905	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$905, DW_AT_name("FrameQ_OpenMode_Tag")
	.dwattr $C$DW$T$905, DW_AT_byte_size(0x01)
$C$DW$1032	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1032, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1032, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1032, DW_AT_decl_column(0x05)
$C$DW$1033	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1033, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1033, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1033, DW_AT_decl_column(0x05)
$C$DW$1034	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_READER"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1034, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1034, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$1034, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$905

	.dwattr $C$DW$T$905, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$905, DW_AT_decl_line(0x158)
	.dwattr $C$DW$T$905, DW_AT_decl_column(0x0e)
$C$DW$T$906	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_OpenMode")
	.dwattr $C$DW$T$906, DW_AT_type(*$C$DW$T$905)
	.dwattr $C$DW$T$906, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$906, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$906, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$T$906, DW_AT_decl_column(0x03)

$C$DW$T$326	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$326, DW_AT_name("FrameQ_OpenParams_tag")
	.dwattr $C$DW$T$326, DW_AT_byte_size(0x10)
$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1035, DW_AT_name("commonOpenParams")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("commonOpenParams")
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1035, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$1035, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1035, DW_AT_decl_column(0x21)
	.dwendtag $C$DW$T$326

	.dwattr $C$DW$T$326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x10)
$C$DW$T$907	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_OpenParams")
	.dwattr $C$DW$T$907, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$T$907, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$907, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$907, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$907, DW_AT_decl_column(0x03)
$C$DW$T$908	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$908, DW_AT_type(*$C$DW$T$907)
	.dwattr $C$DW$T$908, DW_AT_address_class(0x20)

$C$DW$T$328	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$328, DW_AT_name("FrameQ_Params")
	.dwattr $C$DW$T$328, DW_AT_byte_size(0x18)
$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$1036, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1036, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$1036, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$1036, DW_AT_decl_column(0x1b)
$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$1037, DW_AT_name("impParams")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
