;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:20 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../RingIOShm.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$1053, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1053, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$1053, DW_AT_decl_column(0x0e)
$C$DW$T$1054	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$1054, DW_AT_type(*$C$DW$T$1053)
	.dwattr $C$DW$T$1054, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1054, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1054, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$1054, DW_AT_decl_column(0x03)

$C$DW$T$1055	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1055, DW_AT_byte_size(0x01)
$C$DW$1446	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1446, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1446, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1446, DW_AT_decl_column(0x05)
$C$DW$1447	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1447, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1447, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1447, DW_AT_decl_column(0x05)
$C$DW$1448	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1448, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1448, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1448, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1055

	.dwattr $C$DW$T$1055, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1055, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$1055, DW_AT_decl_column(0x0e)
$C$DW$T$1056	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$1056, DW_AT_type(*$C$DW$T$1055)
	.dwattr $C$DW$T$1056, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1056, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1056, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1056, DW_AT_decl_column(0x03)

$C$DW$T$1057	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1057, DW_AT_byte_size(0x02)
$C$DW$1449	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1449, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1449, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1449, DW_AT_decl_column(0x05)
$C$DW$1450	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1450, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1450, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1450, DW_AT_decl_column(0x05)
$C$DW$1451	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1451, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1451, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1451, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1057

	.dwattr $C$DW$T$1057, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1057, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1057, DW_AT_decl_column(0x0e)
$C$DW$T$1058	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1058, DW_AT_type(*$C$DW$T$1057)
	.dwattr $C$DW$T$1058, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1058, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1058, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1058, DW_AT_decl_column(0x03)

$C$DW$T$1059	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1059, DW_AT_byte_size(0x01)
$C$DW$1452	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1452, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1452, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1452, DW_AT_decl_column(0x05)
$C$DW$1453	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1453, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1453, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1453, DW_AT_decl_column(0x05)
$C$DW$1454	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1454, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1454, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1454, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1059

	.dwattr $C$DW$T$1059, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1059, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1059, DW_AT_decl_column(0x0e)
$C$DW$T$1060	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1060, DW_AT_type(*$C$DW$T$1059)
	.dwattr $C$DW$T$1060, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1060, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1060, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1060, DW_AT_decl_column(0x03)

$C$DW$T$300	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$300, DW_AT_byte_size(0x08)
$C$DW$1455	.dwtag  DW_TAG_member
	.dwattr $C$DW$1455, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1455, DW_AT_name("length")
	.dwattr $C$DW$1455, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1455, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1455, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1455, DW_AT_decl_column(0x16)
$C$DW$1456	.dwtag  DW_TAG_member
	.dwattr $C$DW$1456, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1456, DW_AT_name("elem")
	.dwattr $C$DW$1456, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1456, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1456, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1456, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$300

	.dwattr $C$DW$T$300, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$300, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$300, DW_AT_decl_column(0x10)
$C$DW$T$1061	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1061, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1061, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1061, DW_AT_decl_column(0x43)
$C$DW$T$1062	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
	.dwattr $C$DW$T$1062, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1062, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1062, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1062, DW_AT_decl_column(0x30)
$C$DW$T$1063	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$1062)
	.dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1063, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1063, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1063, DW_AT_decl_column(0x2c)

$C$DW$T$301	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$301, DW_AT_byte_size(0x08)
$C$DW$1457	.dwtag  DW_TAG_member
	.dwattr $C$DW$1457, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1457, DW_AT_name("length")
	.dwattr $C$DW$1457, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1457, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1457, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1457, DW_AT_decl_column(0x16)
$C$DW$1458	.dwtag  DW_TAG_member
	.dwattr $C$DW$1458, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1458, DW_AT_name("elem")
	.dwattr $C$DW$1458, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1458, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1458, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1458, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$301

	.dwattr $C$DW$T$301, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$301, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$301, DW_AT_decl_column(0x10)
$C$DW$T$1064	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1064, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1064, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1064, DW_AT_decl_column(0x43)
$C$DW$T$1065	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$1064)
	.dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1065, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1065, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1065, DW_AT_decl_column(0x2f)
$C$DW$T$1066	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$1065)
	.dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1066, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1066, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1066, DW_AT_decl_column(0x2b)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$1459	.dwtag  DW_TAG_member
	.dwattr $C$DW$1459, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1459, DW_AT_name("length")
	.dwattr $C$DW$1459, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1459, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1459, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1459, DW_AT_decl_column(0x16)
$C$DW$1460	.dwtag  DW_TAG_member
	.dwattr $C$DW$1460, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1460, DW_AT_name("elem")
	.dwattr $C$DW$1460, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1460, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1460, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1460, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$1067	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1067, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1067, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1067, DW_AT_decl_column(0x42)
$C$DW$T$1068	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$1067)
	.dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1068, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1068, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1068, DW_AT_decl_column(0x2b)
$C$DW$T$1069	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$1068)
	.dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1069, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1069, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1069, DW_AT_decl_column(0x27)

$C$DW$T$307	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$307, DW_AT_byte_size(0x08)
$C$DW$1461	.dwtag  DW_TAG_member
	.dwattr $C$DW$1461, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1461, DW_AT_name("length")
	.dwattr $C$DW$1461, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1461, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1461, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1461, DW_AT_decl_column(0x16)
$C$DW$1462	.dwtag  DW_TAG_member
	.dwattr $C$DW$1462, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$1462, DW_AT_name("elem")
	.dwattr $C$DW$1462, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1462, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1462, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1462, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$307

	.dwattr $C$DW$T$307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$307, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$307, DW_AT_decl_column(0x10)
$C$DW$T$1070	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1070, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1070, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1070, DW_AT_decl_column(0x43)
$C$DW$T$1071	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1070)
	.dwattr $C$DW$T$1071, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1071, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1071, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1071, DW_AT_decl_column(0x2c)
$C$DW$T$1072	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1072, DW_AT_type(*$C$DW$T$1071)
	.dwattr $C$DW$T$1072, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1072, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1072, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1072, DW_AT_decl_column(0x28)

$C$DW$T$311	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$311, DW_AT_byte_size(0x04)
$C$DW$1463	.dwtag  DW_TAG_member
	.dwattr $C$DW$1463, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1463, DW_AT_name("f")
	.dwattr $C$DW$1463, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1463, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1463, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1463, DW_AT_decl_column(0x0f)
$C$DW$1464	.dwtag  DW_TAG_member
	.dwattr $C$DW$1464, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$1464, DW_AT_name("a")
	.dwattr $C$DW$1464, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1464, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1464, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1464, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$311

	.dwattr $C$DW$T$311, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x0f)
$C$DW$T$1073	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1073, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$T$1073, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1073, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1073, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1073, DW_AT_decl_column(0x03)

$C$DW$T$1074	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1074, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1074, DW_AT_byte_size(0x01)
$C$DW$1465	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1465, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1465, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1465, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1074

	.dwattr $C$DW$T$1074, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1074, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1074, DW_AT_decl_column(0x0e)
$C$DW$T$1075	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1075, DW_AT_type(*$C$DW$T$1074)
	.dwattr $C$DW$T$1075, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1075, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1075, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1075, DW_AT_decl_column(0x03)

$C$DW$T$320	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$320, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$320, DW_AT_byte_size(0x10)
$C$DW$1466	.dwtag  DW_TAG_member
	.dwattr $C$DW$1466, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1466, DW_AT_name("gate")
	.dwattr $C$DW$1466, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1466, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1466, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1466, DW_AT_decl_column(0x1b)
$C$DW$1467	.dwtag  DW_TAG_member
	.dwattr $C$DW$1467, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1467, DW_AT_name("numProcessors")
	.dwattr $C$DW$1467, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1467, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1467, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1467, DW_AT_decl_column(0x0f)
$C$DW$1468	.dwtag  DW_TAG_member
	.dwattr $C$DW$1468, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1468, DW_AT_name("procIds")
	.dwattr $C$DW$1468, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1468, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1468, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1468, DW_AT_decl_column(0x0f)
$C$DW$1469	.dwtag  DW_TAG_member
	.dwattr $C$DW$1469, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1469, DW_AT_name("drvHandles")
	.dwattr $C$DW$1469, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1469, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1469, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1469, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1469, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$320

	.dwattr $C$DW$T$320, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$320, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$320, DW_AT_decl_column(0x10)
$C$DW$T$1076	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1076, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1076, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1076, DW_AT_decl_column(0x03)

$C$DW$T$1077	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1077, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1077, DW_AT_byte_size(0x01)
$C$DW$1470	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1470, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1470, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1470, DW_AT_decl_column(0x05)
$C$DW$1471	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1471, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1471, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1471, DW_AT_decl_column(0x05)
$C$DW$1472	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1472, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1472, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1472, DW_AT_decl_column(0x05)
$C$DW$1473	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1473, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1473, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1473, DW_AT_decl_column(0x05)
$C$DW$1474	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1474, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1474, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1474, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1077

	.dwattr $C$DW$T$1077, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1077, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1077, DW_AT_decl_column(0x0e)
$C$DW$T$1078	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1078, DW_AT_type(*$C$DW$T$1077)
	.dwattr $C$DW$T$1078, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1078, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1078, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1078, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$428	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$428, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$428, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$428, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x27)
$C$DW$T$429	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$429, DW_AT_address_class(0x20)
$C$DW$T$430	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$430, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$430, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$430, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$430, DW_AT_decl_column(0x22)
$C$DW$T$1085	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$T$1085, DW_AT_address_class(0x20)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x2c)
$C$DW$1475	.dwtag  DW_TAG_member
	.dwattr $C$DW$1475, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1475, DW_AT_name("name")
	.dwattr $C$DW$1475, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1475, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1475, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1475, DW_AT_decl_column(0x14)
$C$DW$1476	.dwtag  DW_TAG_member
	.dwattr $C$DW$1476, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1476, DW_AT_name("eventNo")
	.dwattr $C$DW$1476, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1476, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1476, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1476, DW_AT_decl_column(0x14)
$C$DW$1477	.dwtag  DW_TAG_member
	.dwattr $C$DW$1477, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1477, DW_AT_name("openFlag")
	.dwattr $C$DW$1477, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1477, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1477, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1477, DW_AT_decl_column(0x14)
$C$DW$1478	.dwtag  DW_TAG_member
	.dwattr $C$DW$1478, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1478, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1478, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1478, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1478, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1478, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1478, DW_AT_decl_column(0x14)
$C$DW$1479	.dwtag  DW_TAG_member
	.dwattr $C$DW$1479, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1479, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1479, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1479, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1479, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1479, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1479, DW_AT_decl_column(0x14)
$C$DW$1480	.dwtag  DW_TAG_member
	.dwattr $C$DW$1480, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1480, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1480, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1480, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1480, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1480, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1480, DW_AT_decl_column(0x14)
$C$DW$1481	.dwtag  DW_TAG_member
	.dwattr $C$DW$1481, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1481, DW_AT_name("gate")
	.dwattr $C$DW$1481, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1481, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1481, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1481, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1481, DW_AT_decl_column(0x14)
$C$DW$1482	.dwtag  DW_TAG_member
	.dwattr $C$DW$1482, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1482, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1482, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1482, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1482, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1482, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1482, DW_AT_decl_column(0x14)
$C$DW$1483	.dwtag  DW_TAG_member
	.dwattr $C$DW$1483, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1483, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1483, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1483, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1483, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1483, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1483, DW_AT_decl_column(0x14)
$C$DW$1484	.dwtag  DW_TAG_member
	.dwattr $C$DW$1484, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1484, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1484, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1484, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1484, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1484, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1484, DW_AT_decl_column(0x14)
$C$DW$1485	.dwtag  DW_TAG_member
	.dwattr $C$DW$1485, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1485, DW_AT_name("regionId")
	.dwattr $C$DW$1485, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1485, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1485, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1485, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1485, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$1081	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1081, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$1081, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1081, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1081, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1081, DW_AT_decl_column(0x03)
$C$DW$T$1086	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1086, DW_AT_type(*$C$DW$T$1081)
$C$DW$T$1087	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$1086)
	.dwattr $C$DW$T$1087, DW_AT_address_class(0x20)
$C$DW$T$1082	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1082, DW_AT_type(*$C$DW$T$1081)
	.dwattr $C$DW$T$1082, DW_AT_address_class(0x20)

$C$DW$T$337	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$337, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x1c)
$C$DW$1486	.dwtag  DW_TAG_member
	.dwattr $C$DW$1486, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1486, DW_AT_name("clientHandle")
	.dwattr $C$DW$1486, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1486, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1486, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1486, DW_AT_decl_column(0x12)
$C$DW$1487	.dwtag  DW_TAG_member
	.dwattr $C$DW$1487, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1487, DW_AT_name("procId")
	.dwattr $C$DW$1487, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1487, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1487, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1487, DW_AT_decl_column(0x12)
$C$DW$1488	.dwtag  DW_TAG_member
	.dwattr $C$DW$1488, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1488, DW_AT_name("notifyType")
	.dwattr $C$DW$1488, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1488, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1488, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1488, DW_AT_decl_column(0x12)
$C$DW$1489	.dwtag  DW_TAG_member
	.dwattr $C$DW$1489, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$1489, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1489, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1489, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1489, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1489, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1489, DW_AT_decl_column(0x1d)
$C$DW$1490	.dwtag  DW_TAG_member
	.dwattr $C$DW$1490, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1490, DW_AT_name("cbContext")
	.dwattr $C$DW$1490, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1490, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1490, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1490, DW_AT_decl_column(0x12)
$C$DW$1491	.dwtag  DW_TAG_member
	.dwattr $C$DW$1491, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1491, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1491, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1491, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1491, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1491, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1491, DW_AT_decl_column(0x12)
$C$DW$1492	.dwtag  DW_TAG_member
	.dwattr $C$DW$1492, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1492, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1492, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1492, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1492, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1492, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$337

	.dwattr $C$DW$T$337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x10)
$C$DW$T$1088	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$1088, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1088, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1088, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1088, DW_AT_decl_column(0x03)
$C$DW$T$1089	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$1088)
	.dwattr $C$DW$T$1089, DW_AT_address_class(0x20)

$C$DW$T$338	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$338, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
$C$DW$1493	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1493, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1493, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1493, DW_AT_decl_column(0x05)
$C$DW$1494	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1494, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1494, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1494, DW_AT_decl_column(0x05)
$C$DW$1495	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1495, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1495, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1495, DW_AT_decl_column(0x05)
$C$DW$1496	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1496, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1496, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1496, DW_AT_decl_column(0x05)
$C$DW$1497	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1497, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1497, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1497, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x0e)
$C$DW$T$339	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$339, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$327	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$327, DW_AT_address_class(0x20)
$C$DW$T$328	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$328, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$328, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$328, DW_AT_decl_column(0x1f)
$C$DW$T$1091	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$T$1091, DW_AT_address_class(0x20)

$C$DW$T$342	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$342, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$342, DW_AT_byte_size(0x10)
$C$DW$1498	.dwtag  DW_TAG_member
	.dwattr $C$DW$1498, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1498, DW_AT_name("name")
	.dwattr $C$DW$1498, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1498, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1498, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1498, DW_AT_decl_column(0x0c)
$C$DW$1499	.dwtag  DW_TAG_member
	.dwattr $C$DW$1499, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1499, DW_AT_name("regionId")
	.dwattr $C$DW$1499, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1499, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1499, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1499, DW_AT_decl_column(0x0c)
$C$DW$1500	.dwtag  DW_TAG_member
	.dwattr $C$DW$1500, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1500, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1500, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1500, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1500, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1500, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1500, DW_AT_decl_column(0x09)
$C$DW$1501	.dwtag  DW_TAG_member
	.dwattr $C$DW$1501, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1501, DW_AT_name("localProtect")
	.dwattr $C$DW$1501, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1501, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1501, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1501, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1501, DW_AT_decl_column(0x19)
$C$DW$1502	.dwtag  DW_TAG_member
	.dwattr $C$DW$1502, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1502, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1502, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1502, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1502, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1502, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1502, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$342

	.dwattr $C$DW$T$342, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x10)
$C$DW$T$1094	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1094, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$1094, DW_AT_decl_line(0x123)
	.dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)

$C$DW$T$340	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$340, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$340, DW_AT_byte_size(0x01)
$C$DW$1503	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1503, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1503, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1503, DW_AT_decl_column(0x05)
$C$DW$1504	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1504, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1504, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1504, DW_AT_decl_column(0x05)
$C$DW$1505	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1505, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1505, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1505, DW_AT_decl_column(0x05)
$C$DW$1506	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1506, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1506, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1506, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$340

	.dwattr $C$DW$T$340, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$340, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$340, DW_AT_decl_column(0x0e)
$C$DW$T$341	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$341, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x03)

$C$DW$T$420	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$420, DW_AT_name("IRingIO_Object_tag")
	.dwattr $C$DW$T$420, DW_AT_byte_size(0x90)
$C$DW$1507	.dwtag  DW_TAG_member
	.dwattr $C$DW$1507, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1507, DW_AT_name("listElem")
	.dwattr $C$DW$1507, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1507, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1507, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1507, DW_AT_decl_column(0x27)
$C$DW$1508	.dwtag  DW_TAG_member
	.dwattr $C$DW$1508, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1508, DW_AT_name("ownerProcId")
	.dwattr $C$DW$1508, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$1508, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1508, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1508, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1508, DW_AT_decl_column(0x27)
$C$DW$1509	.dwtag  DW_TAG_member
	.dwattr $C$DW$1509, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1509, DW_AT_name("name")
	.dwattr $C$DW$1509, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1509, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1509, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1509, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1509, DW_AT_decl_column(0x27)
$C$DW$1510	.dwtag  DW_TAG_member
	.dwattr $C$DW$1510, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1510, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$1510, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$1510, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1510, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1510, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1510, DW_AT_decl_column(0x27)
$C$DW$1511	.dwtag  DW_TAG_member
	.dwattr $C$DW$1511, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1511, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$1511, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$1511, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1511, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1511, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1511, DW_AT_decl_column(0x27)
$C$DW$1512	.dwtag  DW_TAG_member
	.dwattr $C$DW$1512, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1512, DW_AT_name("remoteProcId")
	.dwattr $C$DW$1512, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$1512, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1512, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1512, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1512, DW_AT_decl_column(0x27)
$C$DW$1513	.dwtag  DW_TAG_member
	.dwattr $C$DW$1513, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1513, DW_AT_name("top")
	.dwattr $C$DW$1513, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1513, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1513, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1513, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1513, DW_AT_decl_column(0x27)
$C$DW$1514	.dwtag  DW_TAG_member
	.dwattr $C$DW$1514, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1514, DW_AT_name("nsKey")
	.dwattr $C$DW$1514, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1514, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1514, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1514, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$1514, DW_AT_decl_column(0x27)
$C$DW$1515	.dwtag  DW_TAG_member
	.dwattr $C$DW$1515, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1515, DW_AT_name("created")
	.dwattr $C$DW$1515, DW_AT_TI_symbol_name("created")
	.dwattr $C$DW$1515, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1515, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1515, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1515, DW_AT_decl_column(0x27)
$C$DW$1516	.dwtag  DW_TAG_member
	.dwattr $C$DW$1516, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1516, DW_AT_name("deleteFn")
	.dwattr $C$DW$1516, DW_AT_TI_symbol_name("deleteFn")
	.dwattr $C$DW$1516, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1516, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1516, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1516, DW_AT_decl_column(0x27)
$C$DW$1517	.dwtag  DW_TAG_member
	.dwattr $C$DW$1517, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1517, DW_AT_name("close")
	.dwattr $C$DW$1517, DW_AT_TI_symbol_name("close")
	.dwattr $C$DW$1517, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1517, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1517, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1517, DW_AT_decl_column(0x27)
$C$DW$1518	.dwtag  DW_TAG_member
	.dwattr $C$DW$1518, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1518, DW_AT_name("registerNotifier")
	.dwattr $C$DW$1518, DW_AT_TI_symbol_name("registerNotifier")
	.dwattr $C$DW$1518, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1518, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1518, DW_AT_decl_line(0x104)
	.dwattr $C$DW$1518, DW_AT_decl_column(0x27)
$C$DW$1519	.dwtag  DW_TAG_member
	.dwattr $C$DW$1519, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$1519, DW_AT_name("unregisterNotifier")
	.dwattr $C$DW$1519, DW_AT_TI_symbol_name("unregisterNotifier")
	.dwattr $C$DW$1519, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1519, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1519, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1519, DW_AT_decl_column(0x27)
$C$DW$1520	.dwtag  DW_TAG_member
	.dwattr $C$DW$1520, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1520, DW_AT_name("setWaterMark")
	.dwattr $C$DW$1520, DW_AT_TI_symbol_name("setWaterMark")
	.dwattr $C$DW$1520, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1520, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1520, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1520, DW_AT_decl_column(0x27)
$C$DW$1521	.dwtag  DW_TAG_member
	.dwattr $C$DW$1521, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1521, DW_AT_name("setNotifyType")
	.dwattr $C$DW$1521, DW_AT_TI_symbol_name("setNotifyType")
	.dwattr $C$DW$1521, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1521, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1521, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1521, DW_AT_decl_column(0x27)
$C$DW$1522	.dwtag  DW_TAG_member
	.dwattr $C$DW$1522, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$1522, DW_AT_name("acquire")
	.dwattr $C$DW$1522, DW_AT_TI_symbol_name("acquire")
	.dwattr $C$DW$1522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1522, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1522, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1522, DW_AT_decl_column(0x27)
$C$DW$1523	.dwtag  DW_TAG_member
	.dwattr $C$DW$1523, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$1523, DW_AT_name("release")
	.dwattr $C$DW$1523, DW_AT_TI_symbol_name("release")
	.dwattr $C$DW$1523, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1523, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1523, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1523, DW_AT_decl_column(0x27)
$C$DW$1524	.dwtag  DW_TAG_member
	.dwattr $C$DW$1524, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$1524, DW_AT_name("cancel")
	.dwattr $C$DW$1524, DW_AT_TI_symbol_name("cancel")
	.dwattr $C$DW$1524, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1524, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1524, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1524, DW_AT_decl_column(0x27)
$C$DW$1525	.dwtag  DW_TAG_member
	.dwattr $C$DW$1525, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$1525, DW_AT_name("getvAttribute")
	.dwattr $C$DW$1525, DW_AT_TI_symbol_name("getvAttribute")
	.dwattr $C$DW$1525, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1525, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1525, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1525, DW_AT_decl_column(0x27)
$C$DW$1526	.dwtag  DW_TAG_member
	.dwattr $C$DW$1526, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$1526, DW_AT_name("setvAttribute")
	.dwattr $C$DW$1526, DW_AT_TI_symbol_name("setvAttribute")
	.dwattr $C$DW$1526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1526, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1526, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1526, DW_AT_decl_column(0x27)
$C$DW$1527	.dwtag  DW_TAG_member
	.dwattr $C$DW$1527, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1527, DW_AT_name("getAttribute")
	.dwattr $C$DW$1527, DW_AT_TI_symbol_name("getAttribute")
	.dwattr $C$DW$1527, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1527, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1527, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1527, DW_AT_decl_column(0x27)
$C$DW$1528	.dwtag  DW_TAG_member
	.dwattr $C$DW$1528, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$1528, DW_AT_name("setAttribute")
	.dwattr $C$DW$1528, DW_AT_TI_symbol_name("setAttribute")
	.dwattr $C$DW$1528, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1528, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1528, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1528, DW_AT_decl_column(0x27)
$C$DW$1529	.dwtag  DW_TAG_member
	.dwattr $C$DW$1529, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$1529, DW_AT_name("flush")
	.dwattr $C$DW$1529, DW_AT_TI_symbol_name("flush")
	.dwattr $C$DW$1529, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1529, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1529, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1529, DW_AT_decl_column(0x27)
$C$DW$1530	.dwtag  DW_TAG_member
	.dwattr $C$DW$1530, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$1530, DW_AT_name("notify")
	.dwattr $C$DW$1530, DW_AT_TI_symbol_name("notify")
	.dwattr $C$DW$1530, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1530, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1530, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1530, DW_AT_decl_column(0x2b)
$C$DW$1531	.dwtag  DW_TAG_member
	.dwattr $C$DW$1531, DW_AT_type(*$C$DW$T$405)
	.dwattr $C$DW$1531, DW_AT_name("getValidSize")
	.dwattr $C$DW$1531, DW_AT_TI_symbol_name("getValidSize")
	.dwattr $C$DW$1531, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1531, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1531, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1531, DW_AT_decl_column(0x27)
$C$DW$1532	.dwtag  DW_TAG_member
	.dwattr $C$DW$1532, DW_AT_type(*$C$DW$T$406)
	.dwattr $C$DW$1532, DW_AT_name("getEmptySize")
	.dwattr $C$DW$1532, DW_AT_TI_symbol_name("getEmptySize")
	.dwattr $C$DW$1532, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1532, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1532, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1532, DW_AT_decl_column(0x27)
$C$DW$1533	.dwtag  DW_TAG_member
	.dwattr $C$DW$1533, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$1533, DW_AT_name("getValidAttrSize")
	.dwattr $C$DW$1533, DW_AT_TI_symbol_name("getValidAttrSize")
	.dwattr $C$DW$1533, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1533, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1533, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1533, DW_AT_decl_column(0x27)
$C$DW$1534	.dwtag  DW_TAG_member
	.dwattr $C$DW$1534, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$1534, DW_AT_name("getEmptyAttrSize")
	.dwattr $C$DW$1534, DW_AT_TI_symbol_name("getEmptyAttrSize")
	.dwattr $C$DW$1534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1534, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1534, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1534, DW_AT_decl_column(0x27)
$C$DW$1535	.dwtag  DW_TAG_member
	.dwattr $C$DW$1535, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$1535, DW_AT_name("getAcquiredOffset")
	.dwattr $C$DW$1535, DW_AT_TI_symbol_name("getAcquiredOffset")
	.dwattr $C$DW$1535, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1535, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1535, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1535, DW_AT_decl_column(0x27)
$C$DW$1536	.dwtag  DW_TAG_member
	.dwattr $C$DW$1536, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$1536, DW_AT_name("getAcquiredSize")
	.dwattr $C$DW$1536, DW_AT_TI_symbol_name("getAcquiredSize")
	.dwattr $C$DW$1536, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1536, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1536, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1536, DW_AT_decl_column(0x27)
$C$DW$1537	.dwtag  DW_TAG_member
	.dwattr $C$DW$1537, DW_AT_type(*$C$DW$T$411)
	.dwattr $C$DW$1537, DW_AT_name("getWaterMark")
	.dwattr $C$DW$1537, DW_AT_TI_symbol_name("getWaterMark")
	.dwattr $C$DW$1537, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$1537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1537, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1537, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1537, DW_AT_decl_column(0x27)
$C$DW$1538	.dwtag  DW_TAG_member
	.dwattr $C$DW$1538, DW_AT_type(*$C$DW$T$414)
	.dwattr $C$DW$1538, DW_AT_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1538, DW_AT_TI_symbol_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1538, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1538, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1538, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1538, DW_AT_decl_column(0x27)
$C$DW$1539	.dwtag  DW_TAG_member
	.dwattr $C$DW$1539, DW_AT_type(*$C$DW$T$415)
	.dwattr $C$DW$1539, DW_AT_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1539, DW_AT_TI_symbol_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1539, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1539, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1539, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1539, DW_AT_decl_column(0x2a)
$C$DW$1540	.dwtag  DW_TAG_member
	.dwattr $C$DW$1540, DW_AT_type(*$C$DW$T$418)
	.dwattr $C$DW$1540, DW_AT_name("setNotifyId")
	.dwattr $C$DW$1540, DW_AT_TI_symbol_name("setNotifyId")
	.dwattr $C$DW$1540, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1540, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1540, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1540, DW_AT_decl_column(0x28)
$C$DW$1541	.dwtag  DW_TAG_member
	.dwattr $C$DW$1541, DW_AT_type(*$C$DW$T$419)
	.dwattr $C$DW$1541, DW_AT_name("resetNotifyId")
	.dwattr $C$DW$1541, DW_AT_TI_symbol_name("resetNotifyId")
	.dwattr $C$DW$1541, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1541, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1541, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1541, DW_AT_decl_column(0x28)
$C$DW$1542	.dwtag  DW_TAG_member
	.dwattr $C$DW$1542, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1542, DW_AT_name("obj")
	.dwattr $C$DW$1542, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1542, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1542, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1542, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1542, DW_AT_decl_column(0x28)
	.dwendtag $C$DW$T$420

	.dwattr $C$DW$T$420, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$420, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$420, DW_AT_decl_column(0x08)
$C$DW$T$346	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$420)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x23)
$C$DW$T$347	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$T$347, DW_AT_address_class(0x20)
$C$DW$T$348	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Handle")
	.dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x1a)
$C$DW$T$349	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$T$349, DW_AT_address_class(0x20)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$1095	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$1095, DW_AT_address_class(0x20)
$C$DW$T$1096	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$1095)
	.dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1096, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1096, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$1096, DW_AT_decl_column(0x23)

$C$DW$T$421	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$421, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$421, DW_AT_byte_size(0x14)
$C$DW$1543	.dwtag  DW_TAG_member
	.dwattr $C$DW$1543, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1543, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1543, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1543, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1543, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1543, DW_AT_decl_column(0x0a)
$C$DW$1544	.dwtag  DW_TAG_member
	.dwattr $C$DW$1544, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1544, DW_AT_name("tableHeap")
	.dwattr $C$DW$1544, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1544, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1544, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1544, DW_AT_decl_column(0x0a)
$C$DW$1545	.dwtag  DW_TAG_member
	.dwattr $C$DW$1545, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1545, DW_AT_name("checkExisting")
	.dwattr $C$DW$1545, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$1545, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1545, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1545, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1545, DW_AT_decl_column(0x0a)
$C$DW$1546	.dwtag  DW_TAG_member
	.dwattr $C$DW$1546, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1546, DW_AT_name("maxValueLen")
	.dwattr $C$DW$1546, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$1546, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1546, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1546, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1546, DW_AT_decl_column(0x0a)
$C$DW$1547	.dwtag  DW_TAG_member
	.dwattr $C$DW$1547, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1547, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1547, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1547, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1547, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1547, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1547, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$421

	.dwattr $C$DW$T$421, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$421, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$421, DW_AT_decl_column(0x10)
$C$DW$T$1097	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$421)
	.dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1097, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1097, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)

$C$DW$T$426	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$426, DW_AT_name("RingIOShm_Attr_tag")
	.dwattr $C$DW$T$426, DW_AT_byte_size(0x10)
$C$DW$1548	.dwtag  DW_TAG_member
	.dwattr $C$DW$1548, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1548, DW_AT_name("offset")
	.dwattr $C$DW$1548, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1548, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1548, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1548, DW_AT_decl_column(0x0f)
$C$DW$1549	.dwtag  DW_TAG_member
	.dwattr $C$DW$1549, DW_AT_type(*$C$DW$T$425)
	.dwattr $C$DW$1549, DW_AT_name("prevoffset")
	.dwattr $C$DW$1549, DW_AT_TI_symbol_name("prevoffset")
	.dwattr $C$DW$1549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1549, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1549, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1549, DW_AT_decl_column(0x0f)
$C$DW$1550	.dwtag  DW_TAG_member
	.dwattr $C$DW$1550, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1550, DW_AT_name("type")
	.dwattr $C$DW$1550, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1550, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1550, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1550, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$1550, DW_AT_decl_column(0x0f)
$C$DW$1551	.dwtag  DW_TAG_member
	.dwattr $C$DW$1551, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1551, DW_AT_name("size")
	.dwattr $C$DW$1551, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1551, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1551, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1551, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$1551, DW_AT_decl_column(0x0f)
$C$DW$1552	.dwtag  DW_TAG_member
	.dwattr $C$DW$1552, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1552, DW_AT_name("param")
	.dwattr $C$DW$1552, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$1552, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1552, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1552, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$1552, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$426

	.dwattr $C$DW$T$426, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$426, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$426, DW_AT_decl_column(0x10)
$C$DW$T$1098	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Attr")
	.dwattr $C$DW$T$1098, DW_AT_type(*$C$DW$T$426)
	.dwattr $C$DW$T$1098, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1098, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$1098, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$1098, DW_AT_decl_column(0x03)
$C$DW$T$1099	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1099, DW_AT_type(*$C$DW$T$1098)
	.dwattr $C$DW$T$1099, DW_AT_address_class(0x20)

$C$DW$T$431	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$431, DW_AT_name("RingIOShm_Client_tag")
	.dwattr $C$DW$T$431, DW_AT_byte_size(0x40)
$C$DW$1553	.dwtag  DW_TAG_member
	.dwattr $C$DW$1553, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1553, DW_AT_name("pDataStart")
	.dwattr $C$DW$1553, DW_AT_TI_symbol_name("pDataStart")
	.dwattr $C$DW$1553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1553, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1553, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1553, DW_AT_decl_column(0x1c)
$C$DW$1554	.dwtag  DW_TAG_member
	.dwattr $C$DW$1554, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1554, DW_AT_name("pAttrStart")
	.dwattr $C$DW$1554, DW_AT_TI_symbol_name("pAttrStart")
	.dwattr $C$DW$1554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1554, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1554, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1554, DW_AT_decl_column(0x1c)
$C$DW$1555	.dwtag  DW_TAG_member
	.dwattr $C$DW$1555, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1555, DW_AT_name("acqStart")
	.dwattr $C$DW$1555, DW_AT_TI_symbol_name("acqStart")
	.dwattr $C$DW$1555, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1555, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1555, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1555, DW_AT_decl_column(0x1c)
$C$DW$1556	.dwtag  DW_TAG_member
	.dwattr $C$DW$1556, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1556, DW_AT_name("acqSize")
	.dwattr $C$DW$1556, DW_AT_TI_symbol_name("acqSize")
	.dwattr $C$DW$1556, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1556, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1556, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1556, DW_AT_decl_column(0x1c)
$C$DW$1557	.dwtag  DW_TAG_member
	.dwattr $C$DW$1557, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1557, DW_AT_name("acqAttrStart")
	.dwattr $C$DW$1557, DW_AT_TI_symbol_name("acqAttrStart")
	.dwattr $C$DW$1557, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1557, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1557, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1557, DW_AT_decl_column(0x1c)
$C$DW$1558	.dwtag  DW_TAG_member
	.dwattr $C$DW$1558, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1558, DW_AT_name("acqAttrSize")
	.dwattr $C$DW$1558, DW_AT_TI_symbol_name("acqAttrSize")
	.dwattr $C$DW$1558, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1558, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1558, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1558, DW_AT_decl_column(0x1c)
$C$DW$1559	.dwtag  DW_TAG_member
	.dwattr $C$DW$1559, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1559, DW_AT_name("notifyType")
	.dwattr $C$DW$1559, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1559, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1559, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1559, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$1559, DW_AT_decl_column(0x1c)
$C$DW$1560	.dwtag  DW_TAG_member
	.dwattr $C$DW$1560, DW_AT_type(*$C$DW$T$427)
	.dwattr $C$DW$1560, DW_AT_name("notifyParam")
	.dwattr $C$DW$1560, DW_AT_TI_symbol_name("notifyParam")
	.dwattr $C$DW$1560, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1560, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1560, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$1560, DW_AT_decl_column(0x1c)
$C$DW$1561	.dwtag  DW_TAG_member
	.dwattr $C$DW$1561, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1561, DW_AT_name("notifyWaterMark")
	.dwattr $C$DW$1561, DW_AT_TI_symbol_name("notifyWaterMark")
	.dwattr $C$DW$1561, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1561, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1561, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$1561, DW_AT_decl_column(0x1c)
$C$DW$1562	.dwtag  DW_TAG_member
	.dwattr $C$DW$1562, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1562, DW_AT_name("flags")
	.dwattr $C$DW$1562, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1562, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1562, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1562, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1562, DW_AT_decl_column(0x1c)
$C$DW$1563	.dwtag  DW_TAG_member
	.dwattr $C$DW$1563, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1563, DW_AT_name("isValid")
	.dwattr $C$DW$1563, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1563, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1563, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1563, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1563, DW_AT_decl_column(0x1c)
$C$DW$1564	.dwtag  DW_TAG_member
	.dwattr $C$DW$1564, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1564, DW_AT_name("refCount")
	.dwattr $C$DW$1564, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1564, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1564, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1564, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$1564, DW_AT_decl_column(0x1c)
$C$DW$1565	.dwtag  DW_TAG_member
	.dwattr $C$DW$1565, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1565, DW_AT_name("notifyId")
	.dwattr $C$DW$1565, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1565, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1565, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1565, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1565, DW_AT_decl_column(0x1c)
$C$DW$1566	.dwtag  DW_TAG_member
	.dwattr $C$DW$1566, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1566, DW_AT_name("isRegistered")
	.dwattr $C$DW$1566, DW_AT_TI_symbol_name("isRegistered")
	.dwattr $C$DW$1566, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1566, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1566, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1566, DW_AT_decl_column(0x1c)
$C$DW$1567	.dwtag  DW_TAG_member
	.dwattr $C$DW$1567, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$1567, DW_AT_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1567, DW_AT_TI_symbol_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1567, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1567, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1567, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1567, DW_AT_decl_column(0x1c)
$C$DW$1568	.dwtag  DW_TAG_member
	.dwattr $C$DW$1568, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1568, DW_AT_name("clientNotifyMgrGate")
	.dwattr $C$DW$1568, DW_AT_TI_symbol_name("clientNotifyMgrGate")
	.dwattr $C$DW$1568, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1568, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1568, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1568, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$431

	.dwattr $C$DW$T$431, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$431, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$431, DW_AT_decl_column(0x10)
$C$DW$T$443	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Client")
	.dwattr $C$DW$T$443, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$T$443, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$443, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$443, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$443, DW_AT_decl_column(0x03)
$C$DW$T$1104	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1104, DW_AT_type(*$C$DW$T$443)
$C$DW$T$1105	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1105, DW_AT_type(*$C$DW$T$1104)
	.dwattr $C$DW$T$1105, DW_AT_address_class(0x20)
$C$DW$T$444	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$444, DW_AT_type(*$C$DW$T$443)
	.dwattr $C$DW$T$444, DW_AT_address_class(0x20)
$C$DW$T$445	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ClientHandle")
	.dwattr $C$DW$T$445, DW_AT_type(*$C$DW$T$444)
	.dwattr $C$DW$T$445, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$445, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$445, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$445, DW_AT_decl_column(0x22)

$C$DW$T$432	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$432, DW_AT_name("RingIOShm_Config_Tag")
	.dwattr $C$DW$T$432, DW_AT_byte_size(0x04)
$C$DW$1569	.dwtag  DW_TAG_member
	.dwattr $C$DW$1569, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1569, DW_AT_name("notifyEventNo")
	.dwattr $C$DW$1569, DW_AT_TI_symbol_name("notifyEventNo")
	.dwattr $C$DW$1569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1569, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1569, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$1569, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$432

	.dwattr $C$DW$T$432, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$432, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$432, DW_AT_decl_column(0x10)
$C$DW$T$1106	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Config")
	.dwattr $C$DW$T$1106, DW_AT_type(*$C$DW$T$432)
	.dwattr $C$DW$T$1106, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1106, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$1106, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$1106, DW_AT_decl_column(0x03)
$C$DW$T$1107	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1107, DW_AT_type(*$C$DW$T$1106)
$C$DW$T$1108	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1108, DW_AT_type(*$C$DW$T$1107)
	.dwattr $C$DW$T$1108, DW_AT_address_class(0x20)
$C$DW$T$1109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1109, DW_AT_type(*$C$DW$T$1106)
	.dwattr $C$DW$T$1109, DW_AT_address_class(0x20)

$C$DW$T$437	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$437, DW_AT_name("RingIOShm_ControlStruct_tag")
	.dwattr $C$DW$T$437, DW_AT_byte_size(0x44)
$C$DW$1570	.dwtag  DW_TAG_member
	.dwattr $C$DW$1570, DW_AT_type(*$C$DW$T$433)
	.dwattr $C$DW$1570, DW_AT_name("interfaceAttrs")
	.dwattr $C$DW$1570, DW_AT_TI_symbol_name("interfaceAttrs")
	.dwattr $C$DW$1570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1570, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1570, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1570, DW_AT_decl_column(0x1d)
$C$DW$1571	.dwtag  DW_TAG_member
	.dwattr $C$DW$1571, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1571, DW_AT_name("srPtrBufStart")
	.dwattr $C$DW$1571, DW_AT_TI_symbol_name("srPtrBufStart")
	.dwattr $C$DW$1571, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1571, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1571, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1571, DW_AT_decl_column(0x1c)
$C$DW$1572	.dwtag  DW_TAG_member
	.dwattr $C$DW$1572, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1572, DW_AT_name("srPtrBufEnd")
	.dwattr $C$DW$1572, DW_AT_TI_symbol_name("srPtrBufEnd")
	.dwattr $C$DW$1572, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1572, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1572, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1572, DW_AT_decl_column(0x1c)
$C$DW$1573	.dwtag  DW_TAG_member
	.dwattr $C$DW$1573, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1573, DW_AT_name("curBufEnd")
	.dwattr $C$DW$1573, DW_AT_TI_symbol_name("curBufEnd")
	.dwattr $C$DW$1573, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1573, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1573, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1573, DW_AT_decl_column(0x1b)
$C$DW$1574	.dwtag  DW_TAG_member
	.dwattr $C$DW$1574, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1574, DW_AT_name("dataBufEnd")
	.dwattr $C$DW$1574, DW_AT_TI_symbol_name("dataBufEnd")
	.dwattr $C$DW$1574, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1574, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1574, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$1574, DW_AT_decl_column(0x1b)
$C$DW$1575	.dwtag  DW_TAG_member
	.dwattr $C$DW$1575, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1575, DW_AT_name("dataSharedAddrSize")
	.dwattr $C$DW$1575, DW_AT_TI_symbol_name("dataSharedAddrSize")
	.dwattr $C$DW$1575, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1575, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1575, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$1575, DW_AT_decl_column(0x1b)
$C$DW$1576	.dwtag  DW_TAG_member
	.dwattr $C$DW$1576, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1576, DW_AT_name("footBufSize")
	.dwattr $C$DW$1576, DW_AT_TI_symbol_name("footBufSize")
	.dwattr $C$DW$1576, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1576, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1576, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1576, DW_AT_decl_column(0x1b)
$C$DW$1577	.dwtag  DW_TAG_member
	.dwattr $C$DW$1577, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1577, DW_AT_name("validSize")
	.dwattr $C$DW$1577, DW_AT_TI_symbol_name("validSize")
	.dwattr $C$DW$1577, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1577, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1577, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1577, DW_AT_decl_column(0x1b)
$C$DW$1578	.dwtag  DW_TAG_member
	.dwattr $C$DW$1578, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1578, DW_AT_name("emptySize")
	.dwattr $C$DW$1578, DW_AT_TI_symbol_name("emptySize")
	.dwattr $C$DW$1578, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1578, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1578, DW_AT_decl_line(0x105)
	.dwattr $C$DW$1578, DW_AT_decl_column(0x1b)
$C$DW$1579	.dwtag  DW_TAG_member
	.dwattr $C$DW$1579, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1579, DW_AT_name("srPtrAttrBufStart")
	.dwattr $C$DW$1579, DW_AT_TI_symbol_name("srPtrAttrBufStart")
	.dwattr $C$DW$1579, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1579, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1579, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1579, DW_AT_decl_column(0x1b)
$C$DW$1580	.dwtag  DW_TAG_member
	.dwattr $C$DW$1580, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1580, DW_AT_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1580, DW_AT_TI_symbol_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1580, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1580, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1580, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1580, DW_AT_decl_column(0x1b)
$C$DW$1581	.dwtag  DW_TAG_member
	.dwattr $C$DW$1581, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1581, DW_AT_name("curAttrBufEnd")
	.dwattr $C$DW$1581, DW_AT_TI_symbol_name("curAttrBufEnd")
	.dwattr $C$DW$1581, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1581, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1581, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1581, DW_AT_decl_column(0x1b)
$C$DW$1582	.dwtag  DW_TAG_member
	.dwattr $C$DW$1582, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1582, DW_AT_name("validAttrSize")
	.dwattr $C$DW$1582, DW_AT_TI_symbol_name("validAttrSize")
	.dwattr $C$DW$1582, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1582, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1582, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1582, DW_AT_decl_column(0x1b)
$C$DW$1583	.dwtag  DW_TAG_member
	.dwattr $C$DW$1583, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1583, DW_AT_name("emptyAttrSize")
	.dwattr $C$DW$1583, DW_AT_TI_symbol_name("emptyAttrSize")
	.dwattr $C$DW$1583, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1583, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1583, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1583, DW_AT_decl_column(0x1b)
$C$DW$1584	.dwtag  DW_TAG_member
	.dwattr $C$DW$1584, DW_AT_type(*$C$DW$T$425)
	.dwattr $C$DW$1584, DW_AT_name("prevAttrOffset")
	.dwattr $C$DW$1584, DW_AT_TI_symbol_name("prevAttrOffset")
	.dwattr $C$DW$1584, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1584, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1584, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1584, DW_AT_decl_column(0x1b)
$C$DW$1585	.dwtag  DW_TAG_member
	.dwattr $C$DW$1585, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1585, DW_AT_name("procId")
	.dwattr $C$DW$1585, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1585, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1585, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1585, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1585, DW_AT_decl_column(0x1b)
$C$DW$1586	.dwtag  DW_TAG_member
	.dwattr $C$DW$1586, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1586, DW_AT_name("gateMPSharedAddr")
	.dwattr $C$DW$1586, DW_AT_TI_symbol_name("gateMPSharedAddr")
	.dwattr $C$DW$1586, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1586, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1586, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1586, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$437

	.dwattr $C$DW$T$437, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$437, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$437, DW_AT_decl_column(0x10)
$C$DW$T$440	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ControlStruct")
	.dwattr $C$DW$T$440, DW_AT_type(*$C$DW$T$437)
	.dwattr $C$DW$T$440, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$440, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$440, DW_AT_decl_line(0x120)
	.dwattr $C$DW$T$440, DW_AT_decl_column(0x03)
$C$DW$T$1110	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1110, DW_AT_type(*$C$DW$T$440)
$C$DW$T$1111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1111, DW_AT_type(*$C$DW$T$1110)
