;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:18 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../RingIO.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$952, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$952, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$952, DW_AT_decl_column(0x0e)
$C$DW$T$953	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$953, DW_AT_type(*$C$DW$T$952)
	.dwattr $C$DW$T$953, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$953, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$953, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$953, DW_AT_decl_column(0x03)

$C$DW$T$954	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$954, DW_AT_byte_size(0x01)
$C$DW$1107	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1107, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1107, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1107, DW_AT_decl_column(0x05)
$C$DW$1108	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1108, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1108, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1108, DW_AT_decl_column(0x05)
$C$DW$1109	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1109, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1109, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1109, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$954

	.dwattr $C$DW$T$954, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$954, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$954, DW_AT_decl_column(0x0e)
$C$DW$T$955	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$955, DW_AT_type(*$C$DW$T$954)
	.dwattr $C$DW$T$955, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$955, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$955, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$955, DW_AT_decl_column(0x03)

$C$DW$T$956	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$956, DW_AT_byte_size(0x02)
$C$DW$1110	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1110, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1110, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1110, DW_AT_decl_column(0x05)
$C$DW$1111	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1111, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1111, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1111, DW_AT_decl_column(0x05)
$C$DW$1112	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1112, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1112, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1112, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$956

	.dwattr $C$DW$T$956, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$956, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$956, DW_AT_decl_column(0x0e)
$C$DW$T$957	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$957, DW_AT_type(*$C$DW$T$956)
	.dwattr $C$DW$T$957, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$957, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$957, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$957, DW_AT_decl_column(0x03)

$C$DW$T$958	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$958, DW_AT_byte_size(0x01)
$C$DW$1113	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1113, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1113, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1113, DW_AT_decl_column(0x05)
$C$DW$1114	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1114, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1114, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1114, DW_AT_decl_column(0x05)
$C$DW$1115	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1115, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1115, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1115, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$958

	.dwattr $C$DW$T$958, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$958, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$958, DW_AT_decl_column(0x0e)
$C$DW$T$959	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$959, DW_AT_type(*$C$DW$T$958)
	.dwattr $C$DW$T$959, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$959, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$959, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$959, DW_AT_decl_column(0x03)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1116, DW_AT_name("length")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1116, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1116, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1116, DW_AT_decl_column(0x16)
$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1117, DW_AT_name("elem")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1117, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1117, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1117, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$960	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$960, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$960, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$960, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$960, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$960, DW_AT_decl_column(0x43)
$C$DW$T$961	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$961, DW_AT_type(*$C$DW$T$960)
	.dwattr $C$DW$T$961, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$961, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$961, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$961, DW_AT_decl_column(0x30)
$C$DW$T$962	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$962, DW_AT_type(*$C$DW$T$961)
	.dwattr $C$DW$T$962, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$962, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$962, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$962, DW_AT_decl_column(0x2c)

$C$DW$T$305	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$305, DW_AT_byte_size(0x08)
$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1118, DW_AT_name("length")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1118, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1118, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1118, DW_AT_decl_column(0x16)
$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1119, DW_AT_name("elem")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1119, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1119, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1119, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$305

	.dwattr $C$DW$T$305, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x10)
$C$DW$T$963	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$963, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$T$963, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$963, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$963, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$963, DW_AT_decl_column(0x43)
$C$DW$T$964	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$964, DW_AT_type(*$C$DW$T$963)
	.dwattr $C$DW$T$964, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$964, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$964, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$964, DW_AT_decl_column(0x2f)
$C$DW$T$965	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$965, DW_AT_type(*$C$DW$T$964)
	.dwattr $C$DW$T$965, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$965, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$965, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$965, DW_AT_decl_column(0x2b)

$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x08)
$C$DW$1120	.dwtag  DW_TAG_member
	.dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1120, DW_AT_name("length")
	.dwattr $C$DW$1120, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1120, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1120, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1120, DW_AT_decl_column(0x16)
$C$DW$1121	.dwtag  DW_TAG_member
	.dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$1121, DW_AT_name("elem")
	.dwattr $C$DW$1121, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1121, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1121, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1121, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$308

	.dwattr $C$DW$T$308, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$966	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$966, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$966, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$966, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$966, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$966, DW_AT_decl_column(0x42)
$C$DW$T$967	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$967, DW_AT_type(*$C$DW$T$966)
	.dwattr $C$DW$T$967, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$967, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$967, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$967, DW_AT_decl_column(0x2b)
$C$DW$T$968	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$968, DW_AT_type(*$C$DW$T$967)
	.dwattr $C$DW$T$968, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$968, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$968, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$968, DW_AT_decl_column(0x27)

$C$DW$T$311	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$311, DW_AT_byte_size(0x08)
$C$DW$1122	.dwtag  DW_TAG_member
	.dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1122, DW_AT_name("length")
	.dwattr $C$DW$1122, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1122, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1122, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1122, DW_AT_decl_column(0x16)
$C$DW$1123	.dwtag  DW_TAG_member
	.dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$1123, DW_AT_name("elem")
	.dwattr $C$DW$1123, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1123, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1123, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1123, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$311

	.dwattr $C$DW$T$311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x10)
$C$DW$T$969	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$969, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$T$969, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$969, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$969, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$969, DW_AT_decl_column(0x43)
$C$DW$T$970	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$970, DW_AT_type(*$C$DW$T$969)
	.dwattr $C$DW$T$970, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$970, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$970, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$970, DW_AT_decl_column(0x2c)
$C$DW$T$971	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$971, DW_AT_type(*$C$DW$T$970)
	.dwattr $C$DW$T$971, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$971, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$971, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$971, DW_AT_decl_column(0x28)

$C$DW$T$315	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$315, DW_AT_byte_size(0x04)
$C$DW$1124	.dwtag  DW_TAG_member
	.dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1124, DW_AT_name("f")
	.dwattr $C$DW$1124, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1124, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1124, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1124, DW_AT_decl_column(0x0f)
$C$DW$1125	.dwtag  DW_TAG_member
	.dwattr $C$DW$1125, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1125, DW_AT_name("a")
	.dwattr $C$DW$1125, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1125, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1125, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1125, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$315

	.dwattr $C$DW$T$315, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x0f)
$C$DW$T$972	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$972, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$T$972, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$972, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$972, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$972, DW_AT_decl_column(0x03)

$C$DW$T$409	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$409, DW_AT_name("IRingIO_Object_tag")
	.dwattr $C$DW$T$409, DW_AT_byte_size(0x90)
$C$DW$1126	.dwtag  DW_TAG_member
	.dwattr $C$DW$1126, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$1126, DW_AT_name("listElem")
	.dwattr $C$DW$1126, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1126, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1126, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1126, DW_AT_decl_column(0x27)
$C$DW$1127	.dwtag  DW_TAG_member
	.dwattr $C$DW$1127, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1127, DW_AT_name("ownerProcId")
	.dwattr $C$DW$1127, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1127, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1127, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1127, DW_AT_decl_column(0x27)
$C$DW$1128	.dwtag  DW_TAG_member
	.dwattr $C$DW$1128, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1128, DW_AT_name("name")
	.dwattr $C$DW$1128, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1128, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1128, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1128, DW_AT_decl_column(0x27)
$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1129, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$1129, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1129, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1129, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1129, DW_AT_decl_column(0x27)
$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1130, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$1130, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1130, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1130, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1130, DW_AT_decl_column(0x27)
$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1131, DW_AT_name("remoteProcId")
	.dwattr $C$DW$1131, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$1131, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1131, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1131, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1131, DW_AT_decl_column(0x27)
$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1132, DW_AT_name("top")
	.dwattr $C$DW$1132, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1132, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1132, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1132, DW_AT_decl_column(0x27)
$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1133, DW_AT_name("nsKey")
	.dwattr $C$DW$1133, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1133, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1133, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$1133, DW_AT_decl_column(0x27)
$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1134, DW_AT_name("created")
	.dwattr $C$DW$1134, DW_AT_TI_symbol_name("created")
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1134, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1134, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1134, DW_AT_decl_column(0x27)
$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1135, DW_AT_name("deleteFn")
	.dwattr $C$DW$1135, DW_AT_TI_symbol_name("deleteFn")
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1135, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1135, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1135, DW_AT_decl_column(0x27)
$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1136, DW_AT_name("close")
	.dwattr $C$DW$1136, DW_AT_TI_symbol_name("close")
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1136, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1136, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1136, DW_AT_decl_column(0x27)
$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1137, DW_AT_name("registerNotifier")
	.dwattr $C$DW$1137, DW_AT_TI_symbol_name("registerNotifier")
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1137, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1137, DW_AT_decl_line(0x104)
	.dwattr $C$DW$1137, DW_AT_decl_column(0x27)
$C$DW$1138	.dwtag  DW_TAG_member
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$1138, DW_AT_name("unregisterNotifier")
	.dwattr $C$DW$1138, DW_AT_TI_symbol_name("unregisterNotifier")
	.dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1138, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1138, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1138, DW_AT_decl_column(0x27)
$C$DW$1139	.dwtag  DW_TAG_member
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$1139, DW_AT_name("setWaterMark")
	.dwattr $C$DW$1139, DW_AT_TI_symbol_name("setWaterMark")
	.dwattr $C$DW$1139, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1139, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1139, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1139, DW_AT_decl_column(0x27)
$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1140, DW_AT_name("setNotifyType")
	.dwattr $C$DW$1140, DW_AT_TI_symbol_name("setNotifyType")
	.dwattr $C$DW$1140, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1140, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1140, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1140, DW_AT_decl_column(0x27)
$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$1141, DW_AT_name("acquire")
	.dwattr $C$DW$1141, DW_AT_TI_symbol_name("acquire")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1141, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1141, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1141, DW_AT_decl_column(0x27)
$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$1142, DW_AT_name("release")
	.dwattr $C$DW$1142, DW_AT_TI_symbol_name("release")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1142, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1142, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1142, DW_AT_decl_column(0x27)
$C$DW$1143	.dwtag  DW_TAG_member
	.dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1143, DW_AT_name("cancel")
	.dwattr $C$DW$1143, DW_AT_TI_symbol_name("cancel")
	.dwattr $C$DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1143, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1143, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1143, DW_AT_decl_column(0x27)
$C$DW$1144	.dwtag  DW_TAG_member
	.dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1144, DW_AT_name("getvAttribute")
	.dwattr $C$DW$1144, DW_AT_TI_symbol_name("getvAttribute")
	.dwattr $C$DW$1144, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1144, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1144, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1144, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1144, DW_AT_decl_column(0x27)
$C$DW$1145	.dwtag  DW_TAG_member
	.dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$1145, DW_AT_name("setvAttribute")
	.dwattr $C$DW$1145, DW_AT_TI_symbol_name("setvAttribute")
	.dwattr $C$DW$1145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1145, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1145, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1145, DW_AT_decl_column(0x27)
$C$DW$1146	.dwtag  DW_TAG_member
	.dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$1146, DW_AT_name("getAttribute")
	.dwattr $C$DW$1146, DW_AT_TI_symbol_name("getAttribute")
	.dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1146, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1146, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1146, DW_AT_decl_column(0x27)
$C$DW$1147	.dwtag  DW_TAG_member
	.dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$383)
	.dwattr $C$DW$1147, DW_AT_name("setAttribute")
	.dwattr $C$DW$1147, DW_AT_TI_symbol_name("setAttribute")
	.dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1147, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1147, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1147, DW_AT_decl_column(0x27)
$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$1148, DW_AT_name("flush")
	.dwattr $C$DW$1148, DW_AT_TI_symbol_name("flush")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1148, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1148, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1148, DW_AT_decl_column(0x27)
$C$DW$1149	.dwtag  DW_TAG_member
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$389)
	.dwattr $C$DW$1149, DW_AT_name("notify")
	.dwattr $C$DW$1149, DW_AT_TI_symbol_name("notify")
	.dwattr $C$DW$1149, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1149, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1149, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1149, DW_AT_decl_column(0x2b)
$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$1150, DW_AT_name("getValidSize")
	.dwattr $C$DW$1150, DW_AT_TI_symbol_name("getValidSize")
	.dwattr $C$DW$1150, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1150, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1150, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1150, DW_AT_decl_column(0x27)
$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$395)
	.dwattr $C$DW$1151, DW_AT_name("getEmptySize")
	.dwattr $C$DW$1151, DW_AT_TI_symbol_name("getEmptySize")
	.dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1151, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x27)
$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$396)
	.dwattr $C$DW$1152, DW_AT_name("getValidAttrSize")
	.dwattr $C$DW$1152, DW_AT_TI_symbol_name("getValidAttrSize")
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1152, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x27)
$C$DW$1153	.dwtag  DW_TAG_member
	.dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$1153, DW_AT_name("getEmptyAttrSize")
	.dwattr $C$DW$1153, DW_AT_TI_symbol_name("getEmptyAttrSize")
	.dwattr $C$DW$1153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1153, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1153, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1153, DW_AT_decl_column(0x27)
$C$DW$1154	.dwtag  DW_TAG_member
	.dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$398)
	.dwattr $C$DW$1154, DW_AT_name("getAcquiredOffset")
	.dwattr $C$DW$1154, DW_AT_TI_symbol_name("getAcquiredOffset")
	.dwattr $C$DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1154, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x27)
$C$DW$1155	.dwtag  DW_TAG_member
	.dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$399)
	.dwattr $C$DW$1155, DW_AT_name("getAcquiredSize")
	.dwattr $C$DW$1155, DW_AT_TI_symbol_name("getAcquiredSize")
	.dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1155, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x27)
$C$DW$1156	.dwtag  DW_TAG_member
	.dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$1156, DW_AT_name("getWaterMark")
	.dwattr $C$DW$1156, DW_AT_TI_symbol_name("getWaterMark")
	.dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1156, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x27)
$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$403)
	.dwattr $C$DW$1157, DW_AT_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1157, DW_AT_TI_symbol_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x27)
$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$404)
	.dwattr $C$DW$1158, DW_AT_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1158, DW_AT_TI_symbol_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x2a)
$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$1159, DW_AT_name("setNotifyId")
	.dwattr $C$DW$1159, DW_AT_TI_symbol_name("setNotifyId")
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x28)
$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$1160, DW_AT_name("resetNotifyId")
	.dwattr $C$DW$1160, DW_AT_TI_symbol_name("resetNotifyId")
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x28)
$C$DW$1161	.dwtag  DW_TAG_member
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1161, DW_AT_name("obj")
	.dwattr $C$DW$1161, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1161, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1161, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1161, DW_AT_decl_column(0x28)
	.dwendtag $C$DW$T$409

	.dwattr $C$DW$T$409, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$409, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$409, DW_AT_decl_column(0x08)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x23)
$C$DW$T$336	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$336, DW_AT_address_class(0x20)
$C$DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Handle")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x1a)
$C$DW$T$338	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$338, DW_AT_address_class(0x20)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$437	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$437, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$437, DW_AT_address_class(0x20)
$C$DW$T$438	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$438, DW_AT_type(*$C$DW$T$437)
	.dwattr $C$DW$T$438, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$438, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$438, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$438, DW_AT_decl_column(0x23)
$C$DW$T$979	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$979, DW_AT_type(*$C$DW$T$438)
	.dwattr $C$DW$T$979, DW_AT_address_class(0x20)

$C$DW$T$410	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$410, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$410, DW_AT_byte_size(0x14)
$C$DW$1162	.dwtag  DW_TAG_member
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1162, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1162, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1162, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1162, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1162, DW_AT_decl_column(0x0a)
$C$DW$1163	.dwtag  DW_TAG_member
	.dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1163, DW_AT_name("tableHeap")
	.dwattr $C$DW$1163, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1163, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1163, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1163, DW_AT_decl_column(0x0a)
$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1164, DW_AT_name("checkExisting")
	.dwattr $C$DW$1164, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x0a)
$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1165, DW_AT_name("maxValueLen")
	.dwattr $C$DW$1165, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x0a)
$C$DW$1166	.dwtag  DW_TAG_member
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1166, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1166, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1166, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1166, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1166, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$410

	.dwattr $C$DW$T$410, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$410, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$410, DW_AT_decl_column(0x10)
$C$DW$T$974	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$974, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$974, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$974, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$974, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$974, DW_AT_decl_column(0x03)
$C$DW$T$975	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$975, DW_AT_type(*$C$DW$T$974)
$C$DW$T$976	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$976, DW_AT_type(*$C$DW$T$975)
	.dwattr $C$DW$T$976, DW_AT_address_class(0x20)
$C$DW$T$980	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$980, DW_AT_type(*$C$DW$T$974)
	.dwattr $C$DW$T$980, DW_AT_address_class(0x20)

$C$DW$T$428	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$428, DW_AT_name("RingIO_CfgFxns_tag")
	.dwattr $C$DW$T$428, DW_AT_byte_size(0x0c)
$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$416)
	.dwattr $C$DW$1167, DW_AT_name("create")
	.dwattr $C$DW$1167, DW_AT_TI_symbol_name("create")
	.dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x23)
$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$421)
	.dwattr $C$DW$1168, DW_AT_name("sharedMemReq")
	.dwattr $C$DW$1168, DW_AT_TI_symbol_name("sharedMemReq")
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x23)
$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$427)
	.dwattr $C$DW$1169, DW_AT_name("openByAddr")
	.dwattr $C$DW$1169, DW_AT_TI_symbol_name("openByAddr")
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x23)
	.dwendtag $C$DW$T$428

	.dwattr $C$DW$T$428, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x10)
$C$DW$T$981	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_CfgFxns")
	.dwattr $C$DW$T$981, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$981, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$981, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$981, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$981, DW_AT_decl_column(0x03)

$C$DW$T$982	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$982, DW_AT_type(*$C$DW$T$981)
	.dwattr $C$DW$T$982, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$982, DW_AT_byte_size(0x0c)
$C$DW$1170	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1170, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$982


$C$DW$T$429	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$429, DW_AT_name("RingIO_Config_Tag")
	.dwattr $C$DW$T$429, DW_AT_byte_size(0x08)
$C$DW$1171	.dwtag  DW_TAG_member
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1171, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1171, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1171, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x12)
$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1172, DW_AT_name("maxInstances")
	.dwattr $C$DW$1172, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$429

	.dwattr $C$DW$T$429, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$429, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$429, DW_AT_decl_column(0x10)
$C$DW$T$984	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Config")
	.dwattr $C$DW$T$984, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$984, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$984, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$984, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$984, DW_AT_decl_column(0x03)
$C$DW$T$985	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$985, DW_AT_type(*$C$DW$T$984)
$C$DW$T$986	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$986, DW_AT_type(*$C$DW$T$985)
	.dwattr $C$DW$T$986, DW_AT_address_class(0x20)
$C$DW$T$987	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$987, DW_AT_type(*$C$DW$T$984)
	.dwattr $C$DW$T$987, DW_AT_address_class(0x20)

$C$DW$T$988	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$988, DW_AT_name("RingIO_Flags_tag")
	.dwattr $C$DW$T$988, DW_AT_byte_size(0x01)
$C$DW$1173	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_DATABUF_MAINTAINCACHE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1173, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x05)
$C$DW$1174	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NEED_EXACT_SIZE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1174, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$988

	.dwattr $C$DW$T$988, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$988, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$T$988, DW_AT_decl_column(0x0e)
$C$DW$T$989	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Flags")
	.dwattr $C$DW$T$989, DW_AT_type(*$C$DW$T$988)
	.dwattr $C$DW$T$989, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$989, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$989, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$989, DW_AT_decl_column(0x03)

$C$DW$T$432	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$432, DW_AT_name("RingIO_InterfaceAttrs_tag")
	.dwattr $C$DW$T$432, DW_AT_byte_size(0x01)
$C$DW$1175	.dwtag  DW_TAG_member
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$1175, DW_AT_name("type")
	.dwattr $C$DW$1175, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1175, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$432

	.dwattr $C$DW$T$432, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$432, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$432, DW_AT_decl_column(0x10)
$C$DW$T$990	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_InterfaceAttrs")
	.dwattr $C$DW$T$990, DW_AT_type(*$C$DW$T$432)
	.dwattr $C$DW$T$990, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$990, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$990, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$990, DW_AT_decl_column(0x03)
$C$DW$T$991	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$991, DW_AT_type(*$C$DW$T$990)
	.dwattr $C$DW$T$991, DW_AT_address_class(0x20)

$C$DW$T$439	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$439, DW_AT_name("RingIO_ModuleObject")
	.dwattr $C$DW$T$439, DW_AT_byte_size(0x1c)
$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1176, DW_AT_name("refCount")
	.dwattr $C$DW$1176, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x19)
$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$435)
	.dwattr $C$DW$1177, DW_AT_name("createObjList")
	.dwattr $C$DW$1177, DW_AT_TI_symbol_name("createObjList")
	.dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x79)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x19)
$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$435)
	.dwattr $C$DW$1178, DW_AT_name("openObjList")
	.dwattr $C$DW$1178, DW_AT_TI_symbol_name("openObjList")
	.dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x19)
$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1179, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$1179, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x19)
$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1180, DW_AT_name("localRingIOHandle")
	.dwattr $C$DW$1180, DW_AT_TI_symbol_name("localRingIOHandle")
	.dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x19)
$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$438)
	.dwattr $C$DW$1181, DW_AT_name("nsHandle")
	.dwattr $C$DW$1181, DW_AT_TI_symbol_name("nsHandle")
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$439

	.dwattr $C$DW$T$439, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$T$439, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$439, DW_AT_decl_column(0x10)
$C$DW$T$992	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_ModuleObject")
	.dwattr $C$DW$T$992, DW_AT_type(*$C$DW$T$439)
	.dwattr $C$DW$T$992, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$992, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$T$992, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$992, DW_AT_decl_column(0x03)
$C$DW$T$993	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$993, DW_AT_type(*$C$DW$T$992)
	.dwattr $C$DW$T$993, DW_AT_address_class(0x20)

$C$DW$T$440	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$440, DW_AT_name("RingIO_NameServerEntry_tag")
	.dwattr $C$DW$T$440, DW_AT_byte_size(0x08)
$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1182, DW_AT_name("procId")
	.dwattr $C$DW$1182, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x1c)
$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1183, DW_AT_name("ctrlSharedSrPtr")
	.dwattr $C$DW$1183, DW_AT_TI_symbol_name("ctrlSharedSrPtr")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$440

	.dwattr $C$DW$T$440, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$440, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$440, DW_AT_decl_column(0x10)
$C$DW$T$994	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NameServerEntry")
	.dwattr $C$DW$T$994, DW_AT_type(*$C$DW$T$440)
	.dwattr $C$DW$T$994, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$994, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$994, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$T$994, DW_AT_decl_column(0x03)

$C$DW$T$343	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$343, DW_AT_name("RingIO_NotifyType_Tag")
	.dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
$C$DW$1184	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1184, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x05)
$C$DW$1185	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1185, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x05)
$C$DW$1186	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1186, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x05)
$C$DW$1187	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1187, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x05)
$C$DW$1188	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1188, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$343

	.dwattr $C$DW$T$343, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x0e)
$C$DW$T$344	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NotifyType")
	.dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$344, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$344, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$344, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("RingIO_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$345	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$345, DW_AT_address_class(0x20)
$C$DW$T$346	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Handle")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x23)
$C$DW$T$413	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$T$413, DW_AT_address_class(0x20)

$C$DW$T$442	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$442, DW_AT_name("RingIO_OpenMode_Tag")
	.dwattr $C$DW$T$442, DW_AT_byte_size(0x01)
$C$DW$1189	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_READER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1189, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x05)
$C$DW$1190	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1190, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$442

	.dwattr $C$DW$T$442, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$442, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$442, DW_AT_decl_column(0x0e)
$C$DW$T$443	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_OpenMode")
	.dwattr $C$DW$T$443, DW_AT_type(*$C$DW$T$442)
	.dwattr $C$DW$T$443, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$443, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$443, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$443, DW_AT_decl_column(0x03)

$C$DW$T$441	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$441, DW_AT_name("RingIO_Params_Tag")
	.dwattr $C$DW$T$441, DW_AT_byte_size(0x08)
$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1191, DW_AT_name("name")
	.dwattr $C$DW$1191, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x13)
$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$1192, DW_AT_name("interfaceType")
	.dwattr $C$DW$1192, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$441

	.dwattr $C$DW$T$441, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$441, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$441, DW_AT_decl_column(0x10)
$C$DW$T$436	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Params")
	.dwattr $C$DW$T$436, DW_AT_type(*$C$DW$T$441)
	.dwattr $C$DW$T$436, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$436, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$436, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$436, DW_AT_decl_column(0x03)
$C$DW$T$997	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$997, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$T$997, DW_AT_address_class(0x20)

$C$DW$T$430	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$430, DW_AT_name("RingIO_Type_Tag")
	.dwattr $C$DW$T$430, DW_AT_byte_size(0x01)
$C$DW$1193	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_Type_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1193, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x182)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$430

	.dwattr $C$DW$T$430, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$430, DW_AT_decl_line(0x181)
	.dwattr $C$DW$T$430, DW_AT_decl_column(0x0e)
$C$DW$T$431	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Type")
	.dwattr $C$DW$T$431, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$T$431, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$431, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$431, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$431, DW_AT_decl_column(0x03)

$C$DW$T$444	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$444, DW_AT_name("RingIO_openParams_Tag")
	.dwattr $C$DW$T$444, DW_AT_byte_size(0x08)
$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1194, DW_AT_name("flags")
	.dwattr $C$DW$1194, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x11)
$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$443)
	.dwattr $C$DW$1195, DW_AT_name("openMode")
	.dwattr $C$DW$1195, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$444

	.dwattr $C$DW$T$444, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$444, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$444, DW_AT_decl_column(0x10)
$C$DW$T$422	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_openParams")
	.dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$444)
	.dwattr $C$DW$T$422, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$422, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$422, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$422, DW_AT_decl_column(0x03)
$C$DW$T$423	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$423, DW_AT_type(*$C$DW$T$422)
$C$DW$T$424	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$424, DW_AT_type(*$C$DW$T$423)
	.dwattr $C$DW$T$424, DW_AT_address_class(0x20)

$C$DW$T$445	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$445, DW_AT_name("RingIO_sharedMemReqDetails_tag")
	.dwattr $C$DW$T$445, DW_AT_byte_size(0x0c)
$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1196, DW_AT_name("ctrlSharedMemReq")
	.dwattr $C$DW$1196, DW_AT_TI_symbol_name("ctrlSharedMemReq")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x14)
$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1197, DW_AT_name("dataSharedMemReq")
	.dwattr $C$DW$1197, DW_AT_TI_symbol_name("dataSharedMemReq")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x14)
$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1198, DW_AT_name("attrSharedMemReq")
	.dwattr $C$DW$1198, DW_AT_TI_symbol_name("attrSharedMemReq")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$445

	.dwattr $C$DW$T$445, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$445, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$T$445, DW_AT_decl_column(0x10)
$C$DW$T$417	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_sharedMemReqDetails")
	.dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$445)
	.dwattr $C$DW$T$417, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$417, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$417, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$T$417, DW_AT_decl_column(0x03)
$C$DW$T$418	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$T$418, DW_AT_address_class(0x20)

$C$DW$T$449	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$449, DW_AT_name("SharedRegion_Entry")
	.dwattr $C$DW$T$449, DW_AT_byte_size(0x1c)
$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1199, DW_AT_name("base")
	.dwattr $C$DW$1199, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x09)
$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$448)
	.dwattr $C$DW$1200, DW_AT_name("len")
	.dwattr $C$DW$1200, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x0b)
$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1201, DW_AT_name("ownerProcId")
	.dwattr $C$DW$1201, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x0c)
$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1202, DW_AT_name("isValid")
	.dwattr $C$DW$1202, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x0a)
$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1203, DW_AT_name("cacheEnable")
	.dwattr $C$DW$1203, DW_AT_TI_symbol_name("cacheEnable")
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x0a)
$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$448)
	.dwattr $C$DW$1204, DW_AT_name("cacheLineSize")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("cacheLineSize")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x0b)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1205, DW_AT_name("createHeap")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("createHeap")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x0a)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1206, DW_AT_name("name")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0x107)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$449

	.dwattr $C$DW$T$449, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$T$449, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$449, DW_AT_decl_column(0x10)
$C$DW$T$998	.dwtag  DW_TAG_typedef, DW_AT_name("SharedRegion_Entry")
	.dwattr $C$DW$T$998, DW_AT_type(*$C$DW$T$449)
	.dwattr $C$DW$T$998, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$998, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$T$998, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$998, DW_AT_decl_column(0x03)

$C$DW$T$455	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$455, DW_AT_name("SysLink_MemEntry_Block_tag")
	.dwattr $C$DW$T$455, DW_AT_byte_size(0x114)
$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$452)
	.dwattr $C$DW$1207, DW_AT_name("procName")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("procName")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x16)
$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1208, DW_AT_name("numEntries")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("numEntries")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x16)
$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$454)
	.dwattr $C$DW$1209, DW_AT_name("memEntries")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("memEntries")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$455

	.dwattr $C$DW$T$455, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$455, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$455, DW_AT_decl_column(0x10)
$C$DW$T$458	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemEntry_Block")
	.dwattr $C$DW$T$458, DW_AT_type(*$C$DW$T$455)
	.dwattr $C$DW$T$458, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$458, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$458, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$T$458, DW_AT_decl_column(0x03)
$C$DW$T$459	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$459, DW_AT_type(*$C$DW$T$458)
	.dwattr $C$DW$T$459, DW_AT_address_class(0x20)

$C$DW$T$457	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$457, DW_AT_name("SysLink_MemEntry_tag")
	.dwattr $C$DW$T$457, DW_AT_byte_size(0x18)
$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1210, DW_AT_name("slaveVirtAddr")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("slaveVirtAddr")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x0c)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1211, DW_AT_name("masterPhysAddr")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("masterPhysAddr")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0x91)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x0c)
$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1212, DW_AT_name("size")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0x92)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x0c)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$456)
	.dwattr $C$DW$1213, DW_AT_name("mapMask")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("mapMask")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x15)
$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1214, DW_AT_name("map")
	.dwattr $C$DW$1214, DW_AT_TI_symbol_name("map")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0x94)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x0c)
$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1215, DW_AT_name("isCached")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("isCached")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x0c)
$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1216, DW_AT_name("isValid")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$457

	.dwattr $C$DW$T$457, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$457, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$457, DW_AT_decl_column(0x10)
$C$DW$T$453	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemEntry")
	.dwattr $C$DW$T$453, DW_AT_type(*$C$DW$T$457)
	.dwattr $C$DW$T$453, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$453, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$453, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$453, DW_AT_decl_column(0x03)

$C$DW$T$454	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$454, DW_AT_type(*$C$DW$T$453)
	.dwattr $C$DW$T$454, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$454, DW_AT_byte_size(0xf0)
$C$DW$1217	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1217, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$454


$C$DW$T$460	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$460, DW_AT_name("SysLink_MemoryMap_tag")
	.dwattr $C$DW$T$460, DW_AT_byte_size(0x08)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1218, DW_AT_name("numBlocks")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("numBlocks")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x1e)
$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$459)
	.dwattr $C$DW$1219, DW_AT_name("memBlocks")
	.dwattr $C$DW$1219, DW_AT_TI_symbol_name("memBlocks")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$460

	.dwattr $C$DW$T$460, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$460, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$460, DW_AT_decl_column(0x10)
$C$DW$T$999	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemoryMap")
	.dwattr $C$DW$T$999, DW_AT_type(*$C$DW$T$460)
	.dwattr $C$DW$T$999, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$999, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$999, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$999, DW_AT_decl_column(0x03)

$C$DW$T$1000	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1000, DW_AT_name("SysLink_NotifyType_tag")
	.dwattr $C$DW$T$1000, DW_AT_byte_size(0x01)
$C$DW$1220	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1220, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x05)
$C$DW$1221	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1221, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x79)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x05)
$C$DW$1222	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1222, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x05)
$C$DW$1223	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1223, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x05)
$C$DW$1224	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1224, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1000

	.dwattr $C$DW$T$1000, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$1000, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$1000, DW_AT_decl_column(0x0e)
$C$DW$T$1001	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_NotifyType")
	.dwattr $C$DW$T$1001, DW_AT_type(*$C$DW$T$1000)
	.dwattr $C$DW$T$1001, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1001, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$1001, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$1001, DW_AT_decl_column(0x03)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$329	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$329, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$329, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$329, DW_AT_decl_column(0x1a)
$C$DW$T$1003	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__gateObj")
	.dwattr $C$DW$T$1003, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1003, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1003, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1003, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1003, DW_AT_decl_column(0x11)
$C$DW$T$1004	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__gatePrms")
	.dwattr $C$DW$T$1004, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1004, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1004, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1004, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$1004, DW_AT_decl_column(0x11)
$C$DW$T$1005	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__loggerObj")
	.dwattr $C$DW$T$1005, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1005, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1005, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1005, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$T$1005, DW_AT_decl_column(0x11)
$C$DW$T$1006	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Object__table")
	.dwattr $C$DW$T$1006, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1006, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1006, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1006, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1006, DW_AT_decl_column(0x11)
$C$DW$T$1007	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__gateObj")
	.dwattr $C$DW$T$1007, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1007, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1007, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1007, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$1007, DW_AT_decl_column(0x11)
$C$DW$T$1008	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__gatePrms")
	.dwattr $C$DW$T$1008, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1008, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1008, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1008, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$1008, DW_AT_decl_column(0x11)
$C$DW$T$1009	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__loggerObj")
	.dwattr $C$DW$T$1009, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1009, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1009, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1009, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$1009, DW_AT_decl_column(0x11)
$C$DW$T$1010	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Object__table")
	.dwattr $C$DW$T$1010, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1010, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1010, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1010, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$1010, DW_AT_decl_column(0x11)
$C$DW$T$1011	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__gateObj")
	.dwattr $C$DW$T$1011, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1011, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1011, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1011, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$1011, DW_AT_decl_column(0x11)
$C$DW$T$1012	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__gatePrms")
	.dwattr $C$DW$T$1012, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1012, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1012, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1012, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$1012, DW_AT_decl_column(0x11)
$C$DW$T$1013	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__loggerObj")
	.dwattr $C$DW$T$1013, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1013, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1013, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1013, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1013, DW_AT_decl_column(0x11)
$C$DW$T$1014	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Object__table")
	.dwattr $C$DW$T$1014, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1014, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1014, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1014, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$1014, DW_AT_decl_column(0x11)
$C$DW$T$1015	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__gateObj")
	.dwattr $C$DW$T$1015, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1015, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1015, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1015, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$1015, DW_AT_decl_column(0x11)
$C$DW$T$1016	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__gatePrms")
	.dwattr $C$DW$T$1016, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1016, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1016, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1016, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$1016, DW_AT_decl_column(0x11)
$C$DW$T$1017	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__loggerObj")
	.dwattr $C$DW$T$1017, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1017, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1017, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1017, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$1017, DW_AT_decl_column(0x11)
$C$DW$T$1018	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Object__table")
	.dwattr $C$DW$T$1018, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1018, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1018, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1018, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$1018, DW_AT_decl_column(0x11)
$C$DW$T$1019	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__gateObj")
	.dwattr $C$DW$T$1019, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1019, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1019, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1019, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$1019, DW_AT_decl_column(0x11)
$C$DW$T$1020	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__gatePrms")
	.dwattr $C$DW$T$1020, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1020, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1020, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1020, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1020, DW_AT_decl_column(0x11)
$C$DW$T$1021	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__loggerObj")
	.dwattr $C$DW$T$1021, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1021, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1021, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1021, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1021, DW_AT_decl_column(0x11)
$C$DW$T$1022	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Object__table")
	.dwattr $C$DW$T$1022, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1022, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1022, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1022, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$T$1022, DW_AT_decl_column(0x11)
$C$DW$T$1023	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__gateObj")
	.dwattr $C$DW$T$1023, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1023, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1023, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1023, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$1023, DW_AT_decl_column(0x11)
$C$DW$T$1024	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__gatePrms")
	.dwattr $C$DW$T$1024, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1024, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1024, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1024, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$1024, DW_AT_decl_column(0x11)
$C$DW$T$1025	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__loggerObj")
	.dwattr $C$DW$T$1025, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1025, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1025, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1025, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$1025, DW_AT_decl_column(0x11)
$C$DW$T$1026	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Object__table")
	.dwattr $C$DW$T$1026, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1026, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1026, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1026, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$1026, DW_AT_decl_column(0x11)
$C$DW$T$1027	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__gateObj")
	.dwattr $C$DW$T$1027, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1027, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1027, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1027, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$1027, DW_AT_decl_column(0x11)
$C$DW$T$1028	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__gatePrms")
	.dwattr $C$DW$T$1028, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1028, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1028, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1028, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$1028, DW_AT_decl_column(0x11)
$C$DW$T$1029	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__loggerObj")
	.dwattr $C$DW$T$1029, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1029, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1029, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1029, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1029, DW_AT_decl_column(0x11)
$C$DW$T$1030	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Object__table")
	.dwattr $C$DW$T$1030, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1030, DW_AT_language(DW_LANG_C)
