;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:30 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("shMem/FrameQ_ShMem.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$T$1199, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1199, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$T$1199, DW_AT_decl_column(0x0e)
$C$DW$T$1200	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceState")
	.dwattr $C$DW$T$1200, DW_AT_type(*$C$DW$T$1199)
	.dwattr $C$DW$T$1200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1200, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1200, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$1200, DW_AT_decl_column(0x03)

$C$DW$T$1201	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1201, DW_AT_byte_size(0x01)
$C$DW$1792	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1792, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1792, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1792, DW_AT_decl_column(0x05)
$C$DW$1793	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_Enable"), DW_AT_const_value(0x10)
	.dwattr $C$DW$1793, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1793, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1793, DW_AT_decl_column(0x05)
$C$DW$1794	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceEnter_EndValue"), DW_AT_const_value(0x20)
	.dwattr $C$DW$1794, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1794, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1794, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1201

	.dwattr $C$DW$T$1201, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1201, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$1201, DW_AT_decl_column(0x0e)
$C$DW$T$1202	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceEnter")
	.dwattr $C$DW$T$1202, DW_AT_type(*$C$DW$T$1201)
	.dwattr $C$DW$T$1202, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1202, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1202, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1202, DW_AT_decl_column(0x03)

$C$DW$T$1203	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1203, DW_AT_byte_size(0x02)
$C$DW$1795	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Disable"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1795, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1795, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1795, DW_AT_decl_column(0x05)
$C$DW$1796	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1796, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1796, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1796, DW_AT_decl_column(0x05)
$C$DW$1797	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1797, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1797, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1797, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1203

	.dwattr $C$DW$T$1203, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1203, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1203, DW_AT_decl_column(0x0e)
$C$DW$T$1204	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1204, DW_AT_type(*$C$DW$T$1203)
	.dwattr $C$DW$T$1204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1204, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1204, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1204, DW_AT_decl_column(0x03)

$C$DW$T$1205	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1205, DW_AT_byte_size(0x01)
$C$DW$1798	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1798, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1798, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1798, DW_AT_decl_column(0x05)
$C$DW$1799	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1799, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1799, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1799, DW_AT_decl_column(0x05)
$C$DW$1800	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1800, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1800, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1800, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1205

	.dwattr $C$DW$T$1205, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1205, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1205, DW_AT_decl_column(0x0e)
$C$DW$T$1206	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1206, DW_AT_type(*$C$DW$T$1205)
	.dwattr $C$DW$T$1206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1206, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1206, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1206, DW_AT_decl_column(0x03)

$C$DW$T$302	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x08)
$C$DW$1801	.dwtag  DW_TAG_member
	.dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1801, DW_AT_name("length")
	.dwattr $C$DW$1801, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1801, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1801, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1801, DW_AT_decl_column(0x16)
$C$DW$1802	.dwtag  DW_TAG_member
	.dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$1802, DW_AT_name("elem")
	.dwattr $C$DW$1802, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1802, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1802, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1802, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$302

	.dwattr $C$DW$T$302, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x10)
$C$DW$T$1207	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1207, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$1207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1207, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1207, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1207, DW_AT_decl_column(0x43)
$C$DW$T$1208	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1208, DW_AT_type(*$C$DW$T$1207)
	.dwattr $C$DW$T$1208, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1208, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1208, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1208, DW_AT_decl_column(0x30)
$C$DW$T$1209	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1209, DW_AT_type(*$C$DW$T$1208)
	.dwattr $C$DW$T$1209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1209, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1209, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1209, DW_AT_decl_column(0x2c)

$C$DW$T$303	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x08)
$C$DW$1803	.dwtag  DW_TAG_member
	.dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1803, DW_AT_name("length")
	.dwattr $C$DW$1803, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1803, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1803, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1803, DW_AT_decl_column(0x16)
$C$DW$1804	.dwtag  DW_TAG_member
	.dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$1804, DW_AT_name("elem")
	.dwattr $C$DW$1804, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1804, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1804, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1804, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x10)
$C$DW$T$1210	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1210, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$T$1210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1210, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1210, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1210, DW_AT_decl_column(0x43)
$C$DW$T$1211	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1211, DW_AT_type(*$C$DW$T$1210)
	.dwattr $C$DW$T$1211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1211, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1211, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1211, DW_AT_decl_column(0x2f)
$C$DW$T$1212	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1212, DW_AT_type(*$C$DW$T$1211)
	.dwattr $C$DW$T$1212, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1212, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1212, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1212, DW_AT_decl_column(0x2b)

$C$DW$T$306	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$306, DW_AT_byte_size(0x08)
$C$DW$1805	.dwtag  DW_TAG_member
	.dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1805, DW_AT_name("length")
	.dwattr $C$DW$1805, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1805, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1805, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1805, DW_AT_decl_column(0x16)
$C$DW$1806	.dwtag  DW_TAG_member
	.dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$1806, DW_AT_name("elem")
	.dwattr $C$DW$1806, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1806, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1806, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1806, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$306

	.dwattr $C$DW$T$306, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$306, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$306, DW_AT_decl_column(0x10)
$C$DW$T$1213	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1213, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$T$1213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1213, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1213, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1213, DW_AT_decl_column(0x42)
$C$DW$T$1214	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1214, DW_AT_type(*$C$DW$T$1213)
	.dwattr $C$DW$T$1214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1214, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1214, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1214, DW_AT_decl_column(0x2b)
$C$DW$T$1215	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1215, DW_AT_type(*$C$DW$T$1214)
	.dwattr $C$DW$T$1215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1215, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1215, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1215, DW_AT_decl_column(0x27)

$C$DW$T$309	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$309, DW_AT_byte_size(0x08)
$C$DW$1807	.dwtag  DW_TAG_member
	.dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1807, DW_AT_name("length")
	.dwattr $C$DW$1807, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1807, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1807, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1807, DW_AT_decl_column(0x16)
$C$DW$1808	.dwtag  DW_TAG_member
	.dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1808, DW_AT_name("elem")
	.dwattr $C$DW$1808, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1808, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1808, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1808, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$309

	.dwattr $C$DW$T$309, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$309, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$309, DW_AT_decl_column(0x10)
$C$DW$T$1216	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1216, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$T$1216, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1216, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1216, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1216, DW_AT_decl_column(0x43)
$C$DW$T$1217	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1217, DW_AT_type(*$C$DW$T$1216)
	.dwattr $C$DW$T$1217, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1217, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1217, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1217, DW_AT_decl_column(0x2c)
$C$DW$T$1218	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1218, DW_AT_type(*$C$DW$T$1217)
	.dwattr $C$DW$T$1218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1218, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1218, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1218, DW_AT_decl_column(0x28)

$C$DW$T$311	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$311, DW_AT_byte_size(0x34)
$C$DW$1809	.dwtag  DW_TAG_member
	.dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$1809, DW_AT_name("shMemParams")
	.dwattr $C$DW$1809, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1809, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$1809, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1809, DW_AT_decl_column(0x26)
	.dwendtag $C$DW$T$311

	.dwattr $C$DW$T$311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x08)

$C$DW$T$315	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$315, DW_AT_byte_size(0x04)
$C$DW$1810	.dwtag  DW_TAG_member
	.dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1810, DW_AT_name("f")
	.dwattr $C$DW$1810, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1810, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1810, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1810, DW_AT_decl_column(0x0f)
$C$DW$1811	.dwtag  DW_TAG_member
	.dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$1811, DW_AT_name("a")
	.dwattr $C$DW$1811, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1811, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1811, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1811, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$315

	.dwattr $C$DW$T$315, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x0f)
$C$DW$T$1219	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1219, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$T$1219, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1219, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1219, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1219, DW_AT_decl_column(0x03)

$C$DW$T$317	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$317, DW_AT_byte_size(0x14)
$C$DW$1812	.dwtag  DW_TAG_member
	.dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$1812, DW_AT_name("shMemParams")
	.dwattr $C$DW$1812, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1812, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1812, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1812, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$317

	.dwattr $C$DW$T$317, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$317, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$317, DW_AT_decl_column(0x08)

$C$DW$T$1220	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1220, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1220, DW_AT_byte_size(0x01)
$C$DW$1813	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1813, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1813, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1813, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1220

	.dwattr $C$DW$T$1220, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1220, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1220, DW_AT_decl_column(0x0e)
$C$DW$T$1221	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1221, DW_AT_type(*$C$DW$T$1220)
	.dwattr $C$DW$T$1221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1221, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1221, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1221, DW_AT_decl_column(0x03)

$C$DW$T$326	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$326, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$326, DW_AT_byte_size(0x10)
$C$DW$1814	.dwtag  DW_TAG_member
	.dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1814, DW_AT_name("gate")
	.dwattr $C$DW$1814, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1814, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1814, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1814, DW_AT_decl_column(0x1b)
$C$DW$1815	.dwtag  DW_TAG_member
	.dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1815, DW_AT_name("numProcessors")
	.dwattr $C$DW$1815, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1815, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1815, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1815, DW_AT_decl_column(0x0f)
$C$DW$1816	.dwtag  DW_TAG_member
	.dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1816, DW_AT_name("procIds")
	.dwattr $C$DW$1816, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1816, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1816, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1816, DW_AT_decl_column(0x0f)
$C$DW$1817	.dwtag  DW_TAG_member
	.dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1817, DW_AT_name("drvHandles")
	.dwattr $C$DW$1817, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1817, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1817, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1817, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$326

	.dwattr $C$DW$T$326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x10)
$C$DW$T$1222	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1222, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$T$1222, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1222, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1222, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1222, DW_AT_decl_column(0x03)

$C$DW$T$1223	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1223, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1223, DW_AT_byte_size(0x01)
$C$DW$1818	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1818, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1818, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1818, DW_AT_decl_column(0x05)
$C$DW$1819	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1819, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1819, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1819, DW_AT_decl_column(0x05)
$C$DW$1820	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1820, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1820, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1820, DW_AT_decl_column(0x05)
$C$DW$1821	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1821, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1821, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1821, DW_AT_decl_column(0x05)
$C$DW$1822	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1822, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1822, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1822, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1223

	.dwattr $C$DW$T$1223, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1223, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1223, DW_AT_decl_column(0x0e)
$C$DW$T$1224	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1224, DW_AT_type(*$C$DW$T$1223)
	.dwattr $C$DW$T$1224, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1224, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1224, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1224, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$539	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$539, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$539, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$539, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$539, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$539, DW_AT_decl_column(0x27)
$C$DW$T$540	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$540, DW_AT_type(*$C$DW$T$539)
	.dwattr $C$DW$T$540, DW_AT_address_class(0x20)
$C$DW$T$541	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$541, DW_AT_type(*$C$DW$T$540)
	.dwattr $C$DW$T$541, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$541, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$541, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$541, DW_AT_decl_column(0x22)
$C$DW$T$1229	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1229, DW_AT_type(*$C$DW$T$541)
	.dwattr $C$DW$T$1229, DW_AT_address_class(0x20)

$C$DW$T$339	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$339, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$339, DW_AT_byte_size(0x2c)
$C$DW$1823	.dwtag  DW_TAG_member
	.dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1823, DW_AT_name("name")
	.dwattr $C$DW$1823, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1823, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1823, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1823, DW_AT_decl_column(0x14)
$C$DW$1824	.dwtag  DW_TAG_member
	.dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1824, DW_AT_name("eventNo")
	.dwattr $C$DW$1824, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1824, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1824, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1824, DW_AT_decl_column(0x14)
$C$DW$1825	.dwtag  DW_TAG_member
	.dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1825, DW_AT_name("openFlag")
	.dwattr $C$DW$1825, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1825, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1825, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1825, DW_AT_decl_column(0x14)
$C$DW$1826	.dwtag  DW_TAG_member
	.dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1826, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1826, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1826, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1826, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1826, DW_AT_decl_column(0x14)
$C$DW$1827	.dwtag  DW_TAG_member
	.dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1827, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1827, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1827, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1827, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1827, DW_AT_decl_column(0x14)
$C$DW$1828	.dwtag  DW_TAG_member
	.dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1828, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1828, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1828, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1828, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1828, DW_AT_decl_column(0x14)
$C$DW$1829	.dwtag  DW_TAG_member
	.dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$334)
	.dwattr $C$DW$1829, DW_AT_name("gate")
	.dwattr $C$DW$1829, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1829, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1829, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1829, DW_AT_decl_column(0x14)
$C$DW$1830	.dwtag  DW_TAG_member
	.dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1830, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1830, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1830, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1830, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1830, DW_AT_decl_column(0x14)
$C$DW$1831	.dwtag  DW_TAG_member
	.dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1831, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1831, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1831, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1831, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1831, DW_AT_decl_column(0x14)
$C$DW$1832	.dwtag  DW_TAG_member
	.dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1832, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1832, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1832, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1832, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1832, DW_AT_decl_column(0x14)
$C$DW$1833	.dwtag  DW_TAG_member
	.dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1833, DW_AT_name("regionId")
	.dwattr $C$DW$1833, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1833, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1833, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1833, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$339

	.dwattr $C$DW$T$339, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x10)
$C$DW$T$1225	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1225, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$T$1225, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1225, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1225, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1225, DW_AT_decl_column(0x03)
$C$DW$T$1230	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1230, DW_AT_type(*$C$DW$T$1225)
$C$DW$T$1231	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1231, DW_AT_type(*$C$DW$T$1230)
	.dwattr $C$DW$T$1231, DW_AT_address_class(0x20)
$C$DW$T$1226	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1226, DW_AT_type(*$C$DW$T$1225)
	.dwattr $C$DW$T$1226, DW_AT_address_class(0x20)

$C$DW$T$343	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$343, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$343, DW_AT_byte_size(0x1c)
$C$DW$1834	.dwtag  DW_TAG_member
	.dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1834, DW_AT_name("clientHandle")
	.dwattr $C$DW$1834, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1834, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1834, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1834, DW_AT_decl_column(0x12)
$C$DW$1835	.dwtag  DW_TAG_member
	.dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1835, DW_AT_name("procId")
	.dwattr $C$DW$1835, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1835, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1835, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1835, DW_AT_decl_column(0x12)
$C$DW$1836	.dwtag  DW_TAG_member
	.dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1836, DW_AT_name("notifyType")
	.dwattr $C$DW$1836, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1836, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1836, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1836, DW_AT_decl_column(0x12)
$C$DW$1837	.dwtag  DW_TAG_member
	.dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$1837, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1837, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1837, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1837, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1837, DW_AT_decl_column(0x1d)
$C$DW$1838	.dwtag  DW_TAG_member
	.dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1838, DW_AT_name("cbContext")
	.dwattr $C$DW$1838, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1838, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1838, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1838, DW_AT_decl_column(0x12)
$C$DW$1839	.dwtag  DW_TAG_member
	.dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1839, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1839, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1839, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1839, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1839, DW_AT_decl_column(0x12)
$C$DW$1840	.dwtag  DW_TAG_member
	.dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1840, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1840, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1840, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1840, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1840, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$343

	.dwattr $C$DW$T$343, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x10)
$C$DW$T$1232	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1232, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$T$1232, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1232, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1232, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1232, DW_AT_decl_column(0x03)
$C$DW$T$1233	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1233, DW_AT_type(*$C$DW$T$1232)
	.dwattr $C$DW$T$1233, DW_AT_address_class(0x20)

$C$DW$T$454	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$454, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$454, DW_AT_byte_size(0x01)
$C$DW$1841	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1841, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1841, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1841, DW_AT_decl_column(0x05)
$C$DW$1842	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1842, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1842, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1842, DW_AT_decl_column(0x05)
$C$DW$1843	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1843, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1843, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1843, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$454

	.dwattr $C$DW$T$454, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$454, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$454, DW_AT_decl_column(0x0e)
$C$DW$T$455	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$455, DW_AT_type(*$C$DW$T$454)
	.dwattr $C$DW$T$455, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$455, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$455, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$455, DW_AT_decl_column(0x02)

$C$DW$T$349	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$349, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$349, DW_AT_byte_size(0x48)
$C$DW$1844	.dwtag  DW_TAG_member
	.dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1844, DW_AT_name("status")
	.dwattr $C$DW$1844, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1844, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1844, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1844, DW_AT_decl_column(0x1a)
$C$DW$1845	.dwtag  DW_TAG_member
	.dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1845, DW_AT_name("version")
	.dwattr $C$DW$1845, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1845, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1845, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1845, DW_AT_decl_column(0x1a)
$C$DW$1846	.dwtag  DW_TAG_member
	.dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1846, DW_AT_name("localProtect")
	.dwattr $C$DW$1846, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1846, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1846, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1846, DW_AT_decl_column(0x1a)
$C$DW$1847	.dwtag  DW_TAG_member
	.dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1847, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1847, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1847, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1847, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1847, DW_AT_decl_column(0x1a)
$C$DW$1848	.dwtag  DW_TAG_member
	.dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1848, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1848, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1848, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1848, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1848, DW_AT_decl_column(0x1a)
$C$DW$1849	.dwtag  DW_TAG_member
	.dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$1849, DW_AT_name("name")
	.dwattr $C$DW$1849, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1849, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1849, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1849, DW_AT_decl_column(0x1a)
$C$DW$1850	.dwtag  DW_TAG_member
	.dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$1850, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1850, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1850, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1850, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1850, DW_AT_decl_column(0x17)
$C$DW$1851	.dwtag  DW_TAG_member
	.dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1851, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1851, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1851, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1851, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1851, DW_AT_decl_column(0x18)
$C$DW$1852	.dwtag  DW_TAG_member
	.dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1852, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1852, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1852, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1852, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1852, DW_AT_decl_column(0x17)
$C$DW$1853	.dwtag  DW_TAG_member
	.dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1853, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1853, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1853, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1853, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1853, DW_AT_decl_column(0x1a)
$C$DW$1854	.dwtag  DW_TAG_member
	.dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$1854, DW_AT_name("entryId")
	.dwattr $C$DW$1854, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1854, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1854, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1854, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$349

	.dwattr $C$DW$T$349, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$349, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$349, DW_AT_decl_column(0x10)
$C$DW$T$1234	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$1234, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$1234, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1234, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1234, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$1234, DW_AT_decl_column(0x03)

$C$DW$T$456	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$456, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$456, DW_AT_byte_size(0x01)
$C$DW$1855	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1855, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1855, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1855, DW_AT_decl_column(0x05)
$C$DW$1856	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1856, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1856, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1856, DW_AT_decl_column(0x05)
$C$DW$1857	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1857, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1857, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1857, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$456

	.dwattr $C$DW$T$456, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$456, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$456, DW_AT_decl_column(0x0e)
$C$DW$T$457	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$457, DW_AT_type(*$C$DW$T$456)
	.dwattr $C$DW$T$457, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$457, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$457, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$457, DW_AT_decl_column(0x02)

$C$DW$T$350	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$350, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$350, DW_AT_byte_size(0x0c)
$C$DW$1858	.dwtag  DW_TAG_member
	.dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1858, DW_AT_name("name")
	.dwattr $C$DW$1858, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1858, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1858, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1858, DW_AT_decl_column(0x11)
$C$DW$1859	.dwtag  DW_TAG_member
	.dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1859, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1859, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1859, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1859, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1859, DW_AT_decl_column(0x11)
$C$DW$1860	.dwtag  DW_TAG_member
	.dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1860, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1860, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1860, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1860, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$1860, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$350

	.dwattr $C$DW$T$350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x10)
$C$DW$T$380	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$380, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$T$380, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$380, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$380, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$380, DW_AT_decl_column(0x03)

$C$DW$T$351	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$351, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$351, DW_AT_byte_size(0x0c)
$C$DW$1861	.dwtag  DW_TAG_member
	.dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1861, DW_AT_name("eventNo")
	.dwattr $C$DW$1861, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1861, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1861, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1861, DW_AT_decl_column(0x0c)
$C$DW$1862	.dwtag  DW_TAG_member
	.dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1862, DW_AT_name("maxInstances")
	.dwattr $C$DW$1862, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1862, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1862, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1862, DW_AT_decl_column(0x0c)
$C$DW$1863	.dwtag  DW_TAG_member
	.dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1863, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1863, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1863, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1863, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1863, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$351

	.dwattr $C$DW$T$351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x10)
$C$DW$T$1235	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$1235, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$T$1235, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1235, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1235, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$1235, DW_AT_decl_column(0x03)

$C$DW$T$1236	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1236, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1236, DW_AT_byte_size(0x04)
$C$DW$1864	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1864, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1864, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1864, DW_AT_decl_column(0x09)
$C$DW$1865	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1865, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1865, DW_AT_decl_line(0x135)
	.dwattr $C$DW$1865, DW_AT_decl_column(0x09)
$C$DW$1866	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1866, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1866, DW_AT_decl_line(0x139)
	.dwattr $C$DW$1866, DW_AT_decl_column(0x09)
$C$DW$1867	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1867, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1867, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$1867, DW_AT_decl_column(0x09)
$C$DW$1868	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1868, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1868, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1868, DW_AT_decl_column(0x09)
$C$DW$1869	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1869, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1869, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1869, DW_AT_decl_column(0x09)
$C$DW$1870	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1870, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1870, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1870, DW_AT_decl_column(0x09)
$C$DW$1871	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1871, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1871, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1871, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1236

	.dwattr $C$DW$T$1236, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1236, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1236, DW_AT_decl_column(0x0e)
$C$DW$T$1237	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1237, DW_AT_type(*$C$DW$T$1236)
	.dwattr $C$DW$T$1237, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1237, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1237, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$1237, DW_AT_decl_column(0x03)

$C$DW$T$354	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x10)
$C$DW$1872	.dwtag  DW_TAG_member
	.dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1872, DW_AT_name("size")
	.dwattr $C$DW$1872, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1872, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1872, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1872, DW_AT_decl_column(0x0c)
$C$DW$1873	.dwtag  DW_TAG_member
	.dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1873, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1873, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1873, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1873, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1873, DW_AT_decl_column(0x1c)
$C$DW$1874	.dwtag  DW_TAG_member
	.dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$1874, DW_AT_name("name")
	.dwattr $C$DW$1874, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1874, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1874, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1874, DW_AT_decl_column(0x0c)
$C$DW$1875	.dwtag  DW_TAG_member
	.dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1875, DW_AT_name("openFlag")
	.dwattr $C$DW$1875, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1875, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1875, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$1875, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x10)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x03)

$C$DW$T$355	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$355, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$355, DW_AT_byte_size(0x14)
$C$DW$1876	.dwtag  DW_TAG_member
	.dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1876, DW_AT_name("size")
	.dwattr $C$DW$1876, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1876, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1876, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$1876, DW_AT_decl_column(0x0c)
$C$DW$1877	.dwtag  DW_TAG_member
	.dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1877, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1877, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1877, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1877, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1877, DW_AT_decl_column(0x0c)
$C$DW$1878	.dwtag  DW_TAG_member
	.dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1878, DW_AT_name("height")
	.dwattr $C$DW$1878, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1878, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1878, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1878, DW_AT_decl_column(0x0c)
$C$DW$1879	.dwtag  DW_TAG_member
	.dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1879, DW_AT_name("width")
	.dwattr $C$DW$1879, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1879, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1879, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1879, DW_AT_decl_column(0x0c)
$C$DW$1880	.dwtag  DW_TAG_member
	.dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1880, DW_AT_name("align")
	.dwattr $C$DW$1880, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1880, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1880, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1880, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$355

	.dwattr $C$DW$T$355, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x10)
$C$DW$T$1238	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$1238, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$T$1238, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1238, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$1238, DW_AT_decl_column(0x02)

$C$DW$T$1239	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1239, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1239, DW_AT_byte_size(0x01)
$C$DW$1881	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1881, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1881, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$1881, DW_AT_decl_column(0x05)
$C$DW$1882	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1882, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1882, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1882, DW_AT_decl_column(0x05)
$C$DW$1883	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1883, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1883, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1883, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1239

	.dwattr $C$DW$T$1239, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1239, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$1239, DW_AT_decl_column(0x0e)
$C$DW$T$1240	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1240, DW_AT_type(*$C$DW$T$1239)
	.dwattr $C$DW$T$1240, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1240, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1240, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$1240, DW_AT_decl_column(0x03)

$C$DW$T$1241	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1241, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1241, DW_AT_byte_size(0x01)
$C$DW$1884	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1884, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1884, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1884, DW_AT_decl_column(0x05)
$C$DW$1885	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1885, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1885, DW_AT_decl_line(0x185)
	.dwattr $C$DW$1885, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1241

	.dwattr $C$DW$T$1241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1241, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$1241, DW_AT_decl_column(0x0e)
$C$DW$T$1242	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1242, DW_AT_type(*$C$DW$T$1241)
	.dwattr $C$DW$T$1242, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1242, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1242, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$1242, DW_AT_decl_column(0x03)

$C$DW$T$370	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$370, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$370, DW_AT_byte_size(0x2b4)
$C$DW$1886	.dwtag  DW_TAG_member
	.dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1886, DW_AT_name("numFrms")
	.dwattr $C$DW$1886, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1886, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1886, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1886, DW_AT_decl_column(0x15)
$C$DW$1887	.dwtag  DW_TAG_member
	.dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1887, DW_AT_name("freeFrms")
	.dwattr $C$DW$1887, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1887, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1887, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1887, DW_AT_decl_column(0x15)
$C$DW$1888	.dwtag  DW_TAG_member
	.dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1888, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1888, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1888, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1888, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1888, DW_AT_decl_column(0x15)
$C$DW$1889	.dwtag  DW_TAG_member
	.dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1889, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1889, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1889, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1889, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1889, DW_AT_decl_column(0x15)
$C$DW$1890	.dwtag  DW_TAG_member
	.dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1890, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1890, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1890, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1890, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1890, DW_AT_decl_column(0x15)
$C$DW$1891	.dwtag  DW_TAG_member
	.dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1891, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1891, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1891, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1891, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1891, DW_AT_decl_column(0x15)
$C$DW$1892	.dwtag  DW_TAG_member
	.dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1892, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1892, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1892, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1892, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1892, DW_AT_decl_column(0x15)
$C$DW$1893	.dwtag  DW_TAG_member
	.dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1893, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1893, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1893, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1893, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1893, DW_AT_decl_column(0x15)
$C$DW$1894	.dwtag  DW_TAG_member
	.dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1894, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1894, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1894, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1894, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1894, DW_AT_decl_column(0x15)
$C$DW$1895	.dwtag  DW_TAG_member
	.dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1895, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1895, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1895, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1895, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1895, DW_AT_decl_column(0x15)
$C$DW$1896	.dwtag  DW_TAG_member
	.dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1896, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1896, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1896, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1896, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1896, DW_AT_decl_column(0x15)
$C$DW$1897	.dwtag  DW_TAG_member
	.dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1897, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1897, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1897, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1897, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1897, DW_AT_decl_column(0x15)
$C$DW$1898	.dwtag  DW_TAG_member
	.dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1898, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1898, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1898, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1898, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1898, DW_AT_decl_column(0x15)
$C$DW$1899	.dwtag  DW_TAG_member
	.dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1899, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1899, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1899, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1899, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1899, DW_AT_decl_column(0x15)
$C$DW$1900	.dwtag  DW_TAG_member
	.dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1900, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1900, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1900, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1900, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1900, DW_AT_decl_column(0x15)
$C$DW$1901	.dwtag  DW_TAG_member
	.dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1901, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1901, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1901, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1901, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1901, DW_AT_decl_column(0x15)
$C$DW$1902	.dwtag  DW_TAG_member
	.dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$1902, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1902, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1902, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1902, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1902, DW_AT_decl_column(0x15)
$C$DW$1903	.dwtag  DW_TAG_member
	.dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$1903, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1903, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1903, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1903, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1903, DW_AT_decl_column(0x15)
$C$DW$1904	.dwtag  DW_TAG_member
	.dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1904, DW_AT_name("dynFrame")
	.dwattr $C$DW$1904, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1904, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1904, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1904, DW_AT_decl_column(0x15)
$C$DW$1905	.dwtag  DW_TAG_member
	.dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1905, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1905, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1905, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1905, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1905, DW_AT_decl_column(0x15)
$C$DW$1906	.dwtag  DW_TAG_member
	.dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$1906, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1906, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1906, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1906, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1906, DW_AT_decl_column(0x15)
$C$DW$1907	.dwtag  DW_TAG_member
	.dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1907, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1907, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1907, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1907, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1907, DW_AT_decl_column(0x15)
$C$DW$1908	.dwtag  DW_TAG_member
	.dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1908, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1908, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1908, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1908, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1908, DW_AT_decl_column(0x15)
$C$DW$1909	.dwtag  DW_TAG_member
	.dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$1909, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1909, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1909, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1909, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1909, DW_AT_decl_column(0x15)
$C$DW$1910	.dwtag  DW_TAG_member
	.dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$1910, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1910, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1910, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1910, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1910, DW_AT_decl_column(0x15)
$C$DW$1911	.dwtag  DW_TAG_member
	.dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$1911, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1911, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1911, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1911, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1911, DW_AT_decl_column(0x15)
$C$DW$1912	.dwtag  DW_TAG_member
	.dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$1912, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1912, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1912, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1912, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1912, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$370

	.dwattr $C$DW$T$370, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$370, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$370, DW_AT_decl_column(0x10)
$C$DW$T$1243	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$1243, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$T$1243, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1243, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1243, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$1243, DW_AT_decl_column(0x03)

$C$DW$T$352	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$352, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
$C$DW$1913	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1913, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1913, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1913, DW_AT_decl_column(0x05)
$C$DW$1914	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1914, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1914, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1914, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$352

	.dwattr $C$DW$T$352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x0e)
$C$DW$T$353	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x03)

$C$DW$T$371	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$371, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$371, DW_AT_byte_size(0x20)
$C$DW$1915	.dwtag  DW_TAG_member
	.dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1915, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1915, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1915, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1915, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1915, DW_AT_decl_column(0x0f)
$C$DW$1916	.dwtag  DW_TAG_member
	.dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1916, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1916, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1916, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1916, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1916, DW_AT_decl_column(0x0f)
$C$DW$1917	.dwtag  DW_TAG_member
	.dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1917, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1917, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1917, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1917, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1917, DW_AT_decl_column(0x0f)
$C$DW$1918	.dwtag  DW_TAG_member
	.dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1918, DW_AT_name("instParams")
	.dwattr $C$DW$1918, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1918, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1918, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1918, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$371

	.dwattr $C$DW$T$371, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$371, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$371, DW_AT_decl_column(0x10)
$C$DW$T$1244	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1244, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$T$1244, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1244, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1244, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1244, DW_AT_decl_column(0x02)

$C$DW$T$379	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$379, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$379, DW_AT_byte_size(0x14)
$C$DW$1919	.dwtag  DW_TAG_member
	.dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1919, DW_AT_name("notifyType")
	.dwattr $C$DW$1919, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1919, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1919, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$1919, DW_AT_decl_column(0x1d)
$C$DW$1920	.dwtag  DW_TAG_member
	.dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1920, DW_AT_name("watermark")
	.dwattr $C$DW$1920, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1920, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1920, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$1920, DW_AT_decl_column(0x1d)
$C$DW$1921	.dwtag  DW_TAG_member
	.dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$1921, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1921, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1921, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1921, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$1921, DW_AT_decl_column(0x1d)
$C$DW$1922	.dwtag  DW_TAG_member
	.dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1922, DW_AT_name("cbContext")
	.dwattr $C$DW$1922, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1922, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1922, DW_AT_decl_line(0x200)
	.dwattr $C$DW$1922, DW_AT_decl_column(0x1d)
$C$DW$1923	.dwtag  DW_TAG_member
	.dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1923, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1923, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1923, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1923, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1923, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$379

	.dwattr $C$DW$T$379, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x10)
$C$DW$T$436	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$436, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$T$436, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$436, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$436, DW_AT_decl_line(0x205)
	.dwattr $C$DW$T$436, DW_AT_decl_column(0x03)
$C$DW$T$437	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$437, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$T$437, DW_AT_address_class(0x20)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$374	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$374, DW_AT_address_class(0x20)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x25)
$C$DW$T$1245	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1245, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$1245, DW_AT_address_class(0x20)

$C$DW$T$381	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$381, DW_AT_name("FrameQBufMgr_OpenParams_tag")
	.dwattr $C$DW$T$381, DW_AT_byte_size(0x0c)
$C$DW$1924	.dwtag  DW_TAG_member
	.dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$1924, DW_AT_name("commonOpenParams")
	.dwattr $C$DW$1924, DW_AT_TI_symbol_name("commonOpenParams")
	.dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1924, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1924, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1924, DW_AT_decl_column(0x27)
	.dwendtag $C$DW$T$381

	.dwattr $C$DW$T$381, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$381, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$381, DW_AT_decl_column(0x10)
$C$DW$T$1246	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_OpenParams")
	.dwattr $C$DW$T$1246, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$1246, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1246, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1246, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$1246, DW_AT_decl_column(0x02)

$C$DW$T$383	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$383, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$383, DW_AT_byte_size(0x18)
$C$DW$1925	.dwtag  DW_TAG_member
	.dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$382)
	.dwattr $C$DW$1925, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$1925, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1925, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1925, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1925, DW_AT_decl_column(0x21)
$C$DW$1926	.dwtag  DW_TAG_member
	.dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1926, DW_AT_name("impParams")
	.dwattr $C$DW$1926, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1926, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1926, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$1926, DW_AT_decl_column(0x09)
$C$DW$1927	.dwtag  DW_TAG_member
	.dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$1927, DW_AT_name("impParamsSize")
	.dwattr $C$DW$1927, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1927, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1927, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$1927, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$383

	.dwattr $C$DW$T$383, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$383, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$T$383, DW_AT_decl_column(0x10)
$C$DW$T$1248	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$1248, DW_AT_type(*$C$DW$T$383)
	.dwattr $C$DW$T$1248, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1248, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1248, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$T$1248, DW_AT_decl_column(0x03)

$C$DW$T$384	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$384, DW_AT_name("FrameQBufMgr_ShMem_InstNameServerEntryParams_tag")
	.dwattr $C$DW$T$384, DW_AT_byte_size(0x14)
$C$DW$1928	.dwtag  DW_TAG_member
	.dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1928, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1928, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1928, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
