;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:52 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("shMem/FrameQBufMgr_ShMem.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$1228, DW_AT_decl_column(0x05)
$C$DW$1229	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1229, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x05)
$C$DW$1230	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1230, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1145

	.dwattr $C$DW$T$1145, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1145, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1145, DW_AT_decl_column(0x0e)
$C$DW$T$1146	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1146, DW_AT_type(*$C$DW$T$1145)
	.dwattr $C$DW$T$1146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1146, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1146, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1146, DW_AT_decl_column(0x03)

$C$DW$T$1147	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1147, DW_AT_byte_size(0x04)
$C$DW$1231	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1231, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x05)
$C$DW$1232	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1232, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x05)
$C$DW$1233	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1233, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x05)
$C$DW$1234	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1234, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x05)
$C$DW$1235	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1235, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x05)
$C$DW$1236	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1236, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1147

	.dwattr $C$DW$T$1147, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1147, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1147, DW_AT_decl_column(0x0e)
$C$DW$T$1148	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1148, DW_AT_type(*$C$DW$T$1147)
	.dwattr $C$DW$T$1148, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1148, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1148, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1148, DW_AT_decl_column(0x03)

$C$DW$T$1149	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1149, DW_AT_byte_size(0x01)
$C$DW$1237	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1237, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x05)
$C$DW$1238	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x05)
$C$DW$1239	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1239, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1149

	.dwattr $C$DW$T$1149, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1149, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1149, DW_AT_decl_column(0x0e)
$C$DW$T$1150	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1150, DW_AT_type(*$C$DW$T$1149)
	.dwattr $C$DW$T$1150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1150, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1150, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1150, DW_AT_decl_column(0x03)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x04)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1240, DW_AT_name("width")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0x75)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x14)
$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1241, DW_AT_name("height")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0x76)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)

$C$DW$T$309	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$309, DW_AT_byte_size(0x08)
$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1242, DW_AT_name("length")
	.dwattr $C$DW$1242, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x16)
$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1243, DW_AT_name("elem")
	.dwattr $C$DW$1243, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$309

	.dwattr $C$DW$T$309, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$309, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$309, DW_AT_decl_column(0x10)
$C$DW$T$1151	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1151, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$T$1151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1151, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1151, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1151, DW_AT_decl_column(0x43)
$C$DW$T$1152	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1152, DW_AT_type(*$C$DW$T$1151)
	.dwattr $C$DW$T$1152, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1152, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1152, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1152, DW_AT_decl_column(0x30)
$C$DW$T$1153	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1153, DW_AT_type(*$C$DW$T$1152)
	.dwattr $C$DW$T$1153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1153, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1153, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1153, DW_AT_decl_column(0x2c)

$C$DW$T$310	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$310, DW_AT_byte_size(0x08)
$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1244, DW_AT_name("length")
	.dwattr $C$DW$1244, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x16)
$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1245, DW_AT_name("elem")
	.dwattr $C$DW$1245, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$310

	.dwattr $C$DW$T$310, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$310, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$310, DW_AT_decl_column(0x10)
$C$DW$T$1154	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1154, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$1154, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1154, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1154, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1154, DW_AT_decl_column(0x43)
$C$DW$T$1155	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1155, DW_AT_type(*$C$DW$T$1154)
	.dwattr $C$DW$T$1155, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1155, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1155, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1155, DW_AT_decl_column(0x2f)
$C$DW$T$1156	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1156, DW_AT_type(*$C$DW$T$1155)
	.dwattr $C$DW$T$1156, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1156, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1156, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1156, DW_AT_decl_column(0x2b)

$C$DW$T$313	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$313, DW_AT_byte_size(0x08)
$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1246, DW_AT_name("length")
	.dwattr $C$DW$1246, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x16)
$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$1247, DW_AT_name("elem")
	.dwattr $C$DW$1247, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$313

	.dwattr $C$DW$T$313, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$313, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$313, DW_AT_decl_column(0x10)
$C$DW$T$1157	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1157, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$T$1157, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1157, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1157, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1157, DW_AT_decl_column(0x42)
$C$DW$T$1158	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1158, DW_AT_type(*$C$DW$T$1157)
	.dwattr $C$DW$T$1158, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1158, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1158, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1158, DW_AT_decl_column(0x2b)
$C$DW$T$1159	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1159, DW_AT_type(*$C$DW$T$1158)
	.dwattr $C$DW$T$1159, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1159, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1159, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1159, DW_AT_decl_column(0x27)

$C$DW$T$316	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$316, DW_AT_byte_size(0x08)
$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1248, DW_AT_name("length")
	.dwattr $C$DW$1248, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x16)
$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$1249, DW_AT_name("elem")
	.dwattr $C$DW$1249, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$316

	.dwattr $C$DW$T$316, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$316, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$316, DW_AT_decl_column(0x10)
$C$DW$T$1160	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1160, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$1160, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1160, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1160, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1160, DW_AT_decl_column(0x43)
$C$DW$T$1161	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1161, DW_AT_type(*$C$DW$T$1160)
	.dwattr $C$DW$T$1161, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1161, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1161, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1161, DW_AT_decl_column(0x2c)
$C$DW$T$1162	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1162, DW_AT_type(*$C$DW$T$1161)
	.dwattr $C$DW$T$1162, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1162, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1162, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1162, DW_AT_decl_column(0x28)

$C$DW$T$317	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$317, DW_AT_byte_size(0x04)
$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$1250, DW_AT_name("area")
	.dwattr $C$DW$1250, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x0b)
$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1251, DW_AT_name("len")
	.dwattr $C$DW$1251, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x78)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$317

	.dwattr $C$DW$T$317, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/SyslinkMemMgr.h")
	.dwattr $C$DW$T$317, DW_AT_decl_line(0x73)
	.dwattr $C$DW$T$317, DW_AT_decl_column(0x0b)

$C$DW$T$319	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$319, DW_AT_byte_size(0x14)
$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$1252, DW_AT_name("shMemParams")
	.dwattr $C$DW$1252, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$319

	.dwattr $C$DW$T$319, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$319, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$319, DW_AT_decl_column(0x08)

$C$DW$T$323	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$323, DW_AT_byte_size(0x04)
$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$1253, DW_AT_name("f")
	.dwattr $C$DW$1253, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x0f)
$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$1254, DW_AT_name("a")
	.dwattr $C$DW$1254, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$323

	.dwattr $C$DW$T$323, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$323, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$323, DW_AT_decl_column(0x0f)
$C$DW$T$1163	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1163, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$T$1163, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1163, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1163, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1163, DW_AT_decl_column(0x03)

$C$DW$T$1164	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1164, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1164, DW_AT_byte_size(0x01)
$C$DW$1255	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1255, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1164

	.dwattr $C$DW$T$1164, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1164, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1164, DW_AT_decl_column(0x0e)
$C$DW$T$1165	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1165, DW_AT_type(*$C$DW$T$1164)
	.dwattr $C$DW$T$1165, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1165, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1165, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1165, DW_AT_decl_column(0x03)

$C$DW$T$332	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$332, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$332, DW_AT_byte_size(0x10)
$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$1256, DW_AT_name("gate")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x1b)
$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1257, DW_AT_name("numProcessors")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x0f)
$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1258, DW_AT_name("procIds")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x0f)
$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1259, DW_AT_name("drvHandles")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$332

	.dwattr $C$DW$T$332, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x10)
$C$DW$T$1166	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1166, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$T$1166, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1166, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1166, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1166, DW_AT_decl_column(0x03)

$C$DW$T$1167	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1167, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1167, DW_AT_byte_size(0x01)
$C$DW$1260	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1260, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x05)
$C$DW$1261	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x05)
$C$DW$1262	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x05)
$C$DW$1263	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1263, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x05)
$C$DW$1264	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1167

	.dwattr $C$DW$T$1167, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1167, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1167, DW_AT_decl_column(0x0e)
$C$DW$T$1168	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1168, DW_AT_type(*$C$DW$T$1167)
	.dwattr $C$DW$T$1168, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1168, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1168, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1168, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$409	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$409, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$409, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$409, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$409, DW_AT_decl_column(0x27)
$C$DW$T$410	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$410, DW_AT_address_class(0x20)
$C$DW$T$411	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$411, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$411, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$411, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$411, DW_AT_decl_column(0x22)
$C$DW$T$1172	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1172, DW_AT_type(*$C$DW$T$411)
	.dwattr $C$DW$T$1172, DW_AT_address_class(0x20)

$C$DW$T$341	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$341, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$341, DW_AT_byte_size(0x2c)
$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$1265, DW_AT_name("name")
	.dwattr $C$DW$1265, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x14)
$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1266, DW_AT_name("eventNo")
	.dwattr $C$DW$1266, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x14)
$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1267, DW_AT_name("openFlag")
	.dwattr $C$DW$1267, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x14)
$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1268, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1268, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x14)
$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1269, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x14)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1270, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x14)
$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$1271, DW_AT_name("gate")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x14)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1272, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x14)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1273, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x14)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1274, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x14)
$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1275, DW_AT_name("regionId")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$341

	.dwattr $C$DW$T$341, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x10)
$C$DW$T$1169	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1169, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$T$1169, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1169, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1169, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1169, DW_AT_decl_column(0x03)
$C$DW$T$1177	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1177, DW_AT_type(*$C$DW$T$1169)
$C$DW$T$1178	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1178, DW_AT_type(*$C$DW$T$1177)
	.dwattr $C$DW$T$1178, DW_AT_address_class(0x20)
$C$DW$T$1170	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1170, DW_AT_type(*$C$DW$T$1169)
	.dwattr $C$DW$T$1170, DW_AT_address_class(0x20)

$C$DW$T$345	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$345, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$345, DW_AT_byte_size(0x1c)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1276, DW_AT_name("clientHandle")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x12)
$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1277, DW_AT_name("procId")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x12)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1278, DW_AT_name("notifyType")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x12)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$1279, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x1d)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1280, DW_AT_name("cbContext")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x12)
$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1281, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x12)
$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1282, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1282, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1282, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$345

	.dwattr $C$DW$T$345, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$345, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$345, DW_AT_decl_column(0x10)
$C$DW$T$1180	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1180, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$T$1180, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1180, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1180, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1180, DW_AT_decl_column(0x03)
$C$DW$T$1181	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1181, DW_AT_type(*$C$DW$T$1180)
	.dwattr $C$DW$T$1181, DW_AT_address_class(0x20)

$C$DW$T$501	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$501, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$501, DW_AT_byte_size(0x01)
$C$DW$1283	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1283, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0x163)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x05)
$C$DW$1284	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0x167)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x05)
$C$DW$1285	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$501

	.dwattr $C$DW$T$501, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$501, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$501, DW_AT_decl_column(0x0e)
$C$DW$T$502	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$502, DW_AT_type(*$C$DW$T$501)
	.dwattr $C$DW$T$502, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$502, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$502, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$502, DW_AT_decl_column(0x02)
$C$DW$T$1184	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1184, DW_AT_type(*$C$DW$T$502)

$C$DW$T$351	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$351, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$351, DW_AT_byte_size(0x48)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1286, DW_AT_name("status")
	.dwattr $C$DW$1286, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x1a)
$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1287, DW_AT_name("version")
	.dwattr $C$DW$1287, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x1a)
$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1288, DW_AT_name("localProtect")
	.dwattr $C$DW$1288, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x1a)
$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1289, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1289, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x1a)
$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$1290, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$1290, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x1a)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$1291, DW_AT_name("name")
	.dwattr $C$DW$1291, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x1a)
$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$1292, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$1292, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x17)
$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1293, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1293, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x18)
$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1294, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$1294, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x17)
$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1295, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1295, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x1a)
$C$DW$1296	.dwtag  DW_TAG_member
	.dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$1296, DW_AT_name("entryId")
	.dwattr $C$DW$1296, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1296, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$351

	.dwattr $C$DW$T$351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x10)
$C$DW$T$400	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$400, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$T$400, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$400, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$400, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$400, DW_AT_decl_column(0x03)
$C$DW$T$401	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$401, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$T$401, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$401, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$401, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$401, DW_AT_decl_column(0x27)
$C$DW$T$402	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$402, DW_AT_type(*$C$DW$T$401)
$C$DW$T$403	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$403, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$T$403, DW_AT_address_class(0x20)
$C$DW$T$1185	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1185, DW_AT_type(*$C$DW$T$351)
$C$DW$T$1186	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1186, DW_AT_type(*$C$DW$T$1185)
	.dwattr $C$DW$T$1186, DW_AT_address_class(0x20)

$C$DW$T$503	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$503, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$503, DW_AT_byte_size(0x01)
$C$DW$1297	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1297, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0x157)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x05)
$C$DW$1298	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1298, DW_AT_decl_line(0x159)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x05)
$C$DW$1299	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1299, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$503

	.dwattr $C$DW$T$503, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$503, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$503, DW_AT_decl_column(0x0e)
$C$DW$T$504	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$504, DW_AT_type(*$C$DW$T$503)
	.dwattr $C$DW$T$504, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$504, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$504, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$504, DW_AT_decl_column(0x02)

$C$DW$T$352	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$352, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$352, DW_AT_byte_size(0x0c)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$1300, DW_AT_name("name")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x11)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1301, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x11)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1302, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1302, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$352

	.dwattr $C$DW$T$352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x10)
$C$DW$T$382	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$382, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$382, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$382, DW_AT_decl_column(0x03)

$C$DW$T$353	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$353, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$353, DW_AT_byte_size(0x0c)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1303, DW_AT_name("eventNo")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1303, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x0c)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$1304, DW_AT_name("maxInstances")
	.dwattr $C$DW$1304, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1304, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x0c)
$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1305, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$1305, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1305, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$353

	.dwattr $C$DW$T$353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x10)
$C$DW$T$392	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$392, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$T$392, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$392, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$392, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$392, DW_AT_decl_column(0x03)
$C$DW$T$1188	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1188, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$1188, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1188, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1188, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1188, DW_AT_decl_column(0x27)
$C$DW$T$1189	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1189, DW_AT_type(*$C$DW$T$1188)
	.dwattr $C$DW$T$1189, DW_AT_address_class(0x20)
$C$DW$T$1190	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1190, DW_AT_type(*$C$DW$T$1189)
$C$DW$T$1191	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1191, DW_AT_type(*$C$DW$T$392)
	.dwattr $C$DW$T$1191, DW_AT_address_class(0x20)

$C$DW$T$1194	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1194, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1194, DW_AT_byte_size(0x04)
$C$DW$1306	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1306, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1306, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x09)
$C$DW$1307	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1307, DW_AT_decl_line(0x135)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x09)
$C$DW$1308	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1308, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1308, DW_AT_decl_line(0x139)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x09)
$C$DW$1309	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$1309, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x09)
$C$DW$1310	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$1310, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0x141)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x09)
$C$DW$1311	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$1311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x09)
$C$DW$1312	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$1312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0x149)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x09)
$C$DW$1313	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$1313, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1194

	.dwattr $C$DW$T$1194, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1194, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1194, DW_AT_decl_column(0x0e)
$C$DW$T$1195	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1195, DW_AT_type(*$C$DW$T$1194)
	.dwattr $C$DW$T$1195, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1195, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1195, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$1195, DW_AT_decl_column(0x03)

$C$DW$T$356	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$356, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$356, DW_AT_byte_size(0x10)
$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1314, DW_AT_name("size")
	.dwattr $C$DW$1314, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1314, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1314, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$1314, DW_AT_decl_column(0x0c)
$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$1315, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1315, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1315, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1315, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$1315, DW_AT_decl_column(0x1c)
$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$1316, DW_AT_name("name")
	.dwattr $C$DW$1316, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1316, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1316, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$1316, DW_AT_decl_column(0x0c)
$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1317, DW_AT_name("openFlag")
	.dwattr $C$DW$1317, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1317, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1317, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$1317, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$356

	.dwattr $C$DW$T$356, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$356, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$356, DW_AT_decl_column(0x10)
$C$DW$T$384	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$384, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$384, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$384, DW_AT_decl_column(0x03)

$C$DW$T$357	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$357, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$357, DW_AT_byte_size(0x14)
$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1318, DW_AT_name("size")
	.dwattr $C$DW$1318, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1318, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1318, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$1318, DW_AT_decl_column(0x0c)
$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1319, DW_AT_name("pixelFormat")
	.dwattr $C$DW$1319, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1319, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1319, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1319, DW_AT_decl_column(0x0c)
$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1320, DW_AT_name("height")
	.dwattr $C$DW$1320, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1320, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1320, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1320, DW_AT_decl_column(0x0c)
$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1321, DW_AT_name("width")
	.dwattr $C$DW$1321, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1321, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1321, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1321, DW_AT_decl_column(0x0c)
$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1322, DW_AT_name("align")
	.dwattr $C$DW$1322, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1322, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1322, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1322, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$357

	.dwattr $C$DW$T$357, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$357, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$357, DW_AT_decl_column(0x10)
$C$DW$T$428	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$428, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$T$428, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$428, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x02)
$C$DW$T$429	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$429, DW_AT_address_class(0x20)

$C$DW$T$430	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$430, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$430, DW_AT_byte_size(0x100)
$C$DW$1323	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1323, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$430

$C$DW$T$1197	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1197, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$T$1197, DW_AT_address_class(0x20)
$C$DW$T$1198	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1198, DW_AT_type(*$C$DW$T$1197)
$C$DW$T$1199	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1199, DW_AT_type(*$C$DW$T$1198)
	.dwattr $C$DW$T$1199, DW_AT_address_class(0x20)

$C$DW$T$1201	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1201, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1201, DW_AT_byte_size(0x01)
$C$DW$1324	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1324, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1324, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$1324, DW_AT_decl_column(0x05)
$C$DW$1325	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1325, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1325, DW_AT_decl_column(0x05)
$C$DW$1326	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1326, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1326, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1201

	.dwattr $C$DW$T$1201, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1201, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$1201, DW_AT_decl_column(0x0e)
$C$DW$T$1202	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1202, DW_AT_type(*$C$DW$T$1201)
	.dwattr $C$DW$T$1202, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1202, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1202, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$1202, DW_AT_decl_column(0x03)

$C$DW$T$1203	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1203, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1203, DW_AT_byte_size(0x01)
$C$DW$1327	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1327, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1327, DW_AT_decl_line(0x181)
	.dwattr $C$DW$1327, DW_AT_decl_column(0x05)
$C$DW$1328	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1328, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1328, DW_AT_decl_line(0x185)
	.dwattr $C$DW$1328, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1203

	.dwattr $C$DW$T$1203, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1203, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$1203, DW_AT_decl_column(0x0e)
$C$DW$T$1204	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1204, DW_AT_type(*$C$DW$T$1203)
	.dwattr $C$DW$T$1204, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1204, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1204, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$1204, DW_AT_decl_column(0x03)

$C$DW$T$372	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$372, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$372, DW_AT_byte_size(0x2b4)
$C$DW$1329	.dwtag  DW_TAG_member
	.dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1329, DW_AT_name("numFrms")
	.dwattr $C$DW$1329, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1329, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1329, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1329, DW_AT_decl_column(0x15)
$C$DW$1330	.dwtag  DW_TAG_member
	.dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1330, DW_AT_name("freeFrms")
	.dwattr $C$DW$1330, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1330, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1330, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1330, DW_AT_decl_column(0x15)
$C$DW$1331	.dwtag  DW_TAG_member
	.dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1331, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$1331, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1331, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1331, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1331, DW_AT_decl_column(0x15)
$C$DW$1332	.dwtag  DW_TAG_member
	.dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1332, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$1332, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1332, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1332, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1332, DW_AT_decl_column(0x15)
$C$DW$1333	.dwtag  DW_TAG_member
	.dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1333, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$1333, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1333, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1333, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1333, DW_AT_decl_column(0x15)
$C$DW$1334	.dwtag  DW_TAG_member
	.dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1334, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$1334, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1334, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1334, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1334, DW_AT_decl_column(0x15)
$C$DW$1335	.dwtag  DW_TAG_member
	.dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1335, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$1335, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1335, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1335, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1335, DW_AT_decl_column(0x15)
$C$DW$1336	.dwtag  DW_TAG_member
	.dwattr $C$DW$1336, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1336, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1336, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$1336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1336, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1336, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1336, DW_AT_decl_column(0x15)
$C$DW$1337	.dwtag  DW_TAG_member
	.dwattr $C$DW$1337, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1337, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$1337, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$1337, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1337, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1337, DW_AT_decl_column(0x15)
$C$DW$1338	.dwtag  DW_TAG_member
	.dwattr $C$DW$1338, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1338, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$1338, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$1338, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1338, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1338, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1338, DW_AT_decl_column(0x15)
$C$DW$1339	.dwtag  DW_TAG_member
	.dwattr $C$DW$1339, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1339, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$1339, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$1339, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1339, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1339, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1339, DW_AT_decl_column(0x15)
$C$DW$1340	.dwtag  DW_TAG_member
	.dwattr $C$DW$1340, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1340, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$1340, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$1340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1340, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1340, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1340, DW_AT_decl_column(0x15)
$C$DW$1341	.dwtag  DW_TAG_member
	.dwattr $C$DW$1341, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1341, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$1341, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$1341, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1341, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1341, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1341, DW_AT_decl_column(0x15)
$C$DW$1342	.dwtag  DW_TAG_member
	.dwattr $C$DW$1342, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1342, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$1342, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$1342, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1342, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1342, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1342, DW_AT_decl_column(0x15)
$C$DW$1343	.dwtag  DW_TAG_member
	.dwattr $C$DW$1343, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1343, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$1343, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$1343, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1343, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1343, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1343, DW_AT_decl_column(0x15)
$C$DW$1344	.dwtag  DW_TAG_member
	.dwattr $C$DW$1344, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$1344, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$1344, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$1344, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1344, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1344, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1344, DW_AT_decl_column(0x15)
$C$DW$1345	.dwtag  DW_TAG_member
	.dwattr $C$DW$1345, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$1345, DW_AT_name("frmBufSize")
	.dwattr $C$DW$1345, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$1345, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1345, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1345, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1345, DW_AT_decl_column(0x15)
$C$DW$1346	.dwtag  DW_TAG_member
	.dwattr $C$DW$1346, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$1346, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$1346, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$1346, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1346, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1346, DW_AT_decl_column(0x15)
$C$DW$1347	.dwtag  DW_TAG_member
	.dwattr $C$DW$1347, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1347, DW_AT_name("dynFrame")
	.dwattr $C$DW$1347, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$1347, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$1347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1347, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1347, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1347, DW_AT_decl_column(0x15)
$C$DW$1348	.dwtag  DW_TAG_member
	.dwattr $C$DW$1348, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1348, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$1348, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$1348, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$1348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1348, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1348, DW_AT_decl_column(0x15)
$C$DW$1349	.dwtag  DW_TAG_member
	.dwattr $C$DW$1349, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$1349, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1349, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$1349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$1349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1349, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1349, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1349, DW_AT_decl_column(0x15)
$C$DW$1350	.dwtag  DW_TAG_member
	.dwattr $C$DW$1350, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1350, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1350, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$1350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$1350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1350, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1350, DW_AT_decl_column(0x15)
$C$DW$1351	.dwtag  DW_TAG_member
	.dwattr $C$DW$1351, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$1351, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$1351, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$1351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$1351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1351, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1351, DW_AT_decl_column(0x15)
$C$DW$1352	.dwtag  DW_TAG_member
	.dwattr $C$DW$1352, DW_AT_type(*$C$DW$T$363)
	.dwattr $C$DW$1352, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$1352, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$1352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$1352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1352, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1352, DW_AT_decl_column(0x15)
$C$DW$1353	.dwtag  DW_TAG_member
	.dwattr $C$DW$1353, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1353, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1353, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$1353, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$1353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1353, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1353, DW_AT_decl_column(0x15)
$C$DW$1354	.dwtag  DW_TAG_member
	.dwattr $C$DW$1354, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1354, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1354, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$1354, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$1354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1354, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1354, DW_AT_decl_column(0x15)
$C$DW$1355	.dwtag  DW_TAG_member
	.dwattr $C$DW$1355, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$1355, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1355, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$1355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$1355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1355, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1355, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1355, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$372

	.dwattr $C$DW$T$372, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$372, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$372, DW_AT_decl_column(0x10)
$C$DW$T$404	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$404, DW_AT_type(*$C$DW$T$372)
	.dwattr $C$DW$T$404, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$404, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$404, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$404, DW_AT_decl_column(0x03)
$C$DW$T$405	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$405, DW_AT_type(*$C$DW$T$404)
	.dwattr $C$DW$T$405, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$405, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$405, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$405, DW_AT_decl_column(0x27)
$C$DW$T$406	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$406, DW_AT_type(*$C$DW$T$405)
$C$DW$T$407	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$407, DW_AT_type(*$C$DW$T$406)
	.dwattr $C$DW$T$407, DW_AT_address_class(0x20)
$C$DW$T$408	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$408, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$T$408, DW_AT_address_class(0x20)
$C$DW$T$1205	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1205, DW_AT_type(*$C$DW$T$405)
	.dwattr $C$DW$T$1205, DW_AT_address_class(0x20)
$C$DW$T$1206	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1206, DW_AT_type(*$C$DW$T$372)
$C$DW$T$1207	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1207, DW_AT_type(*$C$DW$T$1206)
	.dwattr $C$DW$T$1207, DW_AT_address_class(0x20)
$C$DW$T$1208	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1208, DW_AT_type(*$C$DW$T$1207)
	.dwattr $C$DW$T$1208, DW_AT_address_class(0x20)

$C$DW$T$354	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x01)
$C$DW$1356	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1356, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1356, DW_AT_decl_line(0x175)
	.dwattr $C$DW$1356, DW_AT_decl_column(0x05)
$C$DW$1357	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1357, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1357, DW_AT_decl_line(0x179)
	.dwattr $C$DW$1357, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x0e)
$C$DW$T$355	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$355, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$355, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$355, DW_AT_decl_column(0x03)

$C$DW$T$373	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$373, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$373, DW_AT_byte_size(0x20)
$C$DW$1358	.dwtag  DW_TAG_member
	.dwattr $C$DW$1358, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1358, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$1358, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$1358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1358, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1358, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1358, DW_AT_decl_column(0x0f)
$C$DW$1359	.dwtag  DW_TAG_member
	.dwattr $C$DW$1359, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1359, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$1359, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$1359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1359, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1359, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1359, DW_AT_decl_column(0x0f)
$C$DW$1360	.dwtag  DW_TAG_member
	.dwattr $C$DW$1360, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1360, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$1360, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$1360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1360, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1360, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1360, DW_AT_decl_column(0x0f)
$C$DW$1361	.dwtag  DW_TAG_member
	.dwattr $C$DW$1361, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1361, DW_AT_name("instParams")
	.dwattr $C$DW$1361, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$1361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1361, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$1361, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1361, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$373

	.dwattr $C$DW$T$373, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$373, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$373, DW_AT_decl_column(0x10)
$C$DW$T$1211	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1211, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$T$1211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1211, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1211, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1211, DW_AT_decl_column(0x02)
$C$DW$T$1212	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1212, DW_AT_type(*$C$DW$T$1211)
	.dwattr $C$DW$T$1212, DW_AT_address_class(0x20)

$C$DW$T$381	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$381, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$381, DW_AT_byte_size(0x14)
$C$DW$1362	.dwtag  DW_TAG_member
	.dwattr $C$DW$1362, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$1362, DW_AT_name("notifyType")
	.dwattr $C$DW$1362, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1362, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1362, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$1362, DW_AT_decl_column(0x1d)
$C$DW$1363	.dwtag  DW_TAG_member
	.dwattr $C$DW$1363, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$1363, DW_AT_name("watermark")
	.dwattr $C$DW$1363, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$1363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1363, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1363, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$1363, DW_AT_decl_column(0x1d)
$C$DW$1364	.dwtag  DW_TAG_member
	.dwattr $C$DW$1364, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$1364, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$1364, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$1364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1364, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1364, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$1364, DW_AT_decl_column(0x1d)
$C$DW$1365	.dwtag  DW_TAG_member
	.dwattr $C$DW$1365, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1365, DW_AT_name("cbContext")
	.dwattr $C$DW$1365, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1365, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1365, DW_AT_decl_line(0x200)
	.dwattr $C$DW$1365, DW_AT_decl_column(0x1d)
$C$DW$1366	.dwtag  DW_TAG_member
	.dwattr $C$DW$1366, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$1366, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$1366, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$1366, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1366, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$1366, DW_AT_decl_line(0x202)
	.dwattr $C$DW$1366, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$381

	.dwattr $C$DW$T$381, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$381, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$381, DW_AT_decl_column(0x10)
$C$DW$T$483	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$483, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$T$483, DW_AT_language(DW_LANG_C)
