;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:46 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("FrameQ.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$527, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x95)
	.dwattr $C$DW$527, DW_AT_decl_column(0x05)
$C$DW$528	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$528, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x97)
	.dwattr $C$DW$528, DW_AT_decl_column(0x05)
$C$DW$529	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$529, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x99)
	.dwattr $C$DW$529, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$849

	.dwattr $C$DW$T$849, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$849, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$849, DW_AT_decl_column(0x0e)
$C$DW$T$850	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$850, DW_AT_type(*$C$DW$T$849)
	.dwattr $C$DW$T$850, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$850, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$850, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$850, DW_AT_decl_column(0x03)

$C$DW$T$851	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$851, DW_AT_byte_size(0x04)
$C$DW$530	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$530, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$530, DW_AT_decl_column(0x05)
$C$DW$531	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$531, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$531, DW_AT_decl_column(0x05)
$C$DW$532	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$532, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$532, DW_AT_decl_column(0x05)
$C$DW$533	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$533, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$533, DW_AT_decl_column(0x05)
$C$DW$534	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$534, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$534, DW_AT_decl_column(0x05)
$C$DW$535	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$535, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0xab)
	.dwattr $C$DW$535, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$851

	.dwattr $C$DW$T$851, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$851, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$851, DW_AT_decl_column(0x0e)
$C$DW$T$852	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$852, DW_AT_type(*$C$DW$T$851)
	.dwattr $C$DW$T$852, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$852, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$852, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$852, DW_AT_decl_column(0x03)

$C$DW$T$853	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$853, DW_AT_byte_size(0x01)
$C$DW$536	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$536, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$536, DW_AT_decl_column(0x05)
$C$DW$537	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$537, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$537, DW_AT_decl_column(0x05)
$C$DW$538	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$538, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$538, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$853

	.dwattr $C$DW$T$853, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$853, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$853, DW_AT_decl_column(0x0e)
$C$DW$T$854	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$854, DW_AT_type(*$C$DW$T$853)
	.dwattr $C$DW$T$854, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$854, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$854, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$854, DW_AT_decl_column(0x03)

$C$DW$T$234	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$234, DW_AT_byte_size(0x08)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$539, DW_AT_name("length")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0xad)
	.dwattr $C$DW$539, DW_AT_decl_column(0x16)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$540, DW_AT_name("elem")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0xad)
	.dwattr $C$DW$540, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$234

	.dwattr $C$DW$T$234, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$234, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$234, DW_AT_decl_column(0x10)
$C$DW$T$855	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$855, DW_AT_type(*$C$DW$T$234)
	.dwattr $C$DW$T$855, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$855, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$855, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$855, DW_AT_decl_column(0x43)
$C$DW$T$856	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$856, DW_AT_type(*$C$DW$T$855)
	.dwattr $C$DW$T$856, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$856, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$856, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$856, DW_AT_decl_column(0x30)
$C$DW$T$857	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$857, DW_AT_type(*$C$DW$T$856)
	.dwattr $C$DW$T$857, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$857, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$857, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$857, DW_AT_decl_column(0x2c)

$C$DW$T$235	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$235, DW_AT_byte_size(0x08)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$541, DW_AT_name("length")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$541, DW_AT_decl_column(0x16)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$542, DW_AT_name("elem")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$542, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$235

	.dwattr $C$DW$T$235, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$235, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$235, DW_AT_decl_column(0x10)
$C$DW$T$858	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$858, DW_AT_type(*$C$DW$T$235)
	.dwattr $C$DW$T$858, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$858, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$858, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$858, DW_AT_decl_column(0x43)
$C$DW$T$859	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$859, DW_AT_type(*$C$DW$T$858)
	.dwattr $C$DW$T$859, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$859, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$859, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$859, DW_AT_decl_column(0x2f)
$C$DW$T$860	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$860, DW_AT_type(*$C$DW$T$859)
	.dwattr $C$DW$T$860, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$860, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$860, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$860, DW_AT_decl_column(0x2b)

$C$DW$T$238	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$238, DW_AT_byte_size(0x08)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$543, DW_AT_name("length")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$543, DW_AT_decl_column(0x16)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$237)
	.dwattr $C$DW$544, DW_AT_name("elem")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$544, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$238

	.dwattr $C$DW$T$238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$238, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$238, DW_AT_decl_column(0x10)
$C$DW$T$861	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$861, DW_AT_type(*$C$DW$T$238)
	.dwattr $C$DW$T$861, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$861, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$861, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$861, DW_AT_decl_column(0x42)
$C$DW$T$862	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$861)
	.dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$862, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$862, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$862, DW_AT_decl_column(0x2b)
$C$DW$T$863	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$863, DW_AT_type(*$C$DW$T$862)
	.dwattr $C$DW$T$863, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$863, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$863, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$863, DW_AT_decl_column(0x27)

$C$DW$T$241	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$241, DW_AT_byte_size(0x08)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$545, DW_AT_name("length")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x197)
	.dwattr $C$DW$545, DW_AT_decl_column(0x16)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$240)
	.dwattr $C$DW$546, DW_AT_name("elem")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x197)
	.dwattr $C$DW$546, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$241

	.dwattr $C$DW$T$241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$241, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$241, DW_AT_decl_column(0x10)
$C$DW$T$864	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$864, DW_AT_type(*$C$DW$T$241)
	.dwattr $C$DW$T$864, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$864, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$864, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$864, DW_AT_decl_column(0x43)
$C$DW$T$865	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$865, DW_AT_type(*$C$DW$T$864)
	.dwattr $C$DW$T$865, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$865, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$865, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$865, DW_AT_decl_column(0x2c)
$C$DW$T$866	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$865)
	.dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$866, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$866, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$866, DW_AT_decl_column(0x28)

$C$DW$T$243	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$243, DW_AT_byte_size(0x34)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$242)
	.dwattr $C$DW$547, DW_AT_name("shMemParams")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x102)
	.dwattr $C$DW$547, DW_AT_decl_column(0x26)
	.dwendtag $C$DW$T$243

	.dwattr $C$DW$T$243, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$243, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$243, DW_AT_decl_column(0x08)

$C$DW$T$247	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$247, DW_AT_byte_size(0x04)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$244)
	.dwattr $C$DW$548, DW_AT_name("f")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0xac)
	.dwattr $C$DW$548, DW_AT_decl_column(0x0f)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$549, DW_AT_name("a")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0xad)
	.dwattr $C$DW$549, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$247

	.dwattr $C$DW$T$247, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$247, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$247, DW_AT_decl_column(0x0f)
$C$DW$T$867	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$867, DW_AT_type(*$C$DW$T$247)
	.dwattr $C$DW$T$867, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$867, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$867, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$867, DW_AT_decl_column(0x03)

$C$DW$T$868	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$868, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$868, DW_AT_byte_size(0x01)
$C$DW$550	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$550, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x163)
	.dwattr $C$DW$550, DW_AT_decl_column(0x05)
$C$DW$551	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$551, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x167)
	.dwattr $C$DW$551, DW_AT_decl_column(0x05)
$C$DW$552	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$552, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$552, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$868

	.dwattr $C$DW$T$868, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$868, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$868, DW_AT_decl_column(0x0e)
$C$DW$T$869	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$869, DW_AT_type(*$C$DW$T$868)
	.dwattr $C$DW$T$869, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$869, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$869, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$869, DW_AT_decl_column(0x02)

$C$DW$T$870	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$870, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$870, DW_AT_byte_size(0x01)
$C$DW$553	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$553, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x157)
	.dwattr $C$DW$553, DW_AT_decl_column(0x05)
$C$DW$554	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$554, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x159)
	.dwattr $C$DW$554, DW_AT_decl_column(0x05)
$C$DW$555	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$555, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$555, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$870

	.dwattr $C$DW$T$870, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$870, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$870, DW_AT_decl_column(0x0e)
$C$DW$T$871	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$871, DW_AT_type(*$C$DW$T$870)
	.dwattr $C$DW$T$871, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$871, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$871, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$871, DW_AT_decl_column(0x02)

$C$DW$T$258	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$258, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$258, DW_AT_byte_size(0x0c)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$556, DW_AT_name("name")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$556, DW_AT_decl_column(0x11)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$557, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$557, DW_AT_decl_column(0x11)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$558, DW_AT_name("sharedAddr")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$558, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$258

	.dwattr $C$DW$T$258, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$258, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$258, DW_AT_decl_column(0x10)
$C$DW$T$872	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$258)
	.dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$872, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$872, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$872, DW_AT_decl_column(0x03)

$C$DW$T$261	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$261, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$261, DW_AT_byte_size(0x0c)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$559, DW_AT_name("eventNo")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$559, DW_AT_decl_column(0x0c)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$560, DW_AT_name("maxInstances")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$560, DW_AT_decl_column(0x0c)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$561, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$561, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$261

	.dwattr $C$DW$T$261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$261, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$261, DW_AT_decl_column(0x10)
$C$DW$T$873	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$873, DW_AT_type(*$C$DW$T$261)
	.dwattr $C$DW$T$873, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$873, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$873, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$873, DW_AT_decl_column(0x03)

$C$DW$T$874	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$874, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$874, DW_AT_byte_size(0x04)
$C$DW$562	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$562, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x131)
	.dwattr $C$DW$562, DW_AT_decl_column(0x09)
$C$DW$563	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$563, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x135)
	.dwattr $C$DW$563, DW_AT_decl_column(0x09)
$C$DW$564	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$564, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x139)
	.dwattr $C$DW$564, DW_AT_decl_column(0x09)
$C$DW$565	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$565, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$565, DW_AT_decl_column(0x09)
$C$DW$566	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$566, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x141)
	.dwattr $C$DW$566, DW_AT_decl_column(0x09)
$C$DW$567	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$567, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x145)
	.dwattr $C$DW$567, DW_AT_decl_column(0x09)
$C$DW$568	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$568, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x149)
	.dwattr $C$DW$568, DW_AT_decl_column(0x09)
$C$DW$569	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$569, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$569, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$874

	.dwattr $C$DW$T$874, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$874, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$874, DW_AT_decl_column(0x0e)
$C$DW$T$875	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$874)
	.dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$875, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$875, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$875, DW_AT_decl_column(0x03)

$C$DW$T$264	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$264, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$264, DW_AT_byte_size(0x10)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$570, DW_AT_name("size")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$570, DW_AT_decl_column(0x0c)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$263)
	.dwattr $C$DW$571, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$571, DW_AT_decl_column(0x1c)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$572, DW_AT_name("name")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$572, DW_AT_decl_column(0x0c)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$573, DW_AT_name("openFlag")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$573, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$264

	.dwattr $C$DW$T$264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$264, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$264, DW_AT_decl_column(0x10)
$C$DW$T$274	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$264)
	.dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$274, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$274, DW_AT_decl_column(0x03)

$C$DW$T$265	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$265, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$265, DW_AT_byte_size(0x14)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$574, DW_AT_name("size")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$574, DW_AT_decl_column(0x0c)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$575, DW_AT_name("pixelFormat")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$575, DW_AT_decl_column(0x0c)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$576, DW_AT_name("height")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$576, DW_AT_decl_column(0x0c)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$577, DW_AT_name("width")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$577, DW_AT_decl_column(0x0c)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$578, DW_AT_name("align")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$578, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$265

	.dwattr $C$DW$T$265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x10)
$C$DW$T$876	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$265)
	.dwattr $C$DW$T$876, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$876, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$876, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$876, DW_AT_decl_column(0x02)

$C$DW$T$877	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$877, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$877, DW_AT_byte_size(0x01)
$C$DW$579	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$579, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$579, DW_AT_decl_column(0x05)
$C$DW$580	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$580, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x191)
	.dwattr $C$DW$580, DW_AT_decl_column(0x05)
$C$DW$581	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$581, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x194)
	.dwattr $C$DW$581, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$877

	.dwattr $C$DW$T$877, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$877, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$877, DW_AT_decl_column(0x0e)
$C$DW$T$878	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$877)
	.dwattr $C$DW$T$878, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$878, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$878, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$878, DW_AT_decl_column(0x03)

$C$DW$T$879	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$879, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$879, DW_AT_byte_size(0x01)
$C$DW$582	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$582, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x181)
	.dwattr $C$DW$582, DW_AT_decl_column(0x05)
$C$DW$583	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$583, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x185)
	.dwattr $C$DW$583, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$879

	.dwattr $C$DW$T$879, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$879, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$879, DW_AT_decl_column(0x0e)
$C$DW$T$880	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$880, DW_AT_type(*$C$DW$T$879)
	.dwattr $C$DW$T$880, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$880, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$880, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$880, DW_AT_decl_column(0x03)

$C$DW$T$262	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$262, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$262, DW_AT_byte_size(0x01)
$C$DW$584	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$584, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x175)
	.dwattr $C$DW$584, DW_AT_decl_column(0x05)
$C$DW$585	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$585, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x179)
	.dwattr $C$DW$585, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$262

	.dwattr $C$DW$T$262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x0e)
$C$DW$T$263	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
	.dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$263, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$263, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$263, DW_AT_decl_column(0x03)

$C$DW$T$273	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$273, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$273, DW_AT_byte_size(0x14)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$267)
	.dwattr $C$DW$586, DW_AT_name("notifyType")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$586, DW_AT_decl_column(0x1d)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$587, DW_AT_name("watermark")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$587, DW_AT_decl_column(0x1d)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$272)
	.dwattr $C$DW$588, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$588, DW_AT_decl_column(0x1d)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$589, DW_AT_name("cbContext")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x200)
	.dwattr $C$DW$589, DW_AT_decl_column(0x1d)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$590, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x202)
	.dwattr $C$DW$590, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$273

	.dwattr $C$DW$T$273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$273, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$T$273, DW_AT_decl_column(0x10)
$C$DW$T$881	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NotifyParams")
	.dwattr $C$DW$T$881, DW_AT_type(*$C$DW$T$273)
	.dwattr $C$DW$T$881, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$881, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$881, DW_AT_decl_line(0x205)
	.dwattr $C$DW$T$881, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("FrameQBufMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$268	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$268, DW_AT_address_class(0x20)
$C$DW$T$269	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Handle")
	.dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$268)
	.dwattr $C$DW$T$269, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$269, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$269, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$269, DW_AT_decl_column(0x25)

$C$DW$T$275	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$275, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$275, DW_AT_byte_size(0x18)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$274)
	.dwattr $C$DW$591, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$591, DW_AT_decl_column(0x21)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$592, DW_AT_name("impParams")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("impParams")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$592, DW_AT_decl_column(0x09)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$593, DW_AT_name("impParamsSize")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("impParamsSize")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$593, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$275

	.dwattr $C$DW$T$275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$275, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$T$275, DW_AT_decl_column(0x10)
$C$DW$T$882	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Params")
	.dwattr $C$DW$T$882, DW_AT_type(*$C$DW$T$275)
	.dwattr $C$DW$T$882, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$882, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$882, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$T$882, DW_AT_decl_column(0x03)

$C$DW$T$278	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$278, DW_AT_name("FrameQ_Attrs_Tag")
	.dwattr $C$DW$T$278, DW_AT_byte_size(0x28)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$594, DW_AT_name("status")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0xad)
	.dwattr $C$DW$594, DW_AT_decl_column(0x1a)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$595, DW_AT_name("version")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$595, DW_AT_decl_column(0x1a)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$596, DW_AT_name("localProtect")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$596, DW_AT_decl_column(0x1a)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$597, DW_AT_name("remoteProtect")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$597, DW_AT_decl_column(0x1a)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$277)
	.dwattr $C$DW$598, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$598, DW_AT_decl_column(0x1a)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$599, DW_AT_name("numReaders")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("numReaders")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$599, DW_AT_decl_column(0x1a)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$600, DW_AT_name("numActiveReaders")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("numActiveReaders")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$600, DW_AT_decl_column(0x1a)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$601, DW_AT_name("numQueues")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("numQueues")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$601, DW_AT_decl_column(0x1a)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$602, DW_AT_name("primaryQueueId")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("primaryQueueId")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$602, DW_AT_decl_column(0x1a)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$603, DW_AT_name("frmQBufMgrId")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("frmQBufMgrId")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$603, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$278

	.dwattr $C$DW$T$278, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$278, DW_AT_decl_line(0xac)
	.dwattr $C$DW$T$278, DW_AT_decl_column(0x10)
$C$DW$T$883	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Attrs")
	.dwattr $C$DW$T$883, DW_AT_type(*$C$DW$T$278)
	.dwattr $C$DW$T$883, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$883, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$883, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$T$883, DW_AT_decl_column(0x02)
$C$DW$T$884	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_Attrs")
	.dwattr $C$DW$T$884, DW_AT_type(*$C$DW$T$883)
	.dwattr $C$DW$T$884, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$884, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$884, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$884, DW_AT_decl_column(0x21)

$C$DW$T$279	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$279, DW_AT_name("FrameQ_CommonOpenParams_Tag")
	.dwattr $C$DW$T$279, DW_AT_byte_size(0x10)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$604, DW_AT_name("name")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$604, DW_AT_decl_column(0x12)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$605, DW_AT_name("sharedAddr")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x1c0)
	.dwattr $C$DW$605, DW_AT_decl_column(0x11)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$606, DW_AT_name("openMode")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$606, DW_AT_decl_column(0x11)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$607, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$607, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$279

	.dwattr $C$DW$T$279, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$279, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$279, DW_AT_decl_column(0x10)
$C$DW$T$325	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CommonOpenParams")
	.dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$279)
	.dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x03)

$C$DW$T$284	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$284, DW_AT_name("FrameQ_Config_Tag")
	.dwattr $C$DW$T$284, DW_AT_byte_size(0x0c)
$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$608, DW_AT_name("eventNo")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0x197)
	.dwattr $C$DW$608, DW_AT_decl_column(0x0c)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$283)
	.dwattr $C$DW$609, DW_AT_name("maxInstances")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$609, DW_AT_decl_column(0x0c)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$610, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$610, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$284

	.dwattr $C$DW$T$284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$284, DW_AT_decl_line(0x196)
	.dwattr $C$DW$T$284, DW_AT_decl_column(0x10)
$C$DW$T$298	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Config")
	.dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$284)
	.dwattr $C$DW$T$298, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x03)
$C$DW$T$885	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_Config")
	.dwattr $C$DW$T$885, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$885, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$885, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ_ShMem.h")
	.dwattr $C$DW$T$885, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$885, DW_AT_decl_column(0x21)
$C$DW$T$886	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$886, DW_AT_type(*$C$DW$T$885)
	.dwattr $C$DW$T$886, DW_AT_address_class(0x20)
$C$DW$T$887	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$887, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$887, DW_AT_address_class(0x20)
$C$DW$T$888	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$888, DW_AT_type(*$C$DW$T$887)

$C$DW$T$891	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$891, DW_AT_name("FrameQ_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$891, DW_AT_byte_size(0x04)
$C$DW$611	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$611, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x166)
	.dwattr $C$DW$611, DW_AT_decl_column(0x09)
$C$DW$612	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$612, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$612, DW_AT_decl_column(0x09)
$C$DW$613	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$613, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$613, DW_AT_decl_column(0x09)
$C$DW$614	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$614, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0x172)
	.dwattr $C$DW$614, DW_AT_decl_column(0x09)
$C$DW$615	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$615, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0x176)
	.dwattr $C$DW$615, DW_AT_decl_column(0x09)
$C$DW$616	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$616, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$616, DW_AT_decl_column(0x09)
$C$DW$617	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$617, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$617, DW_AT_decl_column(0x09)
$C$DW$618	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$618, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x182)
	.dwattr $C$DW$618, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$891

	.dwattr $C$DW$T$891, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$891, DW_AT_decl_line(0x165)
	.dwattr $C$DW$T$891, DW_AT_decl_column(0x0e)
$C$DW$T$892	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CpuAccessFlags")
	.dwattr $C$DW$T$892, DW_AT_type(*$C$DW$T$891)
	.dwattr $C$DW$T$892, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$892, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$892, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$892, DW_AT_decl_column(0x03)

$C$DW$T$287	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$287, DW_AT_name("FrameQ_CreateParams_Tag")
	.dwattr $C$DW$T$287, DW_AT_byte_size(0x10)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$619, DW_AT_name("size")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$619, DW_AT_decl_column(0x1d)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$620, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$620, DW_AT_decl_column(0x1d)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$621, DW_AT_name("name")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$621, DW_AT_decl_column(0x1d)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$622, DW_AT_name("openFlag")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$622, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$287

	.dwattr $C$DW$T$287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$287, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$287, DW_AT_decl_column(0x10)
$C$DW$T$327	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_CreateParams")
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$327, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0x1b7)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x03)

$C$DW$T$290	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$290, DW_AT_name("FrameQ_FrameQueue_Tag")
	.dwattr $C$DW$T$290, DW_AT_byte_size(0x48)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$276)
	.dwattr $C$DW$623, DW_AT_name("readerIndex")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("readerIndex")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$623, DW_AT_decl_column(0x1e)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$624, DW_AT_name("numFrames")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("numFrames")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$624, DW_AT_decl_column(0x1e)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$625, DW_AT_name("isAllocated")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("isAllocated")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$625, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$290

	.dwattr $C$DW$T$290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x10)
$C$DW$T$895	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_FrameQueue")
	.dwattr $C$DW$T$895, DW_AT_type(*$C$DW$T$290)
	.dwattr $C$DW$T$895, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$895, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$895, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$T$895, DW_AT_decl_column(0x03)
$C$DW$T$896	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_FrameQueue")
	.dwattr $C$DW$T$896, DW_AT_type(*$C$DW$T$895)
	.dwattr $C$DW$T$896, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$896, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$896, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$896, DW_AT_decl_column(0x21)

$C$DW$T$285	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$285, DW_AT_name("FrameQ_Interface_Tag")
	.dwattr $C$DW$T$285, DW_AT_byte_size(0x01)
$C$DW$626	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$626, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$626, DW_AT_decl_column(0x05)
$C$DW$627	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$627, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0x190)
	.dwattr $C$DW$627, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$285

	.dwattr $C$DW$T$285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$285, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$285, DW_AT_decl_column(0x0e)
$C$DW$T$286	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Interface")
	.dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$286, DW_AT_decl_line(0x191)
	.dwattr $C$DW$T$286, DW_AT_decl_column(0x03)

$C$DW$T$300	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$300, DW_AT_name("FrameQ_ModuleObject_Tag")
	.dwattr $C$DW$T$300, DW_AT_byte_size(0x44)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$628, DW_AT_name("refCount")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$628, DW_AT_decl_line(0x64)
	.dwattr $C$DW$628, DW_AT_decl_column(0x19)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$629, DW_AT_name("nameServer")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$629, DW_AT_decl_line(0x66)
	.dwattr $C$DW$629, DW_AT_decl_column(0x1b)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$630, DW_AT_name("gate")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$630, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$630, DW_AT_decl_column(0x1b)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$631, DW_AT_name("objList")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$631, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$631, DW_AT_decl_column(0x1b)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$294)
	.dwattr $C$DW$632, DW_AT_name("listLock")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$632, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$632, DW_AT_decl_column(0x1b)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$633, DW_AT_name("cfg")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$633, DW_AT_decl_line(0x70)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1b)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$634, DW_AT_name("defaultCfg")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$634, DW_AT_decl_line(0x72)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1b)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$635, DW_AT_name("defInstParams")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("defInstParams")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$635, DW_AT_decl_line(0x74)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$300

	.dwattr $C$DW$T$300, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$300, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$300, DW_AT_decl_column(0x10)
$C$DW$T$897	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ModuleObject")
	.dwattr $C$DW$T$897, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$897, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$897, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$897, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$897, DW_AT_decl_column(0x03)
$C$DW$T$898	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$898, DW_AT_type(*$C$DW$T$897)
	.dwattr $C$DW$T$898, DW_AT_address_class(0x20)
$C$DW$T$899	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$899, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$899, DW_AT_address_class(0x20)
$C$DW$T$900	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$900, DW_AT_type(*$C$DW$T$899)
	.dwattr $C$DW$T$900, DW_AT_address_class(0x20)

$C$DW$T$301	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$301, DW_AT_name("FrameQ_NameServerEntry_tag")
	.dwattr $C$DW$T$301, DW_AT_byte_size(0x38)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$636, DW_AT_name("interfaceType")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0xff)
	.dwattr $C$DW$636, DW_AT_decl_column(0x0b)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$243)
	.dwattr $C$DW$637, DW_AT_name("instParams")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x103)
	.dwattr $C$DW$637, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$301

	.dwattr $C$DW$T$301, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$301, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$T$301, DW_AT_decl_column(0x10)
$C$DW$T$901	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NameServerEntry")
	.dwattr $C$DW$T$901, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$T$901, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$901, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$901, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$901, DW_AT_decl_column(0x02)
$C$DW$T$902	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$902, DW_AT_type(*$C$DW$T$901)
	.dwattr $C$DW$T$902, DW_AT_address_class(0x20)

$C$DW$T$314	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$314, DW_AT_name("FrameQ_NotifyParams_Tag")
	.dwattr $C$DW$T$314, DW_AT_byte_size(0x14)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$638, DW_AT_name("notifyType")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1c)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$639, DW_AT_name("watermark")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$639, DW_AT_decl_column(0x1d)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$640, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$640, DW_AT_decl_column(0x1d)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$641, DW_AT_name("cbContext")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$641, DW_AT_decl_column(0x1d)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$642, DW_AT_name("cbClientHandle")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("cbClientHandle")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$314

	.dwattr $C$DW$T$314, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x10)
$C$DW$T$384	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyParams")
	.dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$384, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$384, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$T$384, DW_AT_decl_column(0x03)
$C$DW$T$904	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_ShMem_NotifyParams")
	.dwattr $C$DW$T$904, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$904, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$904, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ_ShMem.h")
	.dwattr $C$DW$T$904, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$904, DW_AT_decl_column(0x21)
$C$DW$T$385	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$384)
	.dwattr $C$DW$T$385, DW_AT_address_class(0x20)
$C$DW$T$905	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$905, DW_AT_type(*$C$DW$T$385)

$C$DW$T$302	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$302, DW_AT_name("FrameQ_NotifyType_Tag")
	.dwattr $C$DW$T$302, DW_AT_byte_size(0x01)
$C$DW$643	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$643, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x140)
	.dwattr $C$DW$643, DW_AT_decl_column(0x05)
$C$DW$644	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$644, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x142)
	.dwattr $C$DW$644, DW_AT_decl_column(0x05)
$C$DW$645	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$645, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x144)
	.dwattr $C$DW$645, DW_AT_decl_column(0x05)
$C$DW$646	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$646, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x149)
	.dwattr $C$DW$646, DW_AT_decl_column(0x05)
$C$DW$647	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$647, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$647, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$302

	.dwattr $C$DW$T$302, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x0e)
$C$DW$T$303	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_NotifyType")
	.dwattr $C$DW$T$303, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$303, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$303, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0x153)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x03)

$C$DW$T$319	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$319, DW_AT_name("FrameQ_Obj_Tag")
	.dwattr $C$DW$T$319, DW_AT_byte_size(0x68)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$648, DW_AT_name("listElem")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$648, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$648, DW_AT_decl_column(0x1a)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$251)
	.dwattr $C$DW$649, DW_AT_name("name")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$649, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$649, DW_AT_decl_column(0x15)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$650, DW_AT_name("gate")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$650, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$650, DW_AT_decl_column(0x17)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$651, DW_AT_name("handle")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("handle")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$651, DW_AT_decl_line(0x81)
	.dwattr $C$DW$651, DW_AT_decl_column(0x1d)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$652, DW_AT_name("instId")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("instId")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$652, DW_AT_decl_line(0x83)
	.dwattr $C$DW$652, DW_AT_decl_column(0x1d)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$653, DW_AT_name("notifyId")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$653, DW_AT_decl_line(0x85)
	.dwattr $C$DW$653, DW_AT_decl_column(0x1d)
$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$654, DW_AT_name("objType")
	.dwattr $C$DW$654, DW_AT_TI_symbol_name("objType")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$654, DW_AT_decl_line(0x89)
	.dwattr $C$DW$654, DW_AT_decl_column(0x0c)
$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$655, DW_AT_name("objMode")
	.dwattr $C$DW$655, DW_AT_TI_symbol_name("objMode")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$655, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$655, DW_AT_decl_column(0x0c)
$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$656, DW_AT_name("interfaceType")
	.dwattr $C$DW$656, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$656, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$656, DW_AT_decl_column(0x1d)
$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$657, DW_AT_name("ctrlStructCacheFlag")
	.dwattr $C$DW$657, DW_AT_TI_symbol_name("ctrlStructCacheFlag")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$657, DW_AT_decl_line(0x91)
	.dwattr $C$DW$657, DW_AT_decl_column(0x1d)
$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$260)
	.dwattr $C$DW$658, DW_AT_name("frmHdrBufCacheFlag")
	.dwattr $C$DW$658, DW_AT_TI_symbol_name("frmHdrBufCacheFlag")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$658, DW_AT_decl_line(0x95)
	.dwattr $C$DW$658, DW_AT_decl_column(0x1d)
$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$659, DW_AT_name("frmBufCacheFlag")
	.dwattr $C$DW$659, DW_AT_TI_symbol_name("frmBufCacheFlag")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$659, DW_AT_decl_line(0x99)
	.dwattr $C$DW$659, DW_AT_decl_column(0x1d)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$660, DW_AT_name("bufCpuAccessFlag")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("bufCpuAccessFlag")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$660, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$660, DW_AT_decl_column(0x1d)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$255)
	.dwattr $C$DW$661, DW_AT_name("notifyRegId")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("notifyRegId")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$661, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$661, DW_AT_decl_column(0x0c)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$662, DW_AT_name("params")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("params")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$662, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$662, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$319

	.dwattr $C$DW$T$319, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$319, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$319, DW_AT_decl_column(0x10)
$C$DW$T$322	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Obj")
	.dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$322, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$322, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$322, DW_AT_decl_column(0x03)
$C$DW$T$323	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$T$323, DW_AT_address_class(0x20)

$C$DW$T$324	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$324, DW_AT_name("FrameQ_Object")
	.dwattr $C$DW$T$324, DW_AT_byte_size(0x08)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$321)
	.dwattr $C$DW$663, DW_AT_name("fxns")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$663, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$663, DW_AT_decl_column(0x12)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$323)
	.dwattr $C$DW$664, DW_AT_name("obj")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$664, DW_AT_decl_line(0xac)
	.dwattr $C$DW$664, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$324

	.dwattr $C$DW$T$324, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$324, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$T$324, DW_AT_decl_column(0x10)
$C$DW$T$909	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Object")
	.dwattr $C$DW$T$909, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$T$909, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$909, DW_AT_decl_file("FrameQ.c")
	.dwattr $C$DW$T$909, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$909, DW_AT_decl_column(0x03)
$C$DW$T$910	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$910, DW_AT_type(*$C$DW$T$909)
	.dwattr $C$DW$T$910, DW_AT_address_class(0x20)
$C$DW$T$304	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$T$304, DW_AT_address_class(0x20)
$C$DW$T$305	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_Handle")
	.dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$305, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0x135)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x20)
$C$DW$T$911	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$911, DW_AT_type(*$C$DW$T$305)
$C$DW$T$913	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$913, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$T$913, DW_AT_address_class(0x20)
$C$DW$T$914	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$914, DW_AT_type(*$C$DW$T$913)

$C$DW$T$921	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$921, DW_AT_name("FrameQ_OpenMode_Tag")
	.dwattr $C$DW$T$921, DW_AT_byte_size(0x01)
$C$DW$665	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$665, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x159)
	.dwattr $C$DW$665, DW_AT_decl_column(0x05)
$C$DW$666	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$666, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$666, DW_AT_decl_column(0x05)
$C$DW$667	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQ_MODE_READER"), DW_AT_const_value(0x02)
	.dwattr $C$DW$667, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$667, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$921

	.dwattr $C$DW$T$921, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$921, DW_AT_decl_line(0x158)
	.dwattr $C$DW$T$921, DW_AT_decl_column(0x0e)
$C$DW$T$922	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_OpenMode")
	.dwattr $C$DW$T$922, DW_AT_type(*$C$DW$T$921)
	.dwattr $C$DW$T$922, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$922, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$T$922, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$T$922, DW_AT_decl_column(0x03)

$C$DW$T$326	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$326, DW_AT_name("FrameQ_OpenParams_tag")
	.dwattr $C$DW$T$326, DW_AT_byte_size(0x10)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$668, DW_AT_name("commonOpenParams")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("commonOpenParams")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x99)
	.dwattr $C$DW$668, DW_AT_decl_column(0x21)
	.dwendtag $C$DW$T$326

	.dwattr $C$DW$T$326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x10)
$C$DW$T$923	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQ_OpenParams")
	.dwattr $C$DW$T$923, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$T$923, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$923, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_FrameQ.h")
	.dwattr $C$DW$T$923, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$923, DW_AT_decl_column(0x03)
$C$DW$T$924	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$924, DW_AT_type(*$C$DW$T$923)
	.dwattr $C$DW$T$924, DW_AT_address_class(0x20)

$C$DW$T$328	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$328, DW_AT_name("FrameQ_Params")
	.dwattr $C$DW$T$328, DW_AT_byte_size(0x18)
$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$669, DW_AT_name("commonCreateParams")
	.dwattr $C$DW$669, DW_AT_TI_symbol_name("commonCreateParams")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQ.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$669, DW_AT_decl_column(0x1b)
$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$257)
	.dwattr $C$DW$670, DW_AT_name("impParams")
