;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:45 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("FrameQBufMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$577, DW_AT_decl_line(0x95)
	.dwattr $C$DW$577, DW_AT_decl_column(0x05)
$C$DW$578	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$578, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x97)
	.dwattr $C$DW$578, DW_AT_decl_column(0x05)
$C$DW$579	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$579, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x99)
	.dwattr $C$DW$579, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1095

	.dwattr $C$DW$T$1095, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1095, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1095, DW_AT_decl_column(0x0e)
$C$DW$T$1096	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$1095)
	.dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1096, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1096, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)

$C$DW$T$1097	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1097, DW_AT_byte_size(0x04)
$C$DW$580	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$580, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$580, DW_AT_decl_column(0x05)
$C$DW$581	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$581, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$581, DW_AT_decl_column(0x05)
$C$DW$582	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$582, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$582, DW_AT_decl_column(0x05)
$C$DW$583	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$583, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$583, DW_AT_decl_column(0x05)
$C$DW$584	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$584, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$584, DW_AT_decl_column(0x05)
$C$DW$585	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$585, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0xab)
	.dwattr $C$DW$585, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1097

	.dwattr $C$DW$T$1097, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1097, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1097, DW_AT_decl_column(0x0e)
$C$DW$T$1098	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1098, DW_AT_type(*$C$DW$T$1097)
	.dwattr $C$DW$T$1098, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1098, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1098, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1098, DW_AT_decl_column(0x03)

$C$DW$T$1099	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1099, DW_AT_byte_size(0x01)
$C$DW$586	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$586, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$586, DW_AT_decl_column(0x05)
$C$DW$587	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$587, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$587, DW_AT_decl_column(0x05)
$C$DW$588	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$588, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$588, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1099

	.dwattr $C$DW$T$1099, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1099, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1099, DW_AT_decl_column(0x0e)
$C$DW$T$1100	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1100, DW_AT_type(*$C$DW$T$1099)
	.dwattr $C$DW$T$1100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1100, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1100, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1100, DW_AT_decl_column(0x03)

$C$DW$T$298	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$298, DW_AT_byte_size(0x04)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$297)
	.dwattr $C$DW$589, DW_AT_name("fxns")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("fxns")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$589, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$298

	.dwattr $C$DW$T$298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x10)
$C$DW$T$1101	.dwtag  DW_TAG_typedef, DW_AT_name("IFrameQBufMgr_Object")
	.dwattr $C$DW$T$1101, DW_AT_type(*$C$DW$T$298)
	.dwattr $C$DW$T$1101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1101, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$1101, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1101, DW_AT_decl_column(0x02)
$C$DW$T$1102	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1102, DW_AT_type(*$C$DW$T$1101)
	.dwattr $C$DW$T$1102, DW_AT_address_class(0x20)
$C$DW$T$1103	.dwtag  DW_TAG_typedef, DW_AT_name("IFrameQBufMgr_Handle")
	.dwattr $C$DW$T$1103, DW_AT_type(*$C$DW$T$1102)
	.dwattr $C$DW$T$1103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1103, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/IFrameQBufMgr.h")
	.dwattr $C$DW$T$1103, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$1103, DW_AT_decl_column(0x20)

$C$DW$T$303	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x08)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$590, DW_AT_name("length")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0xad)
	.dwattr $C$DW$590, DW_AT_decl_column(0x16)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$591, DW_AT_name("elem")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0xad)
	.dwattr $C$DW$591, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$303

	.dwattr $C$DW$T$303, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$303, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$303, DW_AT_decl_column(0x10)
$C$DW$T$1107	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1107, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$T$1107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1107, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1107, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1107, DW_AT_decl_column(0x43)
$C$DW$T$1108	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1108, DW_AT_type(*$C$DW$T$1107)
	.dwattr $C$DW$T$1108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1108, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1108, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1108, DW_AT_decl_column(0x30)
$C$DW$T$1109	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1109, DW_AT_type(*$C$DW$T$1108)
	.dwattr $C$DW$T$1109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1109, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1109, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1109, DW_AT_decl_column(0x2c)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$592, DW_AT_name("length")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$592, DW_AT_decl_column(0x16)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$593, DW_AT_name("elem")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$593, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$1110	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1110, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$1110, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1110, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1110, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1110, DW_AT_decl_column(0x43)
$C$DW$T$1111	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1111, DW_AT_type(*$C$DW$T$1110)
	.dwattr $C$DW$T$1111, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1111, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1111, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1111, DW_AT_decl_column(0x2f)
$C$DW$T$1112	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1112, DW_AT_type(*$C$DW$T$1111)
	.dwattr $C$DW$T$1112, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1112, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1112, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1112, DW_AT_decl_column(0x2b)

$C$DW$T$307	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$307, DW_AT_byte_size(0x08)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$594, DW_AT_name("length")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$594, DW_AT_decl_column(0x16)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$595, DW_AT_name("elem")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$595, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$307

	.dwattr $C$DW$T$307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$307, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$307, DW_AT_decl_column(0x10)
$C$DW$T$1113	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1113, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$T$1113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1113, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1113, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1113, DW_AT_decl_column(0x42)
$C$DW$T$1114	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1114, DW_AT_type(*$C$DW$T$1113)
	.dwattr $C$DW$T$1114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1114, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1114, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1114, DW_AT_decl_column(0x2b)
$C$DW$T$1115	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1115, DW_AT_type(*$C$DW$T$1114)
	.dwattr $C$DW$T$1115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1115, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1115, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1115, DW_AT_decl_column(0x27)

$C$DW$T$310	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$310, DW_AT_byte_size(0x08)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$596, DW_AT_name("length")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x197)
	.dwattr $C$DW$596, DW_AT_decl_column(0x16)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$309)
	.dwattr $C$DW$597, DW_AT_name("elem")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x197)
	.dwattr $C$DW$597, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$310

	.dwattr $C$DW$T$310, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$310, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$310, DW_AT_decl_column(0x10)
$C$DW$T$1116	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1116, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$T$1116, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1116, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1116, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1116, DW_AT_decl_column(0x43)
$C$DW$T$1117	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1117, DW_AT_type(*$C$DW$T$1116)
	.dwattr $C$DW$T$1117, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1117, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1117, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1117, DW_AT_decl_column(0x2c)
$C$DW$T$1118	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1118, DW_AT_type(*$C$DW$T$1117)
	.dwattr $C$DW$T$1118, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1118, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1118, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1118, DW_AT_decl_column(0x28)

$C$DW$T$312	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$312, DW_AT_byte_size(0x14)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$598, DW_AT_name("shMemParams")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("shMemParams")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x112)
	.dwattr $C$DW$598, DW_AT_decl_column(0x37)
	.dwendtag $C$DW$T$312

	.dwattr $C$DW$T$312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$312, DW_AT_decl_line(0x111)
	.dwattr $C$DW$T$312, DW_AT_decl_column(0x08)

$C$DW$T$316	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$316, DW_AT_byte_size(0x04)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$599, DW_AT_name("f")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0xac)
	.dwattr $C$DW$599, DW_AT_decl_column(0x0f)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$600, DW_AT_name("a")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0xad)
	.dwattr $C$DW$600, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$316

	.dwattr $C$DW$T$316, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$316, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$316, DW_AT_decl_column(0x0f)
$C$DW$T$1119	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1119, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$T$1119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1119, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1119, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1119, DW_AT_decl_column(0x03)

$C$DW$T$1120	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1120, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1120, DW_AT_byte_size(0x01)
$C$DW$601	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$601, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$601, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1120

	.dwattr $C$DW$T$1120, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1120, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1120, DW_AT_decl_column(0x0e)
$C$DW$T$1121	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1121, DW_AT_type(*$C$DW$T$1120)
	.dwattr $C$DW$T$1121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1121, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1121, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1121, DW_AT_decl_column(0x03)

$C$DW$T$325	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$325, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$325, DW_AT_byte_size(0x10)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$602, DW_AT_name("gate")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x87)
	.dwattr $C$DW$602, DW_AT_decl_column(0x1b)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$603, DW_AT_name("numProcessors")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$603, DW_AT_decl_column(0x0f)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$604, DW_AT_name("procIds")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$604, DW_AT_decl_column(0x0f)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$605, DW_AT_name("drvHandles")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x93)
	.dwattr $C$DW$605, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$325

	.dwattr $C$DW$T$325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x10)
$C$DW$T$1122	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1122, DW_AT_type(*$C$DW$T$325)
	.dwattr $C$DW$T$1122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1122, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1122, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1122, DW_AT_decl_column(0x03)

$C$DW$T$1123	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1123, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1123, DW_AT_byte_size(0x01)
$C$DW$606	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$606, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x61)
	.dwattr $C$DW$606, DW_AT_decl_column(0x05)
$C$DW$607	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$607, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0x63)
	.dwattr $C$DW$607, DW_AT_decl_column(0x05)
$C$DW$608	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$608, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0x65)
	.dwattr $C$DW$608, DW_AT_decl_column(0x05)
$C$DW$609	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$609, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$609, DW_AT_decl_column(0x05)
$C$DW$610	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$610, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$610, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1123

	.dwattr $C$DW$T$1123, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1123, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1123, DW_AT_decl_column(0x0e)
$C$DW$T$1124	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1124, DW_AT_type(*$C$DW$T$1123)
	.dwattr $C$DW$T$1124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1124, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1124, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1124, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$1125	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$1125, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$1125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1125, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1125, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$1125, DW_AT_decl_column(0x27)
$C$DW$T$1126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1126, DW_AT_type(*$C$DW$T$1125)
	.dwattr $C$DW$T$1126, DW_AT_address_class(0x20)
$C$DW$T$1127	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$1127, DW_AT_type(*$C$DW$T$1126)
	.dwattr $C$DW$T$1127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1127, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1127, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$1127, DW_AT_decl_column(0x22)

$C$DW$T$338	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$338, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x2c)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$611, DW_AT_name("name")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$611, DW_AT_decl_column(0x14)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$612, DW_AT_name("eventNo")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$612, DW_AT_decl_column(0x14)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$613, DW_AT_name("openFlag")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$613, DW_AT_decl_column(0x14)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$614, DW_AT_name("creatorProcId")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$614, DW_AT_decl_column(0x14)
$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$615, DW_AT_name("sharedAddr")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$615, DW_AT_decl_column(0x14)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$616, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$616, DW_AT_decl_column(0x14)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$617, DW_AT_name("gate")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0xac)
	.dwattr $C$DW$617, DW_AT_decl_column(0x14)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$618, DW_AT_name("cacheFlags")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0xae)
	.dwattr $C$DW$618, DW_AT_decl_column(0x14)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$619, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$619, DW_AT_decl_column(0x14)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$620, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$620, DW_AT_decl_column(0x14)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$621, DW_AT_name("regionId")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$621, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x10)
$C$DW$T$1128	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1128, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$1128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1128, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1128, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1128, DW_AT_decl_column(0x03)

$C$DW$T$342	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$342, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$342, DW_AT_byte_size(0x1c)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$622, DW_AT_name("clientHandle")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$622, DW_AT_decl_column(0x12)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$623, DW_AT_name("procId")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$623, DW_AT_decl_column(0x12)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$624, DW_AT_name("notifyType")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$624, DW_AT_decl_column(0x12)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$625, DW_AT_name("fxnPtr")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$625, DW_AT_decl_column(0x1d)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$626, DW_AT_name("cbContext")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$626, DW_AT_decl_column(0x12)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$627, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$627, DW_AT_decl_column(0x12)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$628, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$628, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$342

	.dwattr $C$DW$T$342, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x10)
$C$DW$T$1129	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1129, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$1129, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1129, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1129, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1129, DW_AT_decl_column(0x03)

$C$DW$T$481	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$481, DW_AT_name("FrameQBufMgr_AddrType_Tag")
	.dwattr $C$DW$T$481, DW_AT_byte_size(0x01)
$C$DW$629	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Virtual"), DW_AT_const_value(0x00)
	.dwattr $C$DW$629, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x163)
	.dwattr $C$DW$629, DW_AT_decl_column(0x05)
$C$DW$630	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_Portable"), DW_AT_const_value(0x01)
	.dwattr $C$DW$630, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x167)
	.dwattr $C$DW$630, DW_AT_decl_column(0x05)
$C$DW$631	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_AddrType_EndValue"), DW_AT_const_value(0x02)
	.dwattr $C$DW$631, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$631, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$481

	.dwattr $C$DW$T$481, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$481, DW_AT_decl_line(0x162)
	.dwattr $C$DW$T$481, DW_AT_decl_column(0x0e)
$C$DW$T$482	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_AddrType")
	.dwattr $C$DW$T$482, DW_AT_type(*$C$DW$T$481)
	.dwattr $C$DW$T$482, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$482, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$482, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$482, DW_AT_decl_column(0x02)
$C$DW$T$1130	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1130, DW_AT_type(*$C$DW$T$482)

$C$DW$T$348	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$348, DW_AT_name("FrameQBufMgr_Attrs_Tag")
	.dwattr $C$DW$T$348, DW_AT_byte_size(0x48)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$632, DW_AT_name("status")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("status")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$632, DW_AT_decl_column(0x1a)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$633, DW_AT_name("version")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("version")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1a)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$634, DW_AT_name("localProtect")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1a)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$635, DW_AT_name("remoteProtect")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1a)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$636, DW_AT_name("gateMPAddr")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("gateMPAddr")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$636, DW_AT_decl_column(0x1a)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$637, DW_AT_name("name")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$637, DW_AT_decl_column(0x1a)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$344)
	.dwattr $C$DW$638, DW_AT_name("sharedDataBufAddr")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("sharedDataBufAddr")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$638, DW_AT_decl_column(0x17)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$639, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$639, DW_AT_decl_column(0x18)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$640, DW_AT_name("numFreeFramePools")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("numFreeFramePools")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$640, DW_AT_decl_column(0x17)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$641, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$641, DW_AT_decl_column(0x1a)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$642, DW_AT_name("entryId")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("entryId")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$348

	.dwattr $C$DW$T$348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x10)
$C$DW$T$1132	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Attrs")
	.dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$T$1132, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1132, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1132, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$T$1132, DW_AT_decl_column(0x03)
$C$DW$T$1133	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Attrs")
	.dwattr $C$DW$T$1133, DW_AT_type(*$C$DW$T$1132)
	.dwattr $C$DW$T$1133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1133, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1133, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$1133, DW_AT_decl_column(0x27)

$C$DW$T$483	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$483, DW_AT_name("FrameQBufMgr_BufType_Tag")
	.dwattr $C$DW$T$483, DW_AT_byte_size(0x01)
$C$DW$643	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEHEADER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$643, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x157)
	.dwattr $C$DW$643, DW_AT_decl_column(0x05)
$C$DW$644	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_FRAMEBUF"), DW_AT_const_value(0x01)
	.dwattr $C$DW$644, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x159)
	.dwattr $C$DW$644, DW_AT_decl_column(0x05)
$C$DW$645	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUF_ENDVALUE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$645, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$645, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$483

	.dwattr $C$DW$T$483, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$483, DW_AT_decl_line(0x156)
	.dwattr $C$DW$T$483, DW_AT_decl_column(0x0e)
$C$DW$T$484	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_BufType")
	.dwattr $C$DW$T$484, DW_AT_type(*$C$DW$T$483)
	.dwattr $C$DW$T$484, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$484, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$484, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$484, DW_AT_decl_column(0x02)

$C$DW$T$349	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$349, DW_AT_name("FrameQBufMgr_CommonOpenParams_Tag")
	.dwattr $C$DW$T$349, DW_AT_byte_size(0x0c)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$646, DW_AT_name("name")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$646, DW_AT_decl_column(0x11)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$647, DW_AT_name("cpuAccessFlags")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("cpuAccessFlags")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$647, DW_AT_decl_column(0x11)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$648, DW_AT_name("sharedAddr")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$648, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$349

	.dwattr $C$DW$T$349, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$349, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$T$349, DW_AT_decl_column(0x10)
$C$DW$T$397	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CommonOpenParams")
	.dwattr $C$DW$T$397, DW_AT_type(*$C$DW$T$349)
	.dwattr $C$DW$T$397, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$397, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$397, DW_AT_decl_line(0x1cc)
	.dwattr $C$DW$T$397, DW_AT_decl_column(0x03)

$C$DW$T$350	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$350, DW_AT_name("FrameQBufMgr_Config_Tag")
	.dwattr $C$DW$T$350, DW_AT_byte_size(0x0c)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$649, DW_AT_name("eventNo")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0c)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$650, DW_AT_name("maxInstances")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x19e)
	.dwattr $C$DW$650, DW_AT_decl_column(0x0c)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$651, DW_AT_name("usedefaultgate")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("usedefaultgate")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$651, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$350

	.dwattr $C$DW$T$350, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x10)
$C$DW$T$375	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Config")
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$350)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$375, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$T$375, DW_AT_decl_column(0x03)
$C$DW$T$1135	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_Config")
	.dwattr $C$DW$T$1135, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$1135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1135, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1135, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$1135, DW_AT_decl_column(0x27)
$C$DW$T$1136	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$1135)
	.dwattr $C$DW$T$1136, DW_AT_address_class(0x20)
$C$DW$T$1137	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1137, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$T$1137, DW_AT_address_class(0x20)
$C$DW$T$1138	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$1137)

$C$DW$T$1141	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1141, DW_AT_name("FrameQBufMgr_CpuAccessFlags_Tag")
	.dwattr $C$DW$T$1141, DW_AT_byte_size(0x04)
$C$DW$652	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF0_CPUACCESS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$652, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0x131)
	.dwattr $C$DW$652, DW_AT_decl_column(0x09)
$C$DW$653	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF1_CPUACCESS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$653, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x135)
	.dwattr $C$DW$653, DW_AT_decl_column(0x09)
$C$DW$654	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF2_CPUACCESS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$654, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x139)
	.dwattr $C$DW$654, DW_AT_decl_column(0x09)
$C$DW$655	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF3_CPUACCESS"), DW_AT_const_value(0x80000)
	.dwattr $C$DW$655, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$655, DW_AT_decl_column(0x09)
$C$DW$656	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF4_CPUACCESS"), DW_AT_const_value(0x100000)
	.dwattr $C$DW$656, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x141)
	.dwattr $C$DW$656, DW_AT_decl_column(0x09)
$C$DW$657	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF5_CPUACCESS"), DW_AT_const_value(0x200000)
	.dwattr $C$DW$657, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x145)
	.dwattr $C$DW$657, DW_AT_decl_column(0x09)
$C$DW$658	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF6_CPUACCESS"), DW_AT_const_value(0x400000)
	.dwattr $C$DW$658, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x149)
	.dwattr $C$DW$658, DW_AT_decl_column(0x09)
$C$DW$659	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_FRAMEBUF7_CPUACCESS"), DW_AT_const_value(0x800000)
	.dwattr $C$DW$659, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$659, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$1141

	.dwattr $C$DW$T$1141, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1141, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$1141, DW_AT_decl_column(0x0e)
$C$DW$T$1142	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CpuAccessFlags")
	.dwattr $C$DW$T$1142, DW_AT_type(*$C$DW$T$1141)
	.dwattr $C$DW$T$1142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1142, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1142, DW_AT_decl_line(0x151)
	.dwattr $C$DW$T$1142, DW_AT_decl_column(0x03)

$C$DW$T$353	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$353, DW_AT_name("FrameQBufMgr_CreateParams_Tag")
	.dwattr $C$DW$T$353, DW_AT_byte_size(0x10)
$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$660, DW_AT_name("size")
	.dwattr $C$DW$660, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$660, DW_AT_decl_column(0x0c)
$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$661, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$661, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$661, DW_AT_decl_column(0x1c)
$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$662, DW_AT_name("name")
	.dwattr $C$DW$662, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$662, DW_AT_decl_column(0x0c)
$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$663, DW_AT_name("openFlag")
	.dwattr $C$DW$663, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x1b5)
	.dwattr $C$DW$663, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$353

	.dwattr $C$DW$T$353, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$353, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$353, DW_AT_decl_column(0x10)
$C$DW$T$399	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_CreateParams")
	.dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$399, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$399, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$T$399, DW_AT_decl_column(0x03)

$C$DW$T$354	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$354, DW_AT_name("FrameQBufMgr_FrameBufParams_Tag")
	.dwattr $C$DW$T$354, DW_AT_byte_size(0x14)
$C$DW$664	.dwtag  DW_TAG_member
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$664, DW_AT_name("size")
	.dwattr $C$DW$664, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$664, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$664, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$664, DW_AT_decl_column(0x0c)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$665, DW_AT_name("pixelFormat")
	.dwattr $C$DW$665, DW_AT_TI_symbol_name("pixelFormat")
	.dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$665, DW_AT_decl_column(0x0c)
$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$666, DW_AT_name("height")
	.dwattr $C$DW$666, DW_AT_TI_symbol_name("height")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$666, DW_AT_decl_column(0x0c)
$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$667, DW_AT_name("width")
	.dwattr $C$DW$667, DW_AT_TI_symbol_name("width")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$667, DW_AT_decl_column(0x0c)
$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$668, DW_AT_name("align")
	.dwattr $C$DW$668, DW_AT_TI_symbol_name("align")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$668, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$354

	.dwattr $C$DW$T$354, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$354, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$354, DW_AT_decl_column(0x10)
$C$DW$T$408	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufParams")
	.dwattr $C$DW$T$408, DW_AT_type(*$C$DW$T$354)
	.dwattr $C$DW$T$408, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$408, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$408, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$T$408, DW_AT_decl_column(0x02)
$C$DW$T$409	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$T$409, DW_AT_address_class(0x20)

$C$DW$T$410	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$410, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$410, DW_AT_byte_size(0x100)
$C$DW$669	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$669, DW_AT_upper_bound(0x3f)
	.dwendtag $C$DW$T$410


$C$DW$T$1143	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1143, DW_AT_name("FrameQBufMgr_FrameBufferInterface_Tag")
	.dwattr $C$DW$T$1143, DW_AT_byte_size(0x01)
$C$DW$670	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$670, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$670, DW_AT_decl_column(0x05)
$C$DW$671	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_TILERMEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$671, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x191)
	.dwattr $C$DW$671, DW_AT_decl_column(0x05)
$C$DW$672	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_BUFINTERFACE_NONE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$672, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x194)
	.dwattr $C$DW$672, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1143

	.dwattr $C$DW$T$1143, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1143, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$T$1143, DW_AT_decl_column(0x0e)
$C$DW$T$1144	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameBufferInterface")
	.dwattr $C$DW$T$1144, DW_AT_type(*$C$DW$T$1143)
	.dwattr $C$DW$T$1144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1144, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1144, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$1144, DW_AT_decl_column(0x03)

$C$DW$T$1145	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1145, DW_AT_name("FrameQBufMgr_FrameHeaderInterface_Tag")
	.dwattr $C$DW$T$1145, DW_AT_byte_size(0x01)
$C$DW$673	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$673, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x181)
	.dwattr $C$DW$673, DW_AT_decl_column(0x05)
$C$DW$674	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_HDRINTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$674, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x185)
	.dwattr $C$DW$674, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1145

	.dwattr $C$DW$T$1145, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1145, DW_AT_decl_line(0x180)
	.dwattr $C$DW$T$1145, DW_AT_decl_column(0x0e)
$C$DW$T$1146	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FrameHeaderInterface")
	.dwattr $C$DW$T$1146, DW_AT_type(*$C$DW$T$1145)
	.dwattr $C$DW$T$1146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1146, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$1146, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$1146, DW_AT_decl_column(0x03)

$C$DW$T$369	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$369, DW_AT_name("FrameQBufMgr_FreeFramePoolObj_Tag")
	.dwattr $C$DW$T$369, DW_AT_byte_size(0x2b4)
$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$675, DW_AT_name("numFrms")
	.dwattr $C$DW$675, DW_AT_TI_symbol_name("numFrms")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$675, DW_AT_decl_column(0x15)
$C$DW$676	.dwtag  DW_TAG_member
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$676, DW_AT_name("freeFrms")
	.dwattr $C$DW$676, DW_AT_TI_symbol_name("freeFrms")
	.dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$676, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$676, DW_AT_decl_line(0xde)
	.dwattr $C$DW$676, DW_AT_decl_column(0x15)
$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$677, DW_AT_name("numFrmHdrBufs")
	.dwattr $C$DW$677, DW_AT_TI_symbol_name("numFrmHdrBufs")
	.dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$677, DW_AT_decl_column(0x15)
$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$678, DW_AT_name("freeFrmHdrBufs")
	.dwattr $C$DW$678, DW_AT_TI_symbol_name("freeFrmHdrBufs")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$678, DW_AT_decl_column(0x15)
$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$679, DW_AT_name("frmHdrBufSize")
	.dwattr $C$DW$679, DW_AT_TI_symbol_name("frmHdrBufSize")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$679, DW_AT_decl_column(0x15)
$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$680, DW_AT_name("numBufsInFrame")
	.dwattr $C$DW$680, DW_AT_TI_symbol_name("numBufsInFrame")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$680, DW_AT_decl_column(0x15)
$C$DW$681	.dwtag  DW_TAG_member
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$681, DW_AT_name("numDynamicHdrBufs")
	.dwattr $C$DW$681, DW_AT_TI_symbol_name("numDynamicHdrBufs")
	.dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$681, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$681, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$681, DW_AT_decl_column(0x15)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$682, DW_AT_name("freeDynamicHdrBufs")
	.dwattr $C$DW$682, DW_AT_TI_symbol_name("freeDynamicHdrBufs")
	.dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$682, DW_AT_decl_column(0x15)
$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$683, DW_AT_name("numDynamicFrames")
	.dwattr $C$DW$683, DW_AT_TI_symbol_name("numDynamicFrames")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$683, DW_AT_decl_column(0x15)
$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$684, DW_AT_name("freeDynamicFrames")
	.dwattr $C$DW$684, DW_AT_TI_symbol_name("freeDynamicFrames")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$684, DW_AT_decl_column(0x15)
$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$685, DW_AT_name("frmStartAddrp")
	.dwattr $C$DW$685, DW_AT_TI_symbol_name("frmStartAddrp")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$685, DW_AT_decl_column(0x15)
$C$DW$686	.dwtag  DW_TAG_member
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$686, DW_AT_name("frmEndAddrp")
	.dwattr $C$DW$686, DW_AT_TI_symbol_name("frmEndAddrp")
	.dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$686, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$686, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$686, DW_AT_decl_column(0x15)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$687, DW_AT_name("hdrBufStartAddrp")
	.dwattr $C$DW$687, DW_AT_TI_symbol_name("hdrBufStartAddrp")
	.dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$687, DW_AT_decl_column(0x15)
$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$688, DW_AT_name("hdrBufEndAddrp")
	.dwattr $C$DW$688, DW_AT_TI_symbol_name("hdrBufEndAddrp")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0xea)
	.dwattr $C$DW$688, DW_AT_decl_column(0x15)
$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$689, DW_AT_name("frmBufsStartAddrp")
	.dwattr $C$DW$689, DW_AT_TI_symbol_name("frmBufsStartAddrp")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$689, DW_AT_decl_column(0x15)
$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$690, DW_AT_name("frmBufsEndAddrp")
	.dwattr $C$DW$690, DW_AT_TI_symbol_name("frmBufsEndAddrp")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0xec)
	.dwattr $C$DW$690, DW_AT_decl_column(0x15)
$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$355)
	.dwattr $C$DW$691, DW_AT_name("frmBufSize")
	.dwattr $C$DW$691, DW_AT_TI_symbol_name("frmBufSize")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0xed)
	.dwattr $C$DW$691, DW_AT_decl_column(0x15)
$C$DW$692	.dwtag  DW_TAG_member
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$692, DW_AT_name("frmRefCnt")
	.dwattr $C$DW$692, DW_AT_TI_symbol_name("frmRefCnt")
	.dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$692, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$692, DW_AT_decl_line(0xee)
	.dwattr $C$DW$692, DW_AT_decl_column(0x15)
$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$693, DW_AT_name("dynFrame")
	.dwattr $C$DW$693, DW_AT_TI_symbol_name("dynFrame")
	.dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0xef)
	.dwattr $C$DW$693, DW_AT_decl_column(0x15)
$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$694, DW_AT_name("dynFrmRefCnt")
	.dwattr $C$DW$694, DW_AT_TI_symbol_name("dynFrmRefCnt")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$694, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$694, DW_AT_decl_column(0x15)
$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$358)
	.dwattr $C$DW$695, DW_AT_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$695, DW_AT_TI_symbol_name("hdrBuf_refCntIndex")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$695, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$695, DW_AT_decl_column(0x15)
$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$696, DW_AT_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$696, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndex")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$696, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$696, DW_AT_decl_column(0x15)
$C$DW$697	.dwtag  DW_TAG_member
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$357)
	.dwattr $C$DW$697, DW_AT_name("dynHdrBufs")
	.dwattr $C$DW$697, DW_AT_TI_symbol_name("dynHdrBufs")
	.dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$697, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$697, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$697, DW_AT_decl_column(0x15)
$C$DW$698	.dwtag  DW_TAG_member
	.dwattr $C$DW$698, DW_AT_type(*$C$DW$T$360)
	.dwattr $C$DW$698, DW_AT_name("hdrBufIsUsed")
	.dwattr $C$DW$698, DW_AT_TI_symbol_name("hdrBufIsUsed")
	.dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$698, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$698, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$698, DW_AT_decl_column(0x15)
$C$DW$699	.dwtag  DW_TAG_member
	.dwattr $C$DW$699, DW_AT_type(*$C$DW$T$361)
	.dwattr $C$DW$699, DW_AT_name("dynHdrBufIsUsed")
	.dwattr $C$DW$699, DW_AT_TI_symbol_name("dynHdrBufIsUsed")
	.dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x270]
	.dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$699, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$699, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$699, DW_AT_decl_column(0x15)
$C$DW$700	.dwtag  DW_TAG_member
	.dwattr $C$DW$700, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$700, DW_AT_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$700, DW_AT_TI_symbol_name("hdrBuf_refCntIndexType")
	.dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x272]
	.dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$700, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$700, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$700, DW_AT_decl_column(0x15)
$C$DW$701	.dwtag  DW_TAG_member
	.dwattr $C$DW$701, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$701, DW_AT_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$701, DW_AT_TI_symbol_name("dynHdrBuf_refCntIndexType")
	.dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b2]
	.dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$701, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$701, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$701, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$369

	.dwattr $C$DW$T$369, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$369, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$T$369, DW_AT_decl_column(0x10)
$C$DW$T$1147	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_FreeFramePoolObj")
	.dwattr $C$DW$T$1147, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$T$1147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1147, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1147, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$1147, DW_AT_decl_column(0x03)
$C$DW$T$1148	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ShMem_FreeFramePoolObj")
	.dwattr $C$DW$T$1148, DW_AT_type(*$C$DW$T$1147)
	.dwattr $C$DW$T$1148, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1148, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr_ShMem.h")
	.dwattr $C$DW$T$1148, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$1148, DW_AT_decl_column(0x27)

$C$DW$T$351	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$351, DW_AT_name("FrameQBufMgr_Interface_Tag")
	.dwattr $C$DW$T$351, DW_AT_byte_size(0x01)
$C$DW$702	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$702, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$702, DW_AT_decl_line(0x175)
	.dwattr $C$DW$702, DW_AT_decl_column(0x05)
$C$DW$703	.dwtag  DW_TAG_enumerator, DW_AT_name("FrameQBufMgr_INTERFACE_NONE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$703, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$703, DW_AT_decl_line(0x179)
	.dwattr $C$DW$703, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$351

	.dwattr $C$DW$T$351, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0x174)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x0e)
$C$DW$T$352	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_Interface")
	.dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$351)
	.dwattr $C$DW$T$352, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$352, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$T$352, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$352, DW_AT_decl_column(0x03)

$C$DW$T$378	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$378, DW_AT_name("FrameQBufMgr_ModuleObject_Tag")
	.dwattr $C$DW$T$378, DW_AT_byte_size(0x24c)
$C$DW$704	.dwtag  DW_TAG_member
	.dwattr $C$DW$704, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$704, DW_AT_name("refCount")
	.dwattr $C$DW$704, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$704, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$704, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$704, DW_AT_decl_column(0x19)
$C$DW$705	.dwtag  DW_TAG_member
	.dwattr $C$DW$705, DW_AT_type(*$C$DW$T$371)
	.dwattr $C$DW$705, DW_AT_name("nameServer")
	.dwattr $C$DW$705, DW_AT_TI_symbol_name("nameServer")
	.dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$705, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$705, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$705, DW_AT_decl_column(0x21)
$C$DW$706	.dwtag  DW_TAG_member
	.dwattr $C$DW$706, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$706, DW_AT_name("nameServerType")
	.dwattr $C$DW$706, DW_AT_TI_symbol_name("nameServerType")
	.dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$706, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$706, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$706, DW_AT_decl_column(0x21)
$C$DW$707	.dwtag  DW_TAG_member
	.dwattr $C$DW$707, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$707, DW_AT_name("gate")
	.dwattr $C$DW$707, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$707, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$707, DW_AT_decl_line(0x81)
	.dwattr $C$DW$707, DW_AT_decl_column(0x21)
$C$DW$708	.dwtag  DW_TAG_member
	.dwattr $C$DW$708, DW_AT_type(*$C$DW$T$331)
	.dwattr $C$DW$708, DW_AT_name("gateType")
	.dwattr $C$DW$708, DW_AT_TI_symbol_name("gateType")
	.dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$708, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$708, DW_AT_decl_line(0x83)
	.dwattr $C$DW$708, DW_AT_decl_column(0x21)
$C$DW$709	.dwtag  DW_TAG_member
	.dwattr $C$DW$709, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$709, DW_AT_name("objList")
	.dwattr $C$DW$709, DW_AT_TI_symbol_name("objList")
	.dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$709, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$709, DW_AT_decl_line(0x85)
	.dwattr $C$DW$709, DW_AT_decl_column(0x21)
$C$DW$710	.dwtag  DW_TAG_member
	.dwattr $C$DW$710, DW_AT_type(*$C$DW$T$318)
	.dwattr $C$DW$710, DW_AT_name("listLock")
	.dwattr $C$DW$710, DW_AT_TI_symbol_name("listLock")
	.dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$710, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$710, DW_AT_decl_line(0x87)
	.dwattr $C$DW$710, DW_AT_decl_column(0x21)
$C$DW$711	.dwtag  DW_TAG_member
	.dwattr $C$DW$711, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$711, DW_AT_name("cfg")
	.dwattr $C$DW$711, DW_AT_TI_symbol_name("cfg")
	.dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$711, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$711, DW_AT_decl_line(0x88)
	.dwattr $C$DW$711, DW_AT_decl_column(0x21)
$C$DW$712	.dwtag  DW_TAG_member
	.dwattr $C$DW$712, DW_AT_type(*$C$DW$T$375)
	.dwattr $C$DW$712, DW_AT_name("defaultCfg")
	.dwattr $C$DW$712, DW_AT_TI_symbol_name("defaultCfg")
	.dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$712, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$712, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$712, DW_AT_decl_column(0x21)
$C$DW$713	.dwtag  DW_TAG_member
	.dwattr $C$DW$713, DW_AT_type(*$C$DW$T$376)
	.dwattr $C$DW$713, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$713, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$713, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$713, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$713, DW_AT_decl_column(0x1d)
$C$DW$714	.dwtag  DW_TAG_member
	.dwattr $C$DW$714, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$714, DW_AT_name("isInstNoValid")
	.dwattr $C$DW$714, DW_AT_TI_symbol_name("isInstNoValid")
	.dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$714, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$714, DW_AT_decl_line(0x90)
	.dwattr $C$DW$714, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$378

	.dwattr $C$DW$T$378, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$378, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$378, DW_AT_decl_column(0x10)
$C$DW$T$1149	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_ModuleObject")
	.dwattr $C$DW$T$1149, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$1149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1149, DW_AT_decl_file("FrameQBufMgr.c")
	.dwattr $C$DW$T$1149, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1149, DW_AT_decl_column(0x03)
$C$DW$T$1150	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1150, DW_AT_type(*$C$DW$T$1149)
	.dwattr $C$DW$T$1150, DW_AT_address_class(0x20)
$C$DW$T$1151	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1151, DW_AT_type(*$C$DW$T$378)
	.dwattr $C$DW$T$1151, DW_AT_address_class(0x20)
$C$DW$T$1152	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1152, DW_AT_type(*$C$DW$T$1151)
	.dwattr $C$DW$T$1152, DW_AT_address_class(0x20)

$C$DW$T$379	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$379, DW_AT_name("FrameQBufMgr_NameServerEntry_tag")
	.dwattr $C$DW$T$379, DW_AT_byte_size(0x20)
$C$DW$715	.dwtag  DW_TAG_member
	.dwattr $C$DW$715, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$715, DW_AT_name("ctrlInterfaceType")
	.dwattr $C$DW$715, DW_AT_TI_symbol_name("ctrlInterfaceType")
	.dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$715, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$715, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$715, DW_AT_decl_column(0x0f)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$716, DW_AT_name("headerInterfaceType")
	.dwattr $C$DW$716, DW_AT_TI_symbol_name("headerInterfaceType")
	.dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$716, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$716, DW_AT_decl_column(0x0f)
$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$717, DW_AT_name("bufInterfaceType")
	.dwattr $C$DW$717, DW_AT_TI_symbol_name("bufInterfaceType")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$717, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$717, DW_AT_decl_column(0x0f)
$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$718, DW_AT_name("instParams")
	.dwattr $C$DW$718, DW_AT_TI_symbol_name("instParams")
	.dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$718, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0x113)
	.dwattr $C$DW$718, DW_AT_decl_column(0x04)
	.dwendtag $C$DW$T$379

	.dwattr $C$DW$T$379, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$379, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$379, DW_AT_decl_column(0x10)
$C$DW$T$1153	.dwtag  DW_TAG_typedef, DW_AT_name("FrameQBufMgr_NameServerEntry")
	.dwattr $C$DW$T$1153, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$T$1153, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1153, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/_FrameQBufMgr.h")
	.dwattr $C$DW$T$1153, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$1153, DW_AT_decl_column(0x02)
$C$DW$T$1154	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1154, DW_AT_type(*$C$DW$T$1153)
	.dwattr $C$DW$T$1154, DW_AT_address_class(0x20)

$C$DW$T$387	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$387, DW_AT_name("FrameQBufMgr_NotifyParams_Tag")
	.dwattr $C$DW$T$387, DW_AT_byte_size(0x14)
$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$719, DW_AT_name("notifyType")
	.dwattr $C$DW$719, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$719, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$719, DW_AT_decl_column(0x1d)
$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$322)
	.dwattr $C$DW$720, DW_AT_name("watermark")
	.dwattr $C$DW$720, DW_AT_TI_symbol_name("watermark")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$720, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$720, DW_AT_decl_column(0x1d)
$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$721, DW_AT_name("cbFxnPtr")
	.dwattr $C$DW$721, DW_AT_TI_symbol_name("cbFxnPtr")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$721, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/FrameQBufMgr.h")
