;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:40 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../RingIO.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$486, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x95)
	.dwattr $C$DW$486, DW_AT_decl_column(0x05)
$C$DW$487	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$487, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x97)
	.dwattr $C$DW$487, DW_AT_decl_column(0x05)
$C$DW$488	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$488, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x99)
	.dwattr $C$DW$488, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$954

	.dwattr $C$DW$T$954, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$954, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$954, DW_AT_decl_column(0x0e)
$C$DW$T$955	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$955, DW_AT_type(*$C$DW$T$954)
	.dwattr $C$DW$T$955, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$955, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$955, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$955, DW_AT_decl_column(0x03)

$C$DW$T$956	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$956, DW_AT_byte_size(0x04)
$C$DW$489	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$489, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$489, DW_AT_decl_column(0x05)
$C$DW$490	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$490, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$490, DW_AT_decl_column(0x05)
$C$DW$491	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$491, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$491, DW_AT_decl_column(0x05)
$C$DW$492	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$492, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$492, DW_AT_decl_column(0x05)
$C$DW$493	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$493, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$493, DW_AT_decl_column(0x05)
$C$DW$494	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$494, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0xab)
	.dwattr $C$DW$494, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$956

	.dwattr $C$DW$T$956, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$956, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$956, DW_AT_decl_column(0x0e)
$C$DW$T$957	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$957, DW_AT_type(*$C$DW$T$956)
	.dwattr $C$DW$T$957, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$957, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$957, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$957, DW_AT_decl_column(0x03)

$C$DW$T$958	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$958, DW_AT_byte_size(0x01)
$C$DW$495	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$495, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$495, DW_AT_decl_column(0x05)
$C$DW$496	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$496, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$496, DW_AT_decl_column(0x05)
$C$DW$497	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$497, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$497, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$958

	.dwattr $C$DW$T$958, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$958, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$958, DW_AT_decl_column(0x0e)
$C$DW$T$959	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$959, DW_AT_type(*$C$DW$T$958)
	.dwattr $C$DW$T$959, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$959, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$959, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$959, DW_AT_decl_column(0x03)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$498, DW_AT_name("length")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0xad)
	.dwattr $C$DW$498, DW_AT_decl_column(0x16)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$499, DW_AT_name("elem")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0xad)
	.dwattr $C$DW$499, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$960	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$960, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$960, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$960, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$960, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$960, DW_AT_decl_column(0x43)
$C$DW$T$961	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$961, DW_AT_type(*$C$DW$T$960)
	.dwattr $C$DW$T$961, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$961, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$961, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$961, DW_AT_decl_column(0x30)
$C$DW$T$962	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$962, DW_AT_type(*$C$DW$T$961)
	.dwattr $C$DW$T$962, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$962, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$962, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$962, DW_AT_decl_column(0x2c)

$C$DW$T$305	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$305, DW_AT_byte_size(0x08)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$500, DW_AT_name("length")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$500, DW_AT_decl_column(0x16)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$501, DW_AT_name("elem")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$501, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$305

	.dwattr $C$DW$T$305, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x10)
$C$DW$T$963	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$963, DW_AT_type(*$C$DW$T$305)
	.dwattr $C$DW$T$963, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$963, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$963, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$963, DW_AT_decl_column(0x43)
$C$DW$T$964	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$964, DW_AT_type(*$C$DW$T$963)
	.dwattr $C$DW$T$964, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$964, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$964, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$964, DW_AT_decl_column(0x2f)
$C$DW$T$965	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$965, DW_AT_type(*$C$DW$T$964)
	.dwattr $C$DW$T$965, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$965, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$965, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$965, DW_AT_decl_column(0x2b)

$C$DW$T$308	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$308, DW_AT_byte_size(0x08)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$502, DW_AT_name("length")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$502, DW_AT_decl_column(0x16)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$503, DW_AT_name("elem")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$503, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$308

	.dwattr $C$DW$T$308, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$966	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$966, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$T$966, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$966, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$966, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$966, DW_AT_decl_column(0x42)
$C$DW$T$967	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$967, DW_AT_type(*$C$DW$T$966)
	.dwattr $C$DW$T$967, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$967, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$967, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$967, DW_AT_decl_column(0x2b)
$C$DW$T$968	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$968, DW_AT_type(*$C$DW$T$967)
	.dwattr $C$DW$T$968, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$968, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$968, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$968, DW_AT_decl_column(0x27)

$C$DW$T$311	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$311, DW_AT_byte_size(0x08)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$504, DW_AT_name("length")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x197)
	.dwattr $C$DW$504, DW_AT_decl_column(0x16)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$505, DW_AT_name("elem")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x197)
	.dwattr $C$DW$505, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$311

	.dwattr $C$DW$T$311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x10)
$C$DW$T$969	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$969, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$T$969, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$969, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$969, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$969, DW_AT_decl_column(0x43)
$C$DW$T$970	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$970, DW_AT_type(*$C$DW$T$969)
	.dwattr $C$DW$T$970, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$970, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$970, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$970, DW_AT_decl_column(0x2c)
$C$DW$T$971	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$971, DW_AT_type(*$C$DW$T$970)
	.dwattr $C$DW$T$971, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$971, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$971, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$971, DW_AT_decl_column(0x28)

$C$DW$T$315	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$315, DW_AT_byte_size(0x04)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$312)
	.dwattr $C$DW$506, DW_AT_name("f")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0xac)
	.dwattr $C$DW$506, DW_AT_decl_column(0x0f)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$507, DW_AT_name("a")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0xad)
	.dwattr $C$DW$507, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$315

	.dwattr $C$DW$T$315, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x0f)
$C$DW$T$972	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$972, DW_AT_type(*$C$DW$T$315)
	.dwattr $C$DW$T$972, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$972, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$972, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$972, DW_AT_decl_column(0x03)

$C$DW$T$409	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$409, DW_AT_name("IRingIO_Object_tag")
	.dwattr $C$DW$T$409, DW_AT_byte_size(0x90)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$316)
	.dwattr $C$DW$508, DW_AT_name("listElem")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0xee)
	.dwattr $C$DW$508, DW_AT_decl_column(0x27)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$509, DW_AT_name("ownerProcId")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$509, DW_AT_decl_column(0x27)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$510, DW_AT_name("name")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$510, DW_AT_decl_column(0x27)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$511, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$511, DW_AT_decl_column(0x27)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$512, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$512, DW_AT_decl_column(0x27)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$513, DW_AT_name("remoteProcId")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$513, DW_AT_decl_column(0x27)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$514, DW_AT_name("top")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$514, DW_AT_decl_column(0x27)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$515, DW_AT_name("nsKey")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$515, DW_AT_decl_column(0x27)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$516, DW_AT_name("created")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("created")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$516, DW_AT_decl_column(0x27)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$517, DW_AT_name("deleteFn")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("deleteFn")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x100)
	.dwattr $C$DW$517, DW_AT_decl_column(0x27)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$518, DW_AT_name("close")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("close")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x102)
	.dwattr $C$DW$518, DW_AT_decl_column(0x27)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$519, DW_AT_name("registerNotifier")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("registerNotifier")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x104)
	.dwattr $C$DW$519, DW_AT_decl_column(0x27)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$356)
	.dwattr $C$DW$520, DW_AT_name("unregisterNotifier")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("unregisterNotifier")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x106)
	.dwattr $C$DW$520, DW_AT_decl_column(0x27)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$359)
	.dwattr $C$DW$521, DW_AT_name("setWaterMark")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("setWaterMark")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x108)
	.dwattr $C$DW$521, DW_AT_decl_column(0x27)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$362)
	.dwattr $C$DW$522, DW_AT_name("setNotifyType")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("setNotifyType")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$522, DW_AT_decl_column(0x27)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$368)
	.dwattr $C$DW$523, DW_AT_name("acquire")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("acquire")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$523, DW_AT_decl_column(0x27)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$369)
	.dwattr $C$DW$524, DW_AT_name("release")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("release")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$524, DW_AT_decl_column(0x27)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$525, DW_AT_name("cancel")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("cancel")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x110)
	.dwattr $C$DW$525, DW_AT_decl_column(0x27)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$526, DW_AT_name("getvAttribute")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("getvAttribute")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x112)
	.dwattr $C$DW$526, DW_AT_decl_column(0x27)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$377)
	.dwattr $C$DW$527, DW_AT_name("setvAttribute")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("setvAttribute")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x114)
	.dwattr $C$DW$527, DW_AT_decl_column(0x27)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$528, DW_AT_name("getAttribute")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("getAttribute")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x116)
	.dwattr $C$DW$528, DW_AT_decl_column(0x27)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$383)
	.dwattr $C$DW$529, DW_AT_name("setAttribute")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("setAttribute")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x118)
	.dwattr $C$DW$529, DW_AT_decl_column(0x27)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$386)
	.dwattr $C$DW$530, DW_AT_name("flush")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("flush")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$530, DW_AT_decl_column(0x27)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$389)
	.dwattr $C$DW$531, DW_AT_name("notify")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("notify")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$531, DW_AT_decl_column(0x2b)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$532, DW_AT_name("getValidSize")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("getValidSize")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$532, DW_AT_decl_column(0x27)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$395)
	.dwattr $C$DW$533, DW_AT_name("getEmptySize")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("getEmptySize")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x120)
	.dwattr $C$DW$533, DW_AT_decl_column(0x27)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$396)
	.dwattr $C$DW$534, DW_AT_name("getValidAttrSize")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("getValidAttrSize")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x122)
	.dwattr $C$DW$534, DW_AT_decl_column(0x27)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$535, DW_AT_name("getEmptyAttrSize")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("getEmptyAttrSize")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x124)
	.dwattr $C$DW$535, DW_AT_decl_column(0x27)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$398)
	.dwattr $C$DW$536, DW_AT_name("getAcquiredOffset")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("getAcquiredOffset")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x126)
	.dwattr $C$DW$536, DW_AT_decl_column(0x27)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$399)
	.dwattr $C$DW$537, DW_AT_name("getAcquiredSize")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("getAcquiredSize")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x128)
	.dwattr $C$DW$537, DW_AT_decl_column(0x27)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$538, DW_AT_name("getWaterMark")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("getWaterMark")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$538, DW_AT_decl_column(0x27)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$403)
	.dwattr $C$DW$539, DW_AT_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$539, DW_AT_decl_column(0x27)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$404)
	.dwattr $C$DW$540, DW_AT_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$540, DW_AT_decl_column(0x2a)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$541, DW_AT_name("setNotifyId")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("setNotifyId")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x130)
	.dwattr $C$DW$541, DW_AT_decl_column(0x28)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$542, DW_AT_name("resetNotifyId")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("resetNotifyId")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x132)
	.dwattr $C$DW$542, DW_AT_decl_column(0x28)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$543, DW_AT_name("obj")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x134)
	.dwattr $C$DW$543, DW_AT_decl_column(0x28)
	.dwendtag $C$DW$T$409

	.dwattr $C$DW$T$409, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$409, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$409, DW_AT_decl_column(0x08)
$C$DW$T$335	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x23)
$C$DW$T$336	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
	.dwattr $C$DW$T$336, DW_AT_address_class(0x20)
$C$DW$T$337	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Handle")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x1a)
$C$DW$T$338	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$338, DW_AT_address_class(0x20)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$437	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$437, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$437, DW_AT_address_class(0x20)
$C$DW$T$438	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$438, DW_AT_type(*$C$DW$T$437)
	.dwattr $C$DW$T$438, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$438, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$438, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$438, DW_AT_decl_column(0x23)
$C$DW$T$979	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$979, DW_AT_type(*$C$DW$T$438)
	.dwattr $C$DW$T$979, DW_AT_address_class(0x20)

$C$DW$T$410	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$410, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$410, DW_AT_byte_size(0x14)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$544, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$544, DW_AT_decl_column(0x0a)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$545, DW_AT_name("tableHeap")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0xda)
	.dwattr $C$DW$545, DW_AT_decl_column(0x0a)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$546, DW_AT_name("checkExisting")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$546, DW_AT_decl_column(0x0a)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$547, DW_AT_name("maxValueLen")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$547, DW_AT_decl_column(0x0a)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$548, DW_AT_name("maxNameLen")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$548, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$410

	.dwattr $C$DW$T$410, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$410, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$410, DW_AT_decl_column(0x10)
$C$DW$T$975	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$975, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$T$975, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$975, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$975, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$975, DW_AT_decl_column(0x03)
$C$DW$T$976	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$976, DW_AT_type(*$C$DW$T$975)
$C$DW$T$977	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$977, DW_AT_type(*$C$DW$T$976)
	.dwattr $C$DW$T$977, DW_AT_address_class(0x20)
$C$DW$T$984	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$984, DW_AT_type(*$C$DW$T$975)
	.dwattr $C$DW$T$984, DW_AT_address_class(0x20)

$C$DW$T$428	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$428, DW_AT_name("RingIO_CfgFxns_tag")
	.dwattr $C$DW$T$428, DW_AT_byte_size(0x0c)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$416)
	.dwattr $C$DW$549, DW_AT_name("create")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("create")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x93)
	.dwattr $C$DW$549, DW_AT_decl_column(0x23)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$421)
	.dwattr $C$DW$550, DW_AT_name("sharedMemReq")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("sharedMemReq")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x95)
	.dwattr $C$DW$550, DW_AT_decl_column(0x23)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$427)
	.dwattr $C$DW$551, DW_AT_name("openByAddr")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("openByAddr")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x97)
	.dwattr $C$DW$551, DW_AT_decl_column(0x23)
	.dwendtag $C$DW$T$428

	.dwattr $C$DW$T$428, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x10)
$C$DW$T$986	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_CfgFxns")
	.dwattr $C$DW$T$986, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$986, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$986, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$986, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$986, DW_AT_decl_column(0x03)

$C$DW$T$987	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$987, DW_AT_type(*$C$DW$T$986)
	.dwattr $C$DW$T$987, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$987, DW_AT_byte_size(0x0c)
$C$DW$552	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$552, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$987


$C$DW$T$429	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$429, DW_AT_name("RingIO_Config_Tag")
	.dwattr $C$DW$T$429, DW_AT_byte_size(0x08)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$553, DW_AT_name("maxNameLen")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x89)
	.dwattr $C$DW$553, DW_AT_decl_column(0x12)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$554, DW_AT_name("maxInstances")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("maxInstances")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$554, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$429

	.dwattr $C$DW$T$429, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$429, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$429, DW_AT_decl_column(0x10)
$C$DW$T$990	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Config")
	.dwattr $C$DW$T$990, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$990, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$990, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$990, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$T$990, DW_AT_decl_column(0x03)
$C$DW$T$991	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$991, DW_AT_type(*$C$DW$T$990)
$C$DW$T$992	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$992, DW_AT_type(*$C$DW$T$991)
	.dwattr $C$DW$T$992, DW_AT_address_class(0x20)
$C$DW$T$993	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$993, DW_AT_type(*$C$DW$T$990)
	.dwattr $C$DW$T$993, DW_AT_address_class(0x20)
$C$DW$T$994	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$994, DW_AT_type(*$C$DW$T$993)

$C$DW$T$999	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$999, DW_AT_name("RingIO_Flags_tag")
	.dwattr $C$DW$T$999, DW_AT_byte_size(0x01)
$C$DW$555	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_DATABUF_MAINTAINCACHE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$555, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x1c2)
	.dwattr $C$DW$555, DW_AT_decl_column(0x05)
$C$DW$556	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NEED_EXACT_SIZE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$556, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x1c6)
	.dwattr $C$DW$556, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$999

	.dwattr $C$DW$T$999, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$999, DW_AT_decl_line(0x1c1)
	.dwattr $C$DW$T$999, DW_AT_decl_column(0x0e)
$C$DW$T$1000	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Flags")
	.dwattr $C$DW$T$1000, DW_AT_type(*$C$DW$T$999)
	.dwattr $C$DW$T$1000, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1000, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$1000, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$1000, DW_AT_decl_column(0x03)

$C$DW$T$432	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$432, DW_AT_name("RingIO_InterfaceAttrs_tag")
	.dwattr $C$DW$T$432, DW_AT_byte_size(0x01)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$557, DW_AT_name("type")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0xac)
	.dwattr $C$DW$557, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$432

	.dwattr $C$DW$T$432, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$432, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$432, DW_AT_decl_column(0x10)
$C$DW$T$1001	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_InterfaceAttrs")
	.dwattr $C$DW$T$1001, DW_AT_type(*$C$DW$T$432)
	.dwattr $C$DW$T$1001, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1001, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$1001, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1001, DW_AT_decl_column(0x03)
$C$DW$T$1002	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1002, DW_AT_type(*$C$DW$T$1001)
	.dwattr $C$DW$T$1002, DW_AT_address_class(0x20)

$C$DW$T$439	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$439, DW_AT_name("RingIO_ModuleObject")
	.dwattr $C$DW$T$439, DW_AT_byte_size(0x1c)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$558, DW_AT_name("refCount")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$558, DW_AT_decl_line(0x77)
	.dwattr $C$DW$558, DW_AT_decl_column(0x19)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$435)
	.dwattr $C$DW$559, DW_AT_name("createObjList")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("createObjList")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$559, DW_AT_decl_line(0x79)
	.dwattr $C$DW$559, DW_AT_decl_column(0x19)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$435)
	.dwattr $C$DW$560, DW_AT_name("openObjList")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("openObjList")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$560, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$560, DW_AT_decl_column(0x19)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$561, DW_AT_name("defaultInstParams")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("defaultInstParams")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$561, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$561, DW_AT_decl_column(0x19)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$562, DW_AT_name("localRingIOHandle")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("localRingIOHandle")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$562, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$562, DW_AT_decl_column(0x19)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$438)
	.dwattr $C$DW$563, DW_AT_name("nsHandle")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("nsHandle")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$563, DW_AT_decl_line(0x81)
	.dwattr $C$DW$563, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$439

	.dwattr $C$DW$T$439, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$T$439, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$439, DW_AT_decl_column(0x10)
$C$DW$T$1004	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_ModuleObject")
	.dwattr $C$DW$T$1004, DW_AT_type(*$C$DW$T$439)
	.dwattr $C$DW$T$1004, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1004, DW_AT_decl_file("../../RingIO.c")
	.dwattr $C$DW$T$1004, DW_AT_decl_line(0x83)
	.dwattr $C$DW$T$1004, DW_AT_decl_column(0x03)
$C$DW$T$1005	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1005, DW_AT_type(*$C$DW$T$1004)
	.dwattr $C$DW$T$1005, DW_AT_address_class(0x20)
$C$DW$T$1006	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1006, DW_AT_type(*$C$DW$T$439)
	.dwattr $C$DW$T$1006, DW_AT_address_class(0x20)
$C$DW$T$1007	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1007, DW_AT_type(*$C$DW$T$1006)
	.dwattr $C$DW$T$1007, DW_AT_address_class(0x20)

$C$DW$T$440	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$440, DW_AT_name("RingIO_NameServerEntry_tag")
	.dwattr $C$DW$T$440, DW_AT_byte_size(0x08)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$564, DW_AT_name("procId")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$564, DW_AT_decl_column(0x1c)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$565, DW_AT_name("ctrlSharedSrPtr")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("ctrlSharedSrPtr")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$565, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$440

	.dwattr $C$DW$T$440, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$440, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$440, DW_AT_decl_column(0x10)
$C$DW$T$1008	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NameServerEntry")
	.dwattr $C$DW$T$1008, DW_AT_type(*$C$DW$T$440)
	.dwattr $C$DW$T$1008, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1008, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIO.h")
	.dwattr $C$DW$T$1008, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$T$1008, DW_AT_decl_column(0x03)

$C$DW$T$343	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$343, DW_AT_name("RingIO_NotifyType_Tag")
	.dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
$C$DW$566	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$566, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$566, DW_AT_decl_column(0x05)
$C$DW$567	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$567, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$567, DW_AT_decl_column(0x05)
$C$DW$568	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$568, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$568, DW_AT_decl_column(0x05)
$C$DW$569	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$569, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$569, DW_AT_decl_column(0x05)
$C$DW$570	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$570, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$570, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$343

	.dwattr $C$DW$T$343, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x0e)
$C$DW$T$344	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_NotifyType")
	.dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$344, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$344, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$T$344, DW_AT_decl_column(0x03)
$C$DW$T$1010	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1010, DW_AT_type(*$C$DW$T$344)
$C$DW$T$1011	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1011, DW_AT_type(*$C$DW$T$344)
$C$DW$T$1012	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1012, DW_AT_type(*$C$DW$T$344)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("RingIO_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$345	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$345, DW_AT_address_class(0x20)
$C$DW$T$346	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Handle")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$345)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x23)
$C$DW$T$1013	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1013, DW_AT_type(*$C$DW$T$346)
$C$DW$T$413	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$T$413, DW_AT_address_class(0x20)
$C$DW$T$1014	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1014, DW_AT_type(*$C$DW$T$413)

$C$DW$T$442	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$442, DW_AT_name("RingIO_OpenMode_Tag")
	.dwattr $C$DW$T$442, DW_AT_byte_size(0x01)
$C$DW$571	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_READER"), DW_AT_const_value(0x00)
	.dwattr $C$DW$571, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x19b)
	.dwattr $C$DW$571, DW_AT_decl_column(0x05)
$C$DW$572	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_MODE_WRITER"), DW_AT_const_value(0x01)
	.dwattr $C$DW$572, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$572, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$442

	.dwattr $C$DW$T$442, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$442, DW_AT_decl_line(0x19a)
	.dwattr $C$DW$T$442, DW_AT_decl_column(0x0e)
$C$DW$T$443	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_OpenMode")
	.dwattr $C$DW$T$443, DW_AT_type(*$C$DW$T$442)
	.dwattr $C$DW$T$443, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$443, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$443, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$T$443, DW_AT_decl_column(0x03)

$C$DW$T$441	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$441, DW_AT_name("RingIO_Params_Tag")
	.dwattr $C$DW$T$441, DW_AT_byte_size(0x08)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$573, DW_AT_name("name")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x191)
	.dwattr $C$DW$573, DW_AT_decl_column(0x13)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$574, DW_AT_name("interfaceType")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("interfaceType")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x193)
	.dwattr $C$DW$574, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$441

	.dwattr $C$DW$T$441, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$441, DW_AT_decl_line(0x190)
	.dwattr $C$DW$T$441, DW_AT_decl_column(0x10)
$C$DW$T$436	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Params")
	.dwattr $C$DW$T$436, DW_AT_type(*$C$DW$T$441)
	.dwattr $C$DW$T$436, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$436, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$436, DW_AT_decl_line(0x195)
	.dwattr $C$DW$T$436, DW_AT_decl_column(0x03)

$C$DW$T$430	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$430, DW_AT_name("RingIO_Type_Tag")
	.dwattr $C$DW$T$430, DW_AT_byte_size(0x01)
$C$DW$575	.dwtag  DW_TAG_enumerator, DW_AT_name("RingIO_Type_SHAREDMEM"), DW_AT_const_value(0x00)
	.dwattr $C$DW$575, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x182)
	.dwattr $C$DW$575, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$430

	.dwattr $C$DW$T$430, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$430, DW_AT_decl_line(0x181)
	.dwattr $C$DW$T$430, DW_AT_decl_column(0x0e)
$C$DW$T$431	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_Type")
	.dwattr $C$DW$T$431, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$T$431, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$431, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$431, DW_AT_decl_line(0x185)
	.dwattr $C$DW$T$431, DW_AT_decl_column(0x03)

$C$DW$T$444	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$444, DW_AT_name("RingIO_openParams_Tag")
	.dwattr $C$DW$T$444, DW_AT_byte_size(0x08)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$576, DW_AT_name("flags")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$576, DW_AT_decl_column(0x11)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$443)
	.dwattr $C$DW$577, DW_AT_name("openMode")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("openMode")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$577, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$444

	.dwattr $C$DW$T$444, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$444, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$T$444, DW_AT_decl_column(0x10)
$C$DW$T$422	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_openParams")
	.dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$444)
	.dwattr $C$DW$T$422, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$422, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$422, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$T$422, DW_AT_decl_column(0x03)
$C$DW$T$423	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$423, DW_AT_type(*$C$DW$T$422)
$C$DW$T$424	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$424, DW_AT_type(*$C$DW$T$423)
	.dwattr $C$DW$T$424, DW_AT_address_class(0x20)
$C$DW$T$1021	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1021, DW_AT_type(*$C$DW$T$424)

$C$DW$T$445	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$445, DW_AT_name("RingIO_sharedMemReqDetails_tag")
	.dwattr $C$DW$T$445, DW_AT_byte_size(0x0c)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$578, DW_AT_name("ctrlSharedMemReq")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("ctrlSharedMemReq")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$578, DW_AT_decl_column(0x14)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$579, DW_AT_name("dataSharedMemReq")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("dataSharedMemReq")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$579, DW_AT_decl_column(0x14)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$580, DW_AT_name("attrSharedMemReq")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("attrSharedMemReq")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$580, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$445

	.dwattr $C$DW$T$445, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$445, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$T$445, DW_AT_decl_column(0x10)
$C$DW$T$417	.dwtag  DW_TAG_typedef, DW_AT_name("RingIO_sharedMemReqDetails")
	.dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$445)
	.dwattr $C$DW$T$417, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$417, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/RingIO.h")
	.dwattr $C$DW$T$417, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$T$417, DW_AT_decl_column(0x03)
$C$DW$T$418	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$417)
	.dwattr $C$DW$T$418, DW_AT_address_class(0x20)
$C$DW$T$1025	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1025, DW_AT_type(*$C$DW$T$418)

$C$DW$T$449	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$449, DW_AT_name("SharedRegion_Entry")
	.dwattr $C$DW$T$449, DW_AT_byte_size(0x1c)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$330)
	.dwattr $C$DW$581, DW_AT_name("base")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("base")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$581, DW_AT_decl_column(0x09)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$448)
	.dwattr $C$DW$582, DW_AT_name("len")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("len")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$582, DW_AT_decl_column(0x0b)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$583, DW_AT_name("ownerProcId")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$583, DW_AT_decl_column(0x0c)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$584, DW_AT_name("isValid")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0xea)
	.dwattr $C$DW$584, DW_AT_decl_column(0x0a)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$585, DW_AT_name("cacheEnable")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("cacheEnable")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0xed)
	.dwattr $C$DW$585, DW_AT_decl_column(0x0a)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$448)
	.dwattr $C$DW$586, DW_AT_name("cacheLineSize")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("cacheLineSize")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$586, DW_AT_decl_column(0x0b)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$587, DW_AT_name("createHeap")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("createHeap")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$587, DW_AT_decl_column(0x0a)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$588, DW_AT_name("name")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x107)
	.dwattr $C$DW$588, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$449

	.dwattr $C$DW$T$449, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$T$449, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$449, DW_AT_decl_column(0x10)
$C$DW$T$1028	.dwtag  DW_TAG_typedef, DW_AT_name("SharedRegion_Entry")
	.dwattr $C$DW$T$1028, DW_AT_type(*$C$DW$T$449)
	.dwattr $C$DW$T$1028, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1028, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1028, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$1028, DW_AT_decl_column(0x03)

$C$DW$T$455	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$455, DW_AT_name("SysLink_MemEntry_Block_tag")
	.dwattr $C$DW$T$455, DW_AT_byte_size(0x114)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$452)
	.dwattr $C$DW$589, DW_AT_name("procName")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("procName")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$589, DW_AT_decl_column(0x16)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$590, DW_AT_name("numEntries")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("numEntries")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$590, DW_AT_decl_column(0x16)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$454)
	.dwattr $C$DW$591, DW_AT_name("memEntries")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("memEntries")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$591, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$455

	.dwattr $C$DW$T$455, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$455, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$455, DW_AT_decl_column(0x10)
$C$DW$T$458	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemEntry_Block")
	.dwattr $C$DW$T$458, DW_AT_type(*$C$DW$T$455)
	.dwattr $C$DW$T$458, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$458, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$458, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$T$458, DW_AT_decl_column(0x03)
$C$DW$T$459	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$459, DW_AT_type(*$C$DW$T$458)
	.dwattr $C$DW$T$459, DW_AT_address_class(0x20)

$C$DW$T$457	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$457, DW_AT_name("SysLink_MemEntry_tag")
	.dwattr $C$DW$T$457, DW_AT_byte_size(0x18)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$592, DW_AT_name("slaveVirtAddr")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("slaveVirtAddr")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x90)
	.dwattr $C$DW$592, DW_AT_decl_column(0x0c)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$593, DW_AT_name("masterPhysAddr")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("masterPhysAddr")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x91)
	.dwattr $C$DW$593, DW_AT_decl_column(0x0c)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$594, DW_AT_name("size")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x92)
	.dwattr $C$DW$594, DW_AT_decl_column(0x0c)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$456)
	.dwattr $C$DW$595, DW_AT_name("mapMask")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("mapMask")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x93)
	.dwattr $C$DW$595, DW_AT_decl_column(0x15)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$596, DW_AT_name("map")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("map")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x94)
	.dwattr $C$DW$596, DW_AT_decl_column(0x0c)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$597, DW_AT_name("isCached")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("isCached")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x97)
	.dwattr $C$DW$597, DW_AT_decl_column(0x0c)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$598, DW_AT_name("isValid")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$598, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$457

	.dwattr $C$DW$T$457, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$457, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$457, DW_AT_decl_column(0x10)
$C$DW$T$453	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemEntry")
	.dwattr $C$DW$T$453, DW_AT_type(*$C$DW$T$457)
	.dwattr $C$DW$T$453, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$453, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$453, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$453, DW_AT_decl_column(0x03)

$C$DW$T$454	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$454, DW_AT_type(*$C$DW$T$453)
	.dwattr $C$DW$T$454, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$454, DW_AT_byte_size(0xf0)
$C$DW$599	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$599, DW_AT_upper_bound(0x09)
	.dwendtag $C$DW$T$454


$C$DW$T$460	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$460, DW_AT_name("SysLink_MemoryMap_tag")
	.dwattr $C$DW$T$460, DW_AT_byte_size(0x08)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$600, DW_AT_name("numBlocks")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("numBlocks")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0xae)
	.dwattr $C$DW$600, DW_AT_decl_column(0x1e)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$459)
	.dwattr $C$DW$601, DW_AT_name("memBlocks")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("memBlocks")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$601, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$460

	.dwattr $C$DW$T$460, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$460, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$460, DW_AT_decl_column(0x10)
$C$DW$T$1029	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_MemoryMap")
	.dwattr $C$DW$T$1029, DW_AT_type(*$C$DW$T$460)
	.dwattr $C$DW$T$1029, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1029, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$1029, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1029, DW_AT_decl_column(0x03)

$C$DW$T$1030	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1030, DW_AT_name("SysLink_NotifyType_tag")
	.dwattr $C$DW$T$1030, DW_AT_byte_size(0x01)
$C$DW$602	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$602, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x77)
	.dwattr $C$DW$602, DW_AT_decl_column(0x05)
$C$DW$603	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$603, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x79)
	.dwattr $C$DW$603, DW_AT_decl_column(0x05)
$C$DW$604	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$604, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$604, DW_AT_decl_column(0x05)
$C$DW$605	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$605, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x80)
	.dwattr $C$DW$605, DW_AT_decl_column(0x05)
$C$DW$606	.dwtag  DW_TAG_enumerator, DW_AT_name("SysLink_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$606, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x84)
	.dwattr $C$DW$606, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1030

	.dwattr $C$DW$T$1030, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$1030, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$1030, DW_AT_decl_column(0x0e)
$C$DW$T$1031	.dwtag  DW_TAG_typedef, DW_AT_name("SysLink_NotifyType")
	.dwattr $C$DW$T$1031, DW_AT_type(*$C$DW$T$1030)
	.dwattr $C$DW$T$1031, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1031, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/SysLink.h")
	.dwattr $C$DW$T$1031, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$1031, DW_AT_decl_column(0x03)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$1048	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1048, DW_AT_type(*$C$DW$T$3)
$C$DW$T$329	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_Ptr")
	.dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$329, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$329, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$329, DW_AT_decl_column(0x1a)
$C$DW$T$1051	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__gateObj")
	.dwattr $C$DW$T$1051, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1051, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1051, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1051, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1051, DW_AT_decl_column(0x11)
$C$DW$T$1052	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__gatePrms")
	.dwattr $C$DW$T$1052, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1052, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1052, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1052, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$1052, DW_AT_decl_column(0x11)
$C$DW$T$1053	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Module__loggerObj")
	.dwattr $C$DW$T$1053, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1053, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1053, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1053, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$T$1053, DW_AT_decl_column(0x11)
$C$DW$T$1054	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_Ipc_Object__table")
	.dwattr $C$DW$T$1054, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1054, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1054, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/Ipc.h")
	.dwattr $C$DW$T$1054, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1054, DW_AT_decl_column(0x11)
$C$DW$T$1055	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__gateObj")
	.dwattr $C$DW$T$1055, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1055, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1055, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1055, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$1055, DW_AT_decl_column(0x11)
$C$DW$T$1056	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__gatePrms")
	.dwattr $C$DW$T$1056, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1056, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1056, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1056, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$1056, DW_AT_decl_column(0x11)
$C$DW$T$1057	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Module__loggerObj")
	.dwattr $C$DW$T$1057, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1057, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1057, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1057, DW_AT_decl_line(0x92)
	.dwattr $C$DW$T$1057, DW_AT_decl_column(0x11)
$C$DW$T$1058	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_ipc_SharedRegion_Object__table")
	.dwattr $C$DW$T$1058, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1058, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1058, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/ipc/SharedRegion.h")
	.dwattr $C$DW$T$1058, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$1058, DW_AT_decl_column(0x11)
$C$DW$T$1059	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__gateObj")
	.dwattr $C$DW$T$1059, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1059, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1059, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1059, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$1059, DW_AT_decl_column(0x11)
$C$DW$T$1060	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__gatePrms")
	.dwattr $C$DW$T$1060, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1060, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1060, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1060, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$1060, DW_AT_decl_column(0x11)
$C$DW$T$1061	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Module__loggerObj")
	.dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1061, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1061, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1061, DW_AT_decl_column(0x11)
$C$DW$T$1062	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_List_Object__table")
	.dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1062, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1062, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/List.h")
	.dwattr $C$DW$T$1062, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$T$1062, DW_AT_decl_column(0x11)
$C$DW$T$1063	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__gateObj")
	.dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1063, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1063, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$1063, DW_AT_decl_column(0x11)
$C$DW$T$1064	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__gatePrms")
	.dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1064, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1064, DW_AT_decl_line(0x63)
	.dwattr $C$DW$T$1064, DW_AT_decl_column(0x11)
$C$DW$T$1065	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Module__loggerObj")
	.dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1065, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1065, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$1065, DW_AT_decl_column(0x11)
$C$DW$T$1066	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_MultiProc_Object__table")
	.dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1066, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/MultiProc.h")
	.dwattr $C$DW$T$1066, DW_AT_decl_line(0x97)
	.dwattr $C$DW$T$1066, DW_AT_decl_column(0x11)
$C$DW$T$1067	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__gateObj")
	.dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1067, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1067, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$1067, DW_AT_decl_column(0x11)
$C$DW$T$1068	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__gatePrms")
	.dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1068, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1068, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$1068, DW_AT_decl_column(0x11)
$C$DW$T$1069	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Module__loggerObj")
	.dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1069, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1069, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1069, DW_AT_decl_column(0x11)
$C$DW$T$1070	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_Object__table")
	.dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1070, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/NameServer.h")
	.dwattr $C$DW$T$1070, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$T$1070, DW_AT_decl_column(0x11)
$C$DW$T$1071	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__gateObj")
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1071, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1071, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1071, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$1071, DW_AT_decl_column(0x11)
$C$DW$T$1072	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__gatePrms")
	.dwattr $C$DW$T$1072, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1072, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1072, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1072, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$1072, DW_AT_decl_column(0x11)
$C$DW$T$1073	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Module__loggerObj")
	.dwattr $C$DW$T$1073, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1073, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1073, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1073, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$1073, DW_AT_decl_column(0x11)
$C$DW$T$1074	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sdo_utils_NameServer_SetupProxy_Object__table")
	.dwattr $C$DW$T$1074, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1074, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1074, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/sdo/utils/package/NameServer_SetupProxy.h")
	.dwattr $C$DW$T$1074, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$1074, DW_AT_decl_column(0x11)
$C$DW$T$1075	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__gateObj")
	.dwattr $C$DW$T$1075, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1075, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1075, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1075, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$1075, DW_AT_decl_column(0x11)
$C$DW$T$1076	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__gatePrms")
	.dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1076, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1076, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$1076, DW_AT_decl_column(0x11)
$C$DW$T$1077	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Module__loggerObj")
	.dwattr $C$DW$T$1077, DW_AT_type(*$C$DW$T$329)
	.dwattr $C$DW$T$1077, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1077, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/gates/GateMutex.h")
	.dwattr $C$DW$T$1077, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1077, DW_AT_decl_column(0x11)
$C$DW$T$1078	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_gates_GateMutex_Object__table")
	.dwattr $C$DW$T$1078, DW_AT_type(*$C$DW$T$329)
