;******************************************************************************
;* TI ARM C/C++ Codegen                                           Unix v5.1.3 *
;* Date/Time created: Thu Dec  7 18:20:42 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../../RingIOShm.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v5.1.3 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/opt/Project/Camera/Source/ti_tools/syslink_2_21_02_10/packages/ti/syslink/ipc/rtos")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/cgt470_5_1_3/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)

	.dwattr $C$DW$1192, DW_AT_decl_column(0x05)
$C$DW$1193	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_Enable"), DW_AT_const_value(0x100)
	.dwattr $C$DW$1193, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x05)
$C$DW$1194	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceSetFailure_EndValue"), DW_AT_const_value(0x200)
	.dwattr $C$DW$1194, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1055

	.dwattr $C$DW$T$1055, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1055, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$1055, DW_AT_decl_column(0x0e)
$C$DW$T$1056	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceSetFailure")
	.dwattr $C$DW$T$1056, DW_AT_type(*$C$DW$T$1055)
	.dwattr $C$DW$T$1056, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1056, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1056, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$1056, DW_AT_decl_column(0x03)

$C$DW$T$1057	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1057, DW_AT_byte_size(0x04)
$C$DW$1195	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_1CLASS"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$1195, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x05)
$C$DW$1196	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_2CLASS"), DW_AT_const_value(0x20000)
	.dwattr $C$DW$1196, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x05)
$C$DW$1197	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_3CLASS"), DW_AT_const_value(0x30000)
	.dwattr $C$DW$1197, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x05)
$C$DW$1198	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_4CLASS"), DW_AT_const_value(0x40000)
	.dwattr $C$DW$1198, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x05)
$C$DW$1199	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_ENTER"), DW_AT_const_value(0x50000)
	.dwattr $C$DW$1199, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x05)
$C$DW$1200	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_LEAVE"), DW_AT_const_value(0x60000)
	.dwattr $C$DW$1200, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1057

	.dwattr $C$DW$T$1057, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1057, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$T$1057, DW_AT_decl_column(0x0e)
$C$DW$T$1058	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceClass")
	.dwattr $C$DW$T$1058, DW_AT_type(*$C$DW$T$1057)
	.dwattr $C$DW$T$1058, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1058, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1058, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1058, DW_AT_decl_column(0x03)

$C$DW$T$1059	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1059, DW_AT_byte_size(0x01)
$C$DW$1201	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_User"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1201, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x05)
$C$DW$1202	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_Kernel"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1202, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x05)
$C$DW$1203	.dwtag  DW_TAG_enumerator, DW_AT_name("GT_TraceType_EndValue"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1203, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1059

	.dwattr $C$DW$T$1059, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1059, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$1059, DW_AT_decl_column(0x0e)
$C$DW$T$1060	.dwtag  DW_TAG_typedef, DW_AT_name("GT_TraceType")
	.dwattr $C$DW$T$1060, DW_AT_type(*$C$DW$T$1059)
	.dwattr $C$DW$T$1060, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1060, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/utils/Trace.h")
	.dwattr $C$DW$T$1060, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$1060, DW_AT_decl_column(0x03)

$C$DW$T$300	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$300, DW_AT_byte_size(0x08)
$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1204, DW_AT_name("length")
	.dwattr $C$DW$1204, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x16)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1205, DW_AT_name("elem")
	.dwattr $C$DW$1205, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$300

	.dwattr $C$DW$T$300, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$300, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$300, DW_AT_decl_column(0x10)
$C$DW$T$1061	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$300)
	.dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1061, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1061, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$1061, DW_AT_decl_column(0x43)
$C$DW$T$1062	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
	.dwattr $C$DW$T$1062, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1062, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1062, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1062, DW_AT_decl_column(0x30)
$C$DW$T$1063	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_firstFxns")
	.dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$1062)
	.dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1063, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1063, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$T$1063, DW_AT_decl_column(0x2c)

$C$DW$T$301	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$301, DW_AT_byte_size(0x08)
$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1206, DW_AT_name("length")
	.dwattr $C$DW$1206, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x16)
$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$299)
	.dwattr $C$DW$1207, DW_AT_name("elem")
	.dwattr $C$DW$1207, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$301

	.dwattr $C$DW$T$301, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$301, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$301, DW_AT_decl_column(0x10)
$C$DW$T$1064	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$301)
	.dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1064, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1064, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$1064, DW_AT_decl_column(0x43)
$C$DW$T$1065	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$1064)
	.dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1065, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1065, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$T$1065, DW_AT_decl_column(0x2f)
$C$DW$T$1066	.dwtag  DW_TAG_typedef, DW_AT_name("CT__xdc_runtime_Startup_lastFxns")
	.dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$1065)
	.dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1066, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/runtime/Startup.h")
	.dwattr $C$DW$T$1066, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1066, DW_AT_decl_column(0x2b)

$C$DW$T$304	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$304, DW_AT_byte_size(0x08)
$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1208, DW_AT_name("length")
	.dwattr $C$DW$1208, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x16)
$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$303)
	.dwattr $C$DW$1209, DW_AT_name("elem")
	.dwattr $C$DW$1209, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x3a)
	.dwendtag $C$DW$T$304

	.dwattr $C$DW$T$304, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x10)
$C$DW$T$1067	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$304)
	.dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1067, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1067, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$1067, DW_AT_decl_column(0x42)
$C$DW$T$1068	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$1067)
	.dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1068, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1068, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$1068, DW_AT_decl_column(0x2b)
$C$DW$T$1069	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
	.dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$1068)
	.dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1069, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Swi.h")
	.dwattr $C$DW$T$1069, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$1069, DW_AT_decl_column(0x27)

$C$DW$T$307	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$307, DW_AT_byte_size(0x08)
$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$1210, DW_AT_name("length")
	.dwattr $C$DW$1210, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x16)
$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$306)
	.dwattr $C$DW$1211, DW_AT_name("elem")
	.dwattr $C$DW$1211, DW_AT_TI_symbol_name("elem")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0x197)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x3b)
	.dwendtag $C$DW$T$307

	.dwattr $C$DW$T$307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$307, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$307, DW_AT_decl_column(0x10)
$C$DW$T$1070	.dwtag  DW_TAG_typedef, DW_AT_name("__ARRAY1_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$307)
	.dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1070, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1070, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$1070, DW_AT_decl_column(0x43)
$C$DW$T$1071	.dwtag  DW_TAG_typedef, DW_AT_name("__TA_ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1071, DW_AT_type(*$C$DW$T$1070)
	.dwattr $C$DW$T$1071, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1071, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1071, DW_AT_decl_line(0x198)
	.dwattr $C$DW$T$1071, DW_AT_decl_column(0x2c)
$C$DW$T$1072	.dwtag  DW_TAG_typedef, DW_AT_name("CT__ti_sysbios_knl_Task_hooks")
	.dwattr $C$DW$T$1072, DW_AT_type(*$C$DW$T$1071)
	.dwattr $C$DW$T$1072, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1072, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/bios_6_37_01_24/packages/ti/sysbios/knl/Task.h")
	.dwattr $C$DW$T$1072, DW_AT_decl_line(0x199)
	.dwattr $C$DW$T$1072, DW_AT_decl_column(0x28)

$C$DW$T$311	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$311, DW_AT_byte_size(0x04)
$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$308)
	.dwattr $C$DW$1212, DW_AT_name("f")
	.dwattr $C$DW$1212, DW_AT_TI_symbol_name("f")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x0f)
$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$310)
	.dwattr $C$DW$1213, DW_AT_name("a")
	.dwattr $C$DW$1213, DW_AT_TI_symbol_name("a")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$311

	.dwattr $C$DW$T$311, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x0f)
$C$DW$T$1073	.dwtag  DW_TAG_typedef, DW_AT_name("xdc_FloatData")
	.dwattr $C$DW$T$1073, DW_AT_type(*$C$DW$T$311)
	.dwattr $C$DW$T$1073, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1073, DW_AT_decl_file("/opt/Project/Camera/Source/ti_tools/xdctools_3_25_05_94/packages/xdc/std.h")
	.dwattr $C$DW$T$1073, DW_AT_decl_line(0xae)
	.dwattr $C$DW$T$1073, DW_AT_decl_column(0x03)

$C$DW$T$1074	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1074, DW_AT_name("ClientNotifyMgr_CacheFlags_Tag")
	.dwattr $C$DW$T$1074, DW_AT_byte_size(0x01)
$C$DW$1214	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_CONTROL_CACHEUSE"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1214, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1074

	.dwattr $C$DW$T$1074, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1074, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$1074, DW_AT_decl_column(0x0e)
$C$DW$T$1075	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_CacheFlags")
	.dwattr $C$DW$T$1075, DW_AT_type(*$C$DW$T$1074)
	.dwattr $C$DW$T$1075, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1075, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1075, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$1075, DW_AT_decl_column(0x03)

$C$DW$T$320	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$320, DW_AT_name("ClientNotifyMgr_Config_Tag")
	.dwattr $C$DW$T$320, DW_AT_byte_size(0x10)
$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$313)
	.dwattr $C$DW$1215, DW_AT_name("gate")
	.dwattr $C$DW$1215, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0x87)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x1b)
$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1216, DW_AT_name("numProcessors")
	.dwattr $C$DW$1216, DW_AT_TI_symbol_name("numProcessors")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x0f)
$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1217, DW_AT_name("procIds")
	.dwattr $C$DW$1217, DW_AT_TI_symbol_name("procIds")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x0f)
$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1218, DW_AT_name("drvHandles")
	.dwattr $C$DW$1218, DW_AT_TI_symbol_name("drvHandles")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$320

	.dwattr $C$DW$T$320, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$320, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$320, DW_AT_decl_column(0x10)
$C$DW$T$1076	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Config")
	.dwattr $C$DW$T$1076, DW_AT_type(*$C$DW$T$320)
	.dwattr $C$DW$T$1076, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1076, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1076, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$1076, DW_AT_decl_column(0x03)

$C$DW$T$1077	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$1077, DW_AT_name("ClientNotifyMgr_NotifyType_Tag")
	.dwattr $C$DW$T$1077, DW_AT_byte_size(0x01)
$C$DW$1219	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1219, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0x61)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x05)
$C$DW$1220	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ALWAYS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1220, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x63)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x05)
$C$DW$1221	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_ONCE"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1221, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x65)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x05)
$C$DW$1222	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ALWAYS"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1222, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x05)
$C$DW$1223	.dwtag  DW_TAG_enumerator, DW_AT_name("ClientNotifyMgr_NOTIFICATION_HDWRFIFO_ONCE"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1223, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$1077

	.dwattr $C$DW$T$1077, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1077, DW_AT_decl_line(0x60)
	.dwattr $C$DW$T$1077, DW_AT_decl_column(0x0e)
$C$DW$T$1078	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_NotifyType")
	.dwattr $C$DW$T$1078, DW_AT_type(*$C$DW$T$1077)
	.dwattr $C$DW$T$1078, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1078, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1078, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$1078, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$428	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Object")
	.dwattr $C$DW$T$428, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$428, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$428, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$428, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$428, DW_AT_decl_column(0x27)
$C$DW$T$429	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$428)
	.dwattr $C$DW$T$429, DW_AT_address_class(0x20)
$C$DW$T$430	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Handle")
	.dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
	.dwattr $C$DW$T$430, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$430, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$430, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$T$430, DW_AT_decl_column(0x22)
$C$DW$T$1079	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1079, DW_AT_type(*$C$DW$T$430)
$C$DW$T$1083	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1083, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$T$1083, DW_AT_address_class(0x20)

$C$DW$T$333	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$333, DW_AT_name("ClientNotifyMgr_Params_Tag")
	.dwattr $C$DW$T$333, DW_AT_byte_size(0x2c)
$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1224, DW_AT_name("name")
	.dwattr $C$DW$1224, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x14)
$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1225, DW_AT_name("eventNo")
	.dwattr $C$DW$1225, DW_AT_TI_symbol_name("eventNo")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x14)
$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1226, DW_AT_name("openFlag")
	.dwattr $C$DW$1226, DW_AT_TI_symbol_name("openFlag")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x14)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1227, DW_AT_name("creatorProcId")
	.dwattr $C$DW$1227, DW_AT_TI_symbol_name("creatorProcId")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x14)
$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1228, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1228, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x14)
$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1229, DW_AT_name("sharedAddrSize")
	.dwattr $C$DW$1229, DW_AT_TI_symbol_name("sharedAddrSize")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x14)
$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1230, DW_AT_name("gate")
	.dwattr $C$DW$1230, DW_AT_TI_symbol_name("gate")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x14)
$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1231, DW_AT_name("cacheFlags")
	.dwattr $C$DW$1231, DW_AT_TI_symbol_name("cacheFlags")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xae)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x14)
$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1232, DW_AT_name("numNotifyEntries")
	.dwattr $C$DW$1232, DW_AT_TI_symbol_name("numNotifyEntries")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x14)
$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1233, DW_AT_name("numSubNotifyEntries")
	.dwattr $C$DW$1233, DW_AT_TI_symbol_name("numSubNotifyEntries")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x14)
$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1234, DW_AT_name("regionId")
	.dwattr $C$DW$1234, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$333

	.dwattr $C$DW$T$333, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x10)
$C$DW$T$1080	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_Params")
	.dwattr $C$DW$T$1080, DW_AT_type(*$C$DW$T$333)
	.dwattr $C$DW$T$1080, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1080, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1080, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$1080, DW_AT_decl_column(0x03)
$C$DW$T$1091	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$1080)
$C$DW$T$1092	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$1091)
	.dwattr $C$DW$T$1092, DW_AT_address_class(0x20)
$C$DW$T$1081	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1081, DW_AT_type(*$C$DW$T$1080)
	.dwattr $C$DW$T$1081, DW_AT_address_class(0x20)

$C$DW$T$337	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$337, DW_AT_name("ClientNotifyMgr_registerNotifyParams_Tag")
	.dwattr $C$DW$T$337, DW_AT_byte_size(0x1c)
$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1235, DW_AT_name("clientHandle")
	.dwattr $C$DW$1235, DW_AT_TI_symbol_name("clientHandle")
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x12)
$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1236, DW_AT_name("procId")
	.dwattr $C$DW$1236, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x12)
$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1237, DW_AT_name("notifyType")
	.dwattr $C$DW$1237, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x12)
$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$336)
	.dwattr $C$DW$1238, DW_AT_name("fxnPtr")
	.dwattr $C$DW$1238, DW_AT_TI_symbol_name("fxnPtr")
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x1d)
$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1239, DW_AT_name("cbContext")
	.dwattr $C$DW$1239, DW_AT_TI_symbol_name("cbContext")
	.dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x12)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1240, DW_AT_name("watermarkCond1")
	.dwattr $C$DW$1240, DW_AT_TI_symbol_name("watermarkCond1")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x12)
$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1241, DW_AT_name("watermarkCond2")
	.dwattr $C$DW$1241, DW_AT_TI_symbol_name("watermarkCond2")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$337

	.dwattr $C$DW$T$337, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x10)
$C$DW$T$1094	.dwtag  DW_TAG_typedef, DW_AT_name("ClientNotifyMgr_registerNoitifyParams")
	.dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1094, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/ClientNotifyMgr.h")
	.dwattr $C$DW$T$1094, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
$C$DW$T$1095	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$1094)
	.dwattr $C$DW$T$1095, DW_AT_address_class(0x20)

$C$DW$T$338	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$338, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
$C$DW$1242	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1242, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x05)
$C$DW$1243	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_INTERRUPT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1243, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x05)
$C$DW$1244	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_TASKLET"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1244, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x05)
$C$DW$1245	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_THREAD"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1245, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x05)
$C$DW$1246	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_LocalProtect_PROCESS"), DW_AT_const_value(0x04)
	.dwattr $C$DW$1246, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$338

	.dwattr $C$DW$T$338, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x0e)
$C$DW$T$339	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_LocalProtect")
	.dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
	.dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$339, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x03)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("GateMP_Object")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$327	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$327, DW_AT_address_class(0x20)
$C$DW$T$328	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Handle")
	.dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$327)
	.dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$328, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$328, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$328, DW_AT_decl_column(0x1f)
$C$DW$T$1097	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$T$1097, DW_AT_address_class(0x20)

$C$DW$T$342	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$342, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$342, DW_AT_byte_size(0x10)
$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1247, DW_AT_name("name")
	.dwattr $C$DW$1247, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x0c)
$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1248, DW_AT_name("regionId")
	.dwattr $C$DW$1248, DW_AT_TI_symbol_name("regionId")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x0c)
$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1249, DW_AT_name("sharedAddr")
	.dwattr $C$DW$1249, DW_AT_TI_symbol_name("sharedAddr")
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x09)
$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$339)
	.dwattr $C$DW$1250, DW_AT_name("localProtect")
	.dwattr $C$DW$1250, DW_AT_TI_symbol_name("localProtect")
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x19)
$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$341)
	.dwattr $C$DW$1251, DW_AT_name("remoteProtect")
	.dwattr $C$DW$1251, DW_AT_TI_symbol_name("remoteProtect")
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$342

	.dwattr $C$DW$T$342, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x10)
$C$DW$T$1103	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_Params")
	.dwattr $C$DW$T$1103, DW_AT_type(*$C$DW$T$342)
	.dwattr $C$DW$T$1103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1103, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$1103, DW_AT_decl_line(0x123)
	.dwattr $C$DW$T$1103, DW_AT_decl_column(0x03)

$C$DW$T$340	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$340, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$340, DW_AT_byte_size(0x01)
$C$DW$1252	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_NONE"), DW_AT_const_value(0x00)
	.dwattr $C$DW$1252, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x05)
$C$DW$1253	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_SYSTEM"), DW_AT_const_value(0x01)
	.dwattr $C$DW$1253, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x05)
$C$DW$1254	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM1"), DW_AT_const_value(0x02)
	.dwattr $C$DW$1254, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x05)
$C$DW$1255	.dwtag  DW_TAG_enumerator, DW_AT_name("GateMP_RemoteProtect_CUSTOM2"), DW_AT_const_value(0x03)
	.dwattr $C$DW$1255, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$340

	.dwattr $C$DW$T$340, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$340, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$340, DW_AT_decl_column(0x0e)
$C$DW$T$341	.dwtag  DW_TAG_typedef, DW_AT_name("GateMP_RemoteProtect")
	.dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$340)
	.dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$341, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/GateMP.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x03)

$C$DW$T$420	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$420, DW_AT_name("IRingIO_Object_tag")
	.dwattr $C$DW$T$420, DW_AT_byte_size(0x90)
$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$343)
	.dwattr $C$DW$1256, DW_AT_name("listElem")
	.dwattr $C$DW$1256, DW_AT_TI_symbol_name("listElem")
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x27)
$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1257, DW_AT_name("ownerProcId")
	.dwattr $C$DW$1257, DW_AT_TI_symbol_name("ownerProcId")
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x27)
$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$324)
	.dwattr $C$DW$1258, DW_AT_name("name")
	.dwattr $C$DW$1258, DW_AT_TI_symbol_name("name")
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x27)
$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1259, DW_AT_name("ctrlSharedAddr")
	.dwattr $C$DW$1259, DW_AT_TI_symbol_name("ctrlSharedAddr")
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x27)
$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1260, DW_AT_name("ctrlRegionId")
	.dwattr $C$DW$1260, DW_AT_TI_symbol_name("ctrlRegionId")
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x27)
$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1261, DW_AT_name("remoteProcId")
	.dwattr $C$DW$1261, DW_AT_TI_symbol_name("remoteProcId")
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x27)
$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1262, DW_AT_name("top")
	.dwattr $C$DW$1262, DW_AT_TI_symbol_name("top")
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x27)
$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1263, DW_AT_name("nsKey")
	.dwattr $C$DW$1263, DW_AT_TI_symbol_name("nsKey")
	.dwattr $C$DW$1263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x27)
$C$DW$1264	.dwtag  DW_TAG_member
	.dwattr $C$DW$1264, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1264, DW_AT_name("created")
	.dwattr $C$DW$1264, DW_AT_TI_symbol_name("created")
	.dwattr $C$DW$1264, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1264, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x27)
$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$352)
	.dwattr $C$DW$1265, DW_AT_name("deleteFn")
	.dwattr $C$DW$1265, DW_AT_TI_symbol_name("deleteFn")
	.dwattr $C$DW$1265, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x27)
$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$353)
	.dwattr $C$DW$1266, DW_AT_name("close")
	.dwattr $C$DW$1266, DW_AT_TI_symbol_name("close")
	.dwattr $C$DW$1266, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x27)
$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$364)
	.dwattr $C$DW$1267, DW_AT_name("registerNotifier")
	.dwattr $C$DW$1267, DW_AT_TI_symbol_name("registerNotifier")
	.dwattr $C$DW$1267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x104)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x27)
$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$367)
	.dwattr $C$DW$1268, DW_AT_name("unregisterNotifier")
	.dwattr $C$DW$1268, DW_AT_TI_symbol_name("unregisterNotifier")
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x27)
$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$370)
	.dwattr $C$DW$1269, DW_AT_name("setWaterMark")
	.dwattr $C$DW$1269, DW_AT_TI_symbol_name("setWaterMark")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x27)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$373)
	.dwattr $C$DW$1270, DW_AT_name("setNotifyType")
	.dwattr $C$DW$1270, DW_AT_TI_symbol_name("setNotifyType")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x27)
$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$379)
	.dwattr $C$DW$1271, DW_AT_name("acquire")
	.dwattr $C$DW$1271, DW_AT_TI_symbol_name("acquire")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x27)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$380)
	.dwattr $C$DW$1272, DW_AT_name("release")
	.dwattr $C$DW$1272, DW_AT_TI_symbol_name("release")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x27)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$381)
	.dwattr $C$DW$1273, DW_AT_name("cancel")
	.dwattr $C$DW$1273, DW_AT_TI_symbol_name("cancel")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x27)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$385)
	.dwattr $C$DW$1274, DW_AT_name("getvAttribute")
	.dwattr $C$DW$1274, DW_AT_TI_symbol_name("getvAttribute")
	.dwattr $C$DW$1274, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x27)
$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$1275, DW_AT_name("setvAttribute")
	.dwattr $C$DW$1275, DW_AT_TI_symbol_name("setvAttribute")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x27)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$391)
	.dwattr $C$DW$1276, DW_AT_name("getAttribute")
	.dwattr $C$DW$1276, DW_AT_TI_symbol_name("getAttribute")
	.dwattr $C$DW$1276, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x27)
$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$1277, DW_AT_name("setAttribute")
	.dwattr $C$DW$1277, DW_AT_TI_symbol_name("setAttribute")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x27)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$1278, DW_AT_name("flush")
	.dwattr $C$DW$1278, DW_AT_TI_symbol_name("flush")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x27)
$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$400)
	.dwattr $C$DW$1279, DW_AT_name("notify")
	.dwattr $C$DW$1279, DW_AT_TI_symbol_name("notify")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x2b)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$405)
	.dwattr $C$DW$1280, DW_AT_name("getValidSize")
	.dwattr $C$DW$1280, DW_AT_TI_symbol_name("getValidSize")
	.dwattr $C$DW$1280, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x27)
$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$406)
	.dwattr $C$DW$1281, DW_AT_name("getEmptySize")
	.dwattr $C$DW$1281, DW_AT_TI_symbol_name("getEmptySize")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0x120)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x27)
$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$1282, DW_AT_name("getValidAttrSize")
	.dwattr $C$DW$1282, DW_AT_TI_symbol_name("getValidAttrSize")
	.dwattr $C$DW$1282, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x27)
$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$408)
	.dwattr $C$DW$1283, DW_AT_name("getEmptyAttrSize")
	.dwattr $C$DW$1283, DW_AT_TI_symbol_name("getEmptyAttrSize")
	.dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x27)
$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$409)
	.dwattr $C$DW$1284, DW_AT_name("getAcquiredOffset")
	.dwattr $C$DW$1284, DW_AT_TI_symbol_name("getAcquiredOffset")
	.dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x27)
$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$410)
	.dwattr $C$DW$1285, DW_AT_name("getAcquiredSize")
	.dwattr $C$DW$1285, DW_AT_TI_symbol_name("getAcquiredSize")
	.dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x27)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$411)
	.dwattr $C$DW$1286, DW_AT_name("getWaterMark")
	.dwattr $C$DW$1286, DW_AT_TI_symbol_name("getWaterMark")
	.dwattr $C$DW$1286, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x27)
$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$414)
	.dwattr $C$DW$1287, DW_AT_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1287, DW_AT_TI_symbol_name("getCliNotifyMgrShAddr")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x27)
$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$415)
	.dwattr $C$DW$1288, DW_AT_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1288, DW_AT_TI_symbol_name("getCliNotifyMgrGateShAddr")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x2a)
$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$418)
	.dwattr $C$DW$1289, DW_AT_name("setNotifyId")
	.dwattr $C$DW$1289, DW_AT_TI_symbol_name("setNotifyId")
	.dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x28)
$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$419)
	.dwattr $C$DW$1290, DW_AT_name("resetNotifyId")
	.dwattr $C$DW$1290, DW_AT_TI_symbol_name("resetNotifyId")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0x132)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x28)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1291, DW_AT_name("obj")
	.dwattr $C$DW$1291, DW_AT_TI_symbol_name("obj")
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0x134)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x28)
	.dwendtag $C$DW$T$420

	.dwattr $C$DW$T$420, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$420, DW_AT_decl_line(0xed)
	.dwattr $C$DW$T$420, DW_AT_decl_column(0x08)
$C$DW$T$346	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Object")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$420)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x23)
$C$DW$T$347	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$346)
	.dwattr $C$DW$T$347, DW_AT_address_class(0x20)
$C$DW$T$348	.dwtag  DW_TAG_typedef, DW_AT_name("IRingIO_Handle")
	.dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$347)
	.dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$348, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/IRingIO.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x1a)
$C$DW$T$349	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$349, DW_AT_type(*$C$DW$T$348)
	.dwattr $C$DW$T$349, DW_AT_address_class(0x20)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("NameServer_Object")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$1105	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1105, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$1105, DW_AT_address_class(0x20)
$C$DW$T$1106	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Handle")
	.dwattr $C$DW$T$1106, DW_AT_type(*$C$DW$T$1105)
	.dwattr $C$DW$T$1106, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1106, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1106, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$1106, DW_AT_decl_column(0x23)

$C$DW$T$421	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$421, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$421, DW_AT_byte_size(0x14)
$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1292, DW_AT_name("maxRuntimeEntries")
	.dwattr $C$DW$1292, DW_AT_TI_symbol_name("maxRuntimeEntries")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x0a)
$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$319)
	.dwattr $C$DW$1293, DW_AT_name("tableHeap")
	.dwattr $C$DW$1293, DW_AT_TI_symbol_name("tableHeap")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x0a)
$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1294, DW_AT_name("checkExisting")
	.dwattr $C$DW$1294, DW_AT_TI_symbol_name("checkExisting")
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x0a)
$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1295, DW_AT_name("maxValueLen")
	.dwattr $C$DW$1295, DW_AT_TI_symbol_name("maxValueLen")
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x0a)
$C$DW$1296	.dwtag  DW_TAG_member
	.dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$402)
	.dwattr $C$DW$1296, DW_AT_name("maxNameLen")
	.dwattr $C$DW$1296, DW_AT_TI_symbol_name("maxNameLen")
	.dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1296, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$421

	.dwattr $C$DW$T$421, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$421, DW_AT_decl_line(0xca)
	.dwattr $C$DW$T$421, DW_AT_decl_column(0x10)
$C$DW$T$1107	.dwtag  DW_TAG_typedef, DW_AT_name("NameServer_Params")
	.dwattr $C$DW$T$1107, DW_AT_type(*$C$DW$T$421)
	.dwattr $C$DW$T$1107, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1107, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/ipc_1_25_03_15/packages/ti/ipc/NameServer.h")
	.dwattr $C$DW$T$1107, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$1107, DW_AT_decl_column(0x03)

$C$DW$T$426	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$426, DW_AT_name("RingIOShm_Attr_tag")
	.dwattr $C$DW$T$426, DW_AT_byte_size(0x10)
$C$DW$1297	.dwtag  DW_TAG_member
	.dwattr $C$DW$1297, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1297, DW_AT_name("offset")
	.dwattr $C$DW$1297, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$1297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1297, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x0f)
$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$425)
	.dwattr $C$DW$1298, DW_AT_name("prevoffset")
	.dwattr $C$DW$1298, DW_AT_TI_symbol_name("prevoffset")
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1298, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1298, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x0f)
$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1299, DW_AT_name("type")
	.dwattr $C$DW$1299, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x0f)
$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1300, DW_AT_name("size")
	.dwattr $C$DW$1300, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x0f)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1301, DW_AT_name("param")
	.dwattr $C$DW$1301, DW_AT_TI_symbol_name("param")
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$426

	.dwattr $C$DW$T$426, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$426, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$426, DW_AT_decl_column(0x10)
$C$DW$T$1108	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Attr")
	.dwattr $C$DW$T$1108, DW_AT_type(*$C$DW$T$426)
	.dwattr $C$DW$T$1108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1108, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$1108, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$T$1108, DW_AT_decl_column(0x03)
$C$DW$T$1109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1109, DW_AT_type(*$C$DW$T$1108)
	.dwattr $C$DW$T$1109, DW_AT_address_class(0x20)
$C$DW$T$1113	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1113, DW_AT_type(*$C$DW$T$1109)

$C$DW$T$431	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$431, DW_AT_name("RingIOShm_Client_tag")
	.dwattr $C$DW$T$431, DW_AT_byte_size(0x40)
$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1302, DW_AT_name("pDataStart")
	.dwattr $C$DW$1302, DW_AT_TI_symbol_name("pDataStart")
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1302, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x1c)
$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$374)
	.dwattr $C$DW$1303, DW_AT_name("pAttrStart")
	.dwattr $C$DW$1303, DW_AT_TI_symbol_name("pAttrStart")
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1303, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x1c)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1304, DW_AT_name("acqStart")
	.dwattr $C$DW$1304, DW_AT_TI_symbol_name("acqStart")
	.dwattr $C$DW$1304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1304, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x1c)
$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1305, DW_AT_name("acqSize")
	.dwattr $C$DW$1305, DW_AT_TI_symbol_name("acqSize")
	.dwattr $C$DW$1305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1305, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x1c)
$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1306, DW_AT_name("acqAttrStart")
	.dwattr $C$DW$1306, DW_AT_TI_symbol_name("acqAttrStart")
	.dwattr $C$DW$1306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1306, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1306, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x1c)
$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1307, DW_AT_name("acqAttrSize")
	.dwattr $C$DW$1307, DW_AT_TI_symbol_name("acqAttrSize")
	.dwattr $C$DW$1307, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1307, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1307, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x1c)
$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1308, DW_AT_name("notifyType")
	.dwattr $C$DW$1308, DW_AT_TI_symbol_name("notifyType")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1308, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x1c)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$427)
	.dwattr $C$DW$1309, DW_AT_name("notifyParam")
	.dwattr $C$DW$1309, DW_AT_TI_symbol_name("notifyParam")
	.dwattr $C$DW$1309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x1c)
$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1310, DW_AT_name("notifyWaterMark")
	.dwattr $C$DW$1310, DW_AT_TI_symbol_name("notifyWaterMark")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x1c)
$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1311, DW_AT_name("flags")
	.dwattr $C$DW$1311, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x1c)
$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1312, DW_AT_name("isValid")
	.dwattr $C$DW$1312, DW_AT_TI_symbol_name("isValid")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x1c)
$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1313, DW_AT_name("refCount")
	.dwattr $C$DW$1313, DW_AT_TI_symbol_name("refCount")
	.dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1313, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x1c)
$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1314, DW_AT_name("notifyId")
	.dwattr $C$DW$1314, DW_AT_TI_symbol_name("notifyId")
	.dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1314, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1314, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1314, DW_AT_decl_column(0x1c)
$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$326)
	.dwattr $C$DW$1315, DW_AT_name("isRegistered")
	.dwattr $C$DW$1315, DW_AT_TI_symbol_name("isRegistered")
	.dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1315, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1315, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1315, DW_AT_decl_column(0x1c)
$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$430)
	.dwattr $C$DW$1316, DW_AT_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1316, DW_AT_TI_symbol_name("clientNotifyMgrHandle")
	.dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1316, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1316, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1316, DW_AT_decl_column(0x1c)
$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$328)
	.dwattr $C$DW$1317, DW_AT_name("clientNotifyMgrGate")
	.dwattr $C$DW$1317, DW_AT_TI_symbol_name("clientNotifyMgrGate")
	.dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1317, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1317, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1317, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$431

	.dwattr $C$DW$T$431, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$431, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$431, DW_AT_decl_column(0x10)
$C$DW$T$443	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Client")
	.dwattr $C$DW$T$443, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$T$443, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$443, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$443, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$T$443, DW_AT_decl_column(0x03)
$C$DW$T$1118	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1118, DW_AT_type(*$C$DW$T$443)
$C$DW$T$1119	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1119, DW_AT_type(*$C$DW$T$1118)
	.dwattr $C$DW$T$1119, DW_AT_address_class(0x20)
$C$DW$T$444	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$444, DW_AT_type(*$C$DW$T$443)
	.dwattr $C$DW$T$444, DW_AT_address_class(0x20)
$C$DW$T$445	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_ClientHandle")
	.dwattr $C$DW$T$445, DW_AT_type(*$C$DW$T$444)
	.dwattr $C$DW$T$445, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$445, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$445, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$445, DW_AT_decl_column(0x22)
$C$DW$T$1120	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$1120, DW_AT_type(*$C$DW$T$431)
$C$DW$T$1121	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1121, DW_AT_type(*$C$DW$T$1120)
	.dwattr $C$DW$T$1121, DW_AT_address_class(0x20)
$C$DW$T$1122	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1122, DW_AT_type(*$C$DW$T$431)
	.dwattr $C$DW$T$1122, DW_AT_address_class(0x20)

$C$DW$T$432	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$432, DW_AT_name("RingIOShm_Config_Tag")
	.dwattr $C$DW$T$432, DW_AT_byte_size(0x04)
$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1318, DW_AT_name("notifyEventNo")
	.dwattr $C$DW$1318, DW_AT_TI_symbol_name("notifyEventNo")
	.dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1318, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1318, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$1318, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$432

	.dwattr $C$DW$T$432, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$432, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$432, DW_AT_decl_column(0x10)
$C$DW$T$1123	.dwtag  DW_TAG_typedef, DW_AT_name("RingIOShm_Config")
	.dwattr $C$DW$T$1123, DW_AT_type(*$C$DW$T$432)
	.dwattr $C$DW$T$1123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$1123, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$1123, DW_AT_decl_line(0x91)
	.dwattr $C$DW$T$1123, DW_AT_decl_column(0x03)
$C$DW$T$1124	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1124, DW_AT_type(*$C$DW$T$1123)
$C$DW$T$1125	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1125, DW_AT_type(*$C$DW$T$1124)
	.dwattr $C$DW$T$1125, DW_AT_address_class(0x20)
$C$DW$T$1126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$1126, DW_AT_type(*$C$DW$T$1123)
	.dwattr $C$DW$T$1126, DW_AT_address_class(0x20)
$C$DW$T$1127	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$1127, DW_AT_type(*$C$DW$T$1126)

$C$DW$T$437	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$437, DW_AT_name("RingIOShm_ControlStruct_tag")
	.dwattr $C$DW$T$437, DW_AT_byte_size(0x44)
$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$433)
	.dwattr $C$DW$1319, DW_AT_name("interfaceAttrs")
	.dwattr $C$DW$1319, DW_AT_TI_symbol_name("interfaceAttrs")
	.dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1319, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1319, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1319, DW_AT_decl_column(0x1d)
$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1320, DW_AT_name("srPtrBufStart")
	.dwattr $C$DW$1320, DW_AT_TI_symbol_name("srPtrBufStart")
	.dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1320, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1320, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1320, DW_AT_decl_column(0x1c)
$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1321, DW_AT_name("srPtrBufEnd")
	.dwattr $C$DW$1321, DW_AT_TI_symbol_name("srPtrBufEnd")
	.dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1321, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1321, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1321, DW_AT_decl_column(0x1c)
$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1322, DW_AT_name("curBufEnd")
	.dwattr $C$DW$1322, DW_AT_TI_symbol_name("curBufEnd")
	.dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1322, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1322, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1322, DW_AT_decl_column(0x1b)
$C$DW$1323	.dwtag  DW_TAG_member
	.dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1323, DW_AT_name("dataBufEnd")
	.dwattr $C$DW$1323, DW_AT_TI_symbol_name("dataBufEnd")
	.dwattr $C$DW$1323, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1323, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1323, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$1323, DW_AT_decl_column(0x1b)
$C$DW$1324	.dwtag  DW_TAG_member
	.dwattr $C$DW$1324, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1324, DW_AT_name("dataSharedAddrSize")
	.dwattr $C$DW$1324, DW_AT_TI_symbol_name("dataSharedAddrSize")
	.dwattr $C$DW$1324, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1324, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1324, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$1324, DW_AT_decl_column(0x1b)
$C$DW$1325	.dwtag  DW_TAG_member
	.dwattr $C$DW$1325, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1325, DW_AT_name("footBufSize")
	.dwattr $C$DW$1325, DW_AT_TI_symbol_name("footBufSize")
	.dwattr $C$DW$1325, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1325, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1325, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1325, DW_AT_decl_column(0x1b)
$C$DW$1326	.dwtag  DW_TAG_member
	.dwattr $C$DW$1326, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1326, DW_AT_name("validSize")
	.dwattr $C$DW$1326, DW_AT_TI_symbol_name("validSize")
	.dwattr $C$DW$1326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1326, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1326, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1326, DW_AT_decl_column(0x1b)
$C$DW$1327	.dwtag  DW_TAG_member
	.dwattr $C$DW$1327, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1327, DW_AT_name("emptySize")
	.dwattr $C$DW$1327, DW_AT_TI_symbol_name("emptySize")
	.dwattr $C$DW$1327, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1327, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1327, DW_AT_decl_line(0x105)
	.dwattr $C$DW$1327, DW_AT_decl_column(0x1b)
$C$DW$1328	.dwtag  DW_TAG_member
	.dwattr $C$DW$1328, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1328, DW_AT_name("srPtrAttrBufStart")
	.dwattr $C$DW$1328, DW_AT_TI_symbol_name("srPtrAttrBufStart")
	.dwattr $C$DW$1328, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1328, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1328, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1328, DW_AT_decl_column(0x1b)
$C$DW$1329	.dwtag  DW_TAG_member
	.dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1329, DW_AT_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1329, DW_AT_TI_symbol_name("srPtrAttrBufEnd")
	.dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1329, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1329, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1329, DW_AT_decl_column(0x1b)
$C$DW$1330	.dwtag  DW_TAG_member
	.dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1330, DW_AT_name("curAttrBufEnd")
	.dwattr $C$DW$1330, DW_AT_TI_symbol_name("curAttrBufEnd")
	.dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1330, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1330, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1330, DW_AT_decl_column(0x1b)
$C$DW$1331	.dwtag  DW_TAG_member
	.dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1331, DW_AT_name("validAttrSize")
	.dwattr $C$DW$1331, DW_AT_TI_symbol_name("validAttrSize")
	.dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1331, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1331, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1331, DW_AT_decl_column(0x1b)
$C$DW$1332	.dwtag  DW_TAG_member
	.dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$317)
	.dwattr $C$DW$1332, DW_AT_name("emptyAttrSize")
	.dwattr $C$DW$1332, DW_AT_TI_symbol_name("emptyAttrSize")
	.dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1332, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1332, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1332, DW_AT_decl_column(0x1b)
$C$DW$1333	.dwtag  DW_TAG_member
	.dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$425)
	.dwattr $C$DW$1333, DW_AT_name("prevAttrOffset")
	.dwattr $C$DW$1333, DW_AT_TI_symbol_name("prevAttrOffset")
	.dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1333, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1333, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1333, DW_AT_decl_column(0x1b)
$C$DW$1334	.dwtag  DW_TAG_member
	.dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$332)
	.dwattr $C$DW$1334, DW_AT_name("procId")
	.dwattr $C$DW$1334, DW_AT_TI_symbol_name("procId")
	.dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1334, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1334, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1334, DW_AT_decl_column(0x1b)
$C$DW$1335	.dwtag  DW_TAG_member
	.dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$436)
	.dwattr $C$DW$1335, DW_AT_name("gateMPSharedAddr")
	.dwattr $C$DW$1335, DW_AT_TI_symbol_name("gateMPSharedAddr")
	.dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1335, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$1335, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1335, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$437

	.dwattr $C$DW$T$437, DW_AT_decl_file("/opt/Project/Camera/Source/ipnc_rdk/../ti_tools/syslink_2_21_02_10/packages/ti/syslink/inc/_RingIOShm.h")
	.dwattr $C$DW$T$437, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$437, DW_AT_decl_column(0x10)
